{"id":"368La1qZAv72idE55Whuffkk2TBtHuSndX6iNywdUkLBDxxx55cLvowsw5Rj5VbHUHjCYUBR5tHfX6BAYFQZS3af","title":"top scoring links : europe","displayTitle":"News - Reddit - Europe","url":"https://www.reddit.com/r/europe/top/.rss?sort=top&t=day&limit=10","feedLink":"https://www.reddit.com/r/europe/top/?sort=top&t=day&limit=10","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":10,"items":[{"title":"EU slaps tariffs on produce from Republican states","url":"https://www.cbc.ca/news/world/trump-europe-trade-retaliaton-1.7481215","date":1741781370,"author":"/u/Delicious_Adeptness9","guid":371,"unread":true,"content":"<p>The European Union on Wednesday announced retaliatory trade action with new duties on U.S. industrial and farm products, responding within hours to the Trump administration's increase in tariffs on all steel and aluminum imports to 25 per cent.</p><p>The world's biggest trading bloc was expecting the U.S. tariffs and prepared in advance, but the measures still place great strain on already tense transatlantic relations. Only last month, Washington warned Europe that it would have to take care of its own security in the future.</p><p>The EU measures will cover goods from the United States worth some 26 billion euros ($40 billion Cdn)&nbsp;—&nbsp;and not just steel and aluminum products. Textiles, home appliances, agricultural goods will be hit with tariffs, as will motorcycles, bourbon, peanut butter and jeans, the latter of which were also taxed&nbsp;during U.S. President Donald Trump's first term.</p><p>The EU duties aim for pressure points in the U.S. while minimizing additional damage to Europe. The tariffs — taxes on imports — primarily target Republican-held states, hitting soybeans in House Speaker Mike Johnson's Louisiana, and also beef and poultry in Kansas and Nebraska. Produce in Alabama, Georgia and Virginia is also on the list.</p><p>The European Commission, which manages trade and commercial conflicts on behalf of the 27 EU member countries, said leather goods and agricultural products beyond beef and poultry would be hit, including&nbsp;some seafood, nuts, eggs, sugar and vegetables.</p><h2>Tariffs 'not in our common interest'</h2><p>European Commission President Ursula von der Leyen said in a statement that the bloc \"will always remain open to negotiation.\"</p><p>\"As the U.S. are applying tariffs worth 28 billion dollars, we are responding with countermeasures worth 26 billion euros,\" she said. \"We firmly believe that in a world fraught with geopolitical and economic uncertainties, it is not in our common interest to burden our economies with tariffs.\"</p><div><em><strong>WATCH |&nbsp;Trudeau seeks closer ties, trade with European allies</strong></em>:&nbsp;</div><p>Trump said his taxes would help create U.S. factory jobs, but von der Leyen said: \"Jobs are at stake. Prices will go up. In Europe and in the United States.\"</p><p>\"We deeply regret this measure. Tariffs are taxes. They are bad for business&nbsp;and even worse for consumers. These tariffs are disrupting supply chains. They bring uncertainty for the economy,\" she said.</p><p>The American Chamber of Commerce to the EU said the U.S. tariffs and EU countermeasures \"will only harm jobs, prosperity and security on both sides of the Atlantic.\"</p><p>\"The two sides must de-escalate and find a negotiated outcome urgently,\" the chamber said Wednesday.</p><h2>A repeat of Trump's 1st term</h2><p>Trump slapped <a href=\"https://www.cbc.ca/news/business/eu-tariffs-united-states-1.4693686\" target=\"_blank\">similar tariffs on EU </a>steel and aluminum during his first term in office, which enraged European and other allies. The EU also imposed countermeasures in retaliation at the time.</p><p>This time, the EU action will involve two steps. First, on April 1, the commission will reintroduce what it calls \"rebalancing measures,\" which the EU had from 2018 and 2020 but were then suspended under the Biden administration. Then on April 13 come the additional duties targeting 18 billion euros ($19.6 billion) in U.S. exports to the bloc.</p><div><em><strong>WATCH | What does Trump really want?</strong></em></div><p>EU Trade Commissioner&nbsp;Maros Sefcovic&nbsp;travelled to Washington last month in an effort to head off the tariffs, meeting with U.S. Commerce Secretary Howard Lutnick and other top trade officials.</p><p>He said on Wednesday that it became clear during the trip \"that the EU is not the problem.\"</p><p>\"I argued to avoid the unnecessary burden of measures and countermeasures, but you need a partner for that. You need both hands to clap,\" Sefcovic&nbsp;told reporters at the European Parliament in Strasbourg, France.</p><h2>European steel companies brace for losses</h2><p>The EU could lose up to 3.7 million tons of steel exports, according to the European steel association Eurofer. The U.S. is the second-biggest export market for EU steel producers, representing 16 per cent&nbsp;of the total EU steel exports.</p><p>The EU estimates that annual trade volume between both sides stands at about $1.5 trillion US, representing some 30 per cent&nbsp;of global trade. While the bloc has a substantial export surplus in goods, it says that is partly offset by the U.S. surplus in the trade of services.</p><p>Britain, which isn't part of the EU, meanwhile said it won't impose retaliatory measures of its own on the U.S.</p>","contentLength":4392,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1j9ijzv/eu_slaps_tariffs_on_produce_from_republican_states/"},{"title":"German troops annexed Austria on this day in 1938","url":"https://www.reddit.com/r/europe/comments/1j9hukh/german_troops_annexed_austria_on_this_day_in_1938/","date":1741778792,"author":"/u/EUstrongerthanUS","guid":377,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Romania hits back after Kremlin criticizes rejection of Georgescu’s candidacy: “Russia hasn’t had free elections for nearly 20 years. An aggressor state cannot give democracy lessons”","url":"https://hotnews.ro/mae-replica-dupa-ce-kremlinul-a-criticat-respingerea-candidaturii-lui-georgescu-rusia-nu-are-alegeri-libere-de-aproape-20-ani-un-stat-agresor-nu-poate-sa-dea-lectii-de-democratie-1922823","date":1741775896,"author":"/u/that_one_retard_2","guid":375,"unread":true,"content":"<p><strong>„Afirmația lui Dmitri Peskov este inacceptabilă dar în linie cu efortul sistematic al Federației Ruse de a manipula și interfera cu procesele democratice din România”, transmite Ministerul Afacerilor Externe într-o replică după ce purtătorul de cuvânt al Kremlinului a criticat decizia BEC de invalidarea a candidaturii lui Călin Georgescu</strong></p><p>„Kremlinul constată că eșuează, și de aici frustrarea”, transmite diplomația română.</p><p>De asemenea, MAE amintește istoricul de încălcări ale drepturilor omului comise de autoritățile ruse, pentru a sublinia că este descalificată din a da „lecții de democrație”.</p><p>„Rusia nu are alegeri libere de aproape 20 ani. Un stat agresor nu poate să dea lecții de democrație.</p><p>Pentru contrast, în Rusia opoziția nu are parte de acces la instituții și procese legale. Opozanții sunt executați la câțiva metri de Kremlin”, transmite MAE.</p><p>„România a răspuns deja direct ingerinței străine trimițând acasă pe cei care au ținut legătura cu o grupare paramilitară (de sorginte nazistă) asociată unui candidat, care încerca să răstoarne ordinea democratică constituțională în România”, conchide MAE.</p><p><a href=\"https://hotnews.ro/kremlinul-lectie-de-democratie-pentru-romania-alegerile-prezidentiale-fara-calin-georgescu-nu-vor-avea-legitimitate-1922148\">Kremlinul a apreciat marți </a>că alegerile prezidențiale din România fără candidatura lui Călin Georgescu, ultranaționalist și prorus, „nu vor avea legitimitate”.</p><p>„Desigur, dacă este să spunem lucrurilor pe nume, orice scrutin organizat fără el (Georgescu) nu va avea legitimitate”, a declarat reporterilor purtătorul de cuvânt al președintelui rus, Dmitri Peskov</p><p>Purtătorul de cuvânt al Kremlinului a calificat drept „prostii” acuzațiile că Rusia ar avea legături cu Georgescu.</p><p>Și ministrul rus de Externe,&nbsp;Serghei Lavrov, a susținut, marți, în declarații critice la adresa Occidentului, că „în ţări precum România se întâmplă lucruri flagrante în domeniul electoral”.</p><p>Afirmațiile celor doi oficiali ruși au venit înainte ca CCR să ia decizia finală prin care Călin Georgescu a pierdut orice cale de atac și nu va mai putea candida în alegerile prezidențiale din 4 mai.</p>","contentLength":2117,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1j9h3rg/romania_hits_back_after_kremlin_criticizes/"},{"title":"‘I feel utter anger’: From Canada to Europe, a movement to boycott US goods is spreading | Trump administration","url":"https://www.theguardian.com/us-news/2025/mar/12/i-feel-utter-anger-from-canada-to-europe-a-movement-to-boycott-us-goods-is-spreading","date":1741772410,"author":"/u/ExtremeOccident","guid":372,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1j9ga7n/i_feel_utter_anger_from_canada_to_europe_a/"},{"title":"After breaking off their agreement with France, Australians worry they'll never receive American submarines","url":"https://www.marianne.net/monde/geopolitique/apres-avoir-rompu-l-accord-avec-la-france-les-australiens-s-inquietent-de-ne-jamais-recevoir-les-sous-marins-americains","date":1741767355,"author":"/u/EstablishmentNice377","guid":379,"unread":true,"content":"<p>\n    Le projet de sous-marins australiens va-t-il faire pschitt ? En tout cas, ce n'est pas demain qu'il fera plouf. Un article paru le 6 mars 2025 dans le <a href=\"https://www.theguardian.com/world/2025/mar/07/surface-tension-could-the-promised-aukus-nuclear-submarines-simply-never-be-handed-over-to-australia\" rel=\"noopener\" target=\"_blank\"></a> s'inquiète d'une possibilité : l'Australie, après avoir voulu faire des économies en n'achetant pas les sous-marins français, risque de se retrouver sans flotte, en raison de la défaillance de l'éternel allié américain.\n</p><p>\n    Récapitulons. Le 15 septembre 2021, Australie, États-Unis et Royaume-Uni dévoilent une petite bombe dans le milieu de la défense : AUKUS. Issu de 18 mois de pourparlers secrets, cet accord prévoit une large coopération militaire entre l'Oncle Sam, le partenaire particulier britannique et son allié du Commonwealth.\n</p><p>\n    Au cœur des négociations, l'acquisition par la marine australienne de cinq sous-marins de style britannique, et trois sous-marins américains. Mécaniquement, cet accord met donc fin à un engagement d'achat de 12 sous-marins français : donc à un contrat de 56 milliards d'euros. Petit scandale diplomatique. La France rappelle même ses ambassadeurs en Australie et aux États-Unis, en réaction à ce qui ressemble à un coup de poignard industriel dans le dos.\n</p><h2>Pas de garantie de livraison</h2><p>\n    Sauf que quelques années plus tard, patatras. Les sous-marins nucléaires – par leur motorisation, pas par leurs missiles – semblent s'éloigner… En tout cas, les Australiens se rendent compte qu'ils sont peut-être les dindons de l'accord. Dans son article pour le , le journaliste australien Ben Doherty s'inquiète sur la souveraineté des futurs sous-marins « australiens » : <em>« Ces sous-marins nucléaires, stationnés en Australie, pourraient arborer des drapeaux américains, transporter des armes américaines, être commandés et armés par des officiers et des marins américains. L'Australie, allié indéfectible, est réduite à une garnison opérationnelle avancée – selon les termes du président de la commission des Affaires étrangères du Congrès américain, rien de plus qu'une \"base centrale d'opérations à partir de laquelle il est possible de projeter la puissance\". »</em></p><p>\n    À vrai dire, la possibilité même que ces submersibles existent un jour pose question. <em>« Tant à Washington qu'à Canberra, la toute première étape suscite une inquiétude croissante : la capacité de l'Amérique à construire les bateaux qu'elle a promis à l'Australie »</em>, abonde le reporter. L'allié américain est en effet de moins en moins fiable, et se concentre sur ses propres capacités, plutôt que sur la coopération.\n</p><p>\n    Le petit vent de panique atteint même l'ancien Premier ministre Malcolm Turnbull : <em>« Il se peut que, malheureusement, nous finissions par ne plus avoir de sous-marins. Nous devrons alors investir dans d'autres moyens de défense. Mais le message principal est que nous allons devoir envisager de défendre l'Australie par nos propres moyens. »</em> D'autant que leur engagement avec les Américains risque de leur coûter beaucoup plus cher que prévu financièrement, s'ils veulent convaincre Donald Trump de vraiment leur construire les bateaux tant désirés. Dommage…\n</p>","contentLength":3145,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1j9f80n/after_breaking_off_their_agreement_with_france/"},{"title":"Gas station disguised as a Country","url":"https://www.reddit.com/r/europe/comments/1j9b6n6/gas_station_disguised_as_a_country/","date":1741754347,"author":"/u/CapKharimwa","guid":374,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"The United Nations voted in favor of the creation of an International Day of Hope. The only country to vote against: United States.","url":"https://www.reddit.com/r/europe/comments/1j978t6/the_united_nations_voted_in_favor_of_the_creation/","date":1741741982,"author":"/u/UpgradedSiera6666","guid":376,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Trump wants to invite Zelensky back to the White House","url":"https://www.thedailybeast.com/trump-invites-zelensky-back-to-white-house-as-ukraine-agrees-to-ceasefire-deal/","date":1741725791,"author":"/u/Wonderful-Excuse4922","guid":378,"unread":true,"content":"<a href=\"https://www.thedailybeast.com/category/politics/\"></a><a href=\"https://www.thedailybeast.com/category/politics/\"></a><h2>The immediate 30-day ceasefire takes effect as long as Russia agrees.</h2>","contentLength":69,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1j913dd/trump_wants_to_invite_zelensky_back_to_the_white/"},{"title":"Hungary defies sanctions: Trump ally moves to unfreeze billions in Russian assets","url":"https://www.eurointegration.com.ua/eng/articles/2025/03/11/7206870/","date":1741725721,"author":"/u/EuropeanPravdaUA","guid":373,"unread":true,"content":"<p>15 March 2025 is the deadline for the European Union to renew sanctions against individuals and organisations involved in Russia’s aggression against Ukraine.&nbsp;&nbsp;</p><p>If the deadline is missed, more than 2,400 sanctioned individuals and businesses could suddenly be freed from EU-imposed restrictions.&nbsp;&nbsp;</p><p>There is now a real danger of this happening thanks to Hungary, which is blocking the approval of sanctions. Hungarian Prime Minister Viktor Orbán, one of Trump’s key allies in the EU, has repeatedly undermined EU unity on sanctions. However, until now, Hungary’s opposition has usually amounted to blackmail, demanding concessions from the EU in exchange for its support. This time, however, Brussels sources say Hungary is not making any demands at all.&nbsp;&nbsp;</p><p>The sanctions package at risk includes the freezing of tens of billions of euros in assets belonging to Russian companies, oligarchs and politicians.&nbsp;&nbsp;</p><p>If the EU fails to renew the restrictions before the deadline, there is a real danger that these funds could be moved out of Europe and lost forever, eliminating a crucial potential resource for Ukraine’s reconstruction and military procurement.&nbsp;&nbsp;</p><p>European diplomats are currently scrambling to prevent the worst-case scenario from materialising. However, the issue is likely to resurface as early as July.&nbsp;&nbsp;</p><p>European Pravda has uncovered some behind-the-scenes details and explains what is happening.</p><h2>What sanctions are at stake?</h2><p>In simple terms, the European Union's sanctions regime against Russia consists of two main categories, with a history dating back to 2014.&nbsp;&nbsp;</p><p>In March 2014, following Russia’s illegal annexation of Crimea, the EU imposed individual sanctions on persons and companies responsible for undermining Ukraine’s territorial integrity, sovereignty and independence. In July 2014, after Russian forces shot down Malaysia Airlines Flight MH17, killing all 293 people on board, including 211 EU citizens, the EU introduced economic (or sectoral) sanctions targeting entire sectors of Russia’s economy and key areas of business.&nbsp;&nbsp;</p><p>Both sanction categories have been repeatedly expanded since then. Even after Russia’s full-scale invasion of Ukraine in 2022, the EU maintained the legal framework of its 2014 sanctions, continuing to add new restrictions within the same regulatory framework.&nbsp;&nbsp;</p><p>However, a key procedural legacy from the pre-war period remains: EU sanctions are only valid for six months at a time and must be formally renewed by the European Council every six months.&nbsp;&nbsp;</p><p>The renewal process usually takes place without any debate via a written procedure.&nbsp;&nbsp;</p><p>But in 2025, things did not go as planned.</p><p>All EU sanctions decisions require unanimity. Consequently, the requirement to renew them every six months enables individual countries such as Hungary to exert leverage by threatening to block a decision in exchange for concessions.&nbsp;&nbsp;</p><p>Now the renewal of individual sanctions is at stake. Hungary has once again opposed the extension and has not yet lifted its veto.&nbsp;&nbsp;</p><p>The sanctions package in question is vast, targeting over 2,400 individuals and entities involved in crimes against Ukraine and its sovereignty since 2014. This includes top Russian leadership – Vladimir Putin, Foreign Minister Sergei Lavrov, Prime Minister Mikhail Mishustin, former and current Defence Ministers Sergei Shoigu and Andrei Belousov, and numerous oligarchs who fund the Kremlin.&nbsp;&nbsp;</p><p>Under the current <a href=\"https://eur-lex.europa.eu/legal-content/EN/ALL/?uri=CELEX:02014R0269-20240914\" target=\"_blank\">decision</a>, all these sanctions are set to expire on 15 March 2025. If they are not renewed, all restrictions will be legally lifted on 16 March 2025.&nbsp;&nbsp;</p><p>The sanctions under threat include EU travel bans and asset freezes for Russian individuals and businesses. The latter is particularly significant, as it prevents the Russian elite from accessing and moving their wealth within Europe.</p><h2>The secrets behind Europe's asset freeze&nbsp;</h2><p>The mechanism for freezing Russian assets became fully operational after the full-scale invasion of Ukraine in 2022.&nbsp;&nbsp;</p><p>The total value of Russian assets immobilised in jurisdictions across the EU, the G7 and Australia is estimated at approximately €260 billion. The majority of these funds – around €210 billion – are frozen within the European Union, with €190 billion held in Belgium’s Euroclear, the world’s largest securities depository.&nbsp;&nbsp;</p><p>Discussions of frozen Russian assets often focus solely on Russia’s state funds, primarily those of the Central Bank of Russia (CBR).&nbsp;&nbsp;</p><p>However, as European Pravda has learned, that is far from the whole story.&nbsp;&nbsp;</p><p>Money belonging to Putin and his oligarchs is in the mix.</p><p>\"Indeed, more than half of the frozen assets do belong to the Central Bank. But at least a third of the total sum consists of funds belonging to sanctioned Russian individuals and entities,\" a diplomat from a key EU member state told European Pravda.&nbsp;&nbsp;</p><p>Russian <a href=\"https://amp.rbc.ru/rbcnews/finances/20/02/2025/67b6ed8d9a79476c58cc1d78?fbclid=IwZXh0bgNhZW0CMTEAAR2UG3I5POPFbgAyo2_9emAUAiV_TkOkxh5qV6xXDOx4DpmdEMPkq6Mc2Vg_aem_tz7CzMUCbXN-CvogpM3j_A\" target=\"_blank\">sources</a> also estimate that about a third of the frozen assets in the EU do not belong to the Russian Central Bank.&nbsp;&nbsp;</p><p>While Euroclear does not disclose exact figures, it was recently forced, under Belgian tax regulations on windfall profits, to <a href=\"https://www.euroclear.com/newsandinsights/en/press/2025/mr-05-euroclear-delivers-strong-results-in-2024.html\" target=\"_blank\">acknowledge</a> that a significant portion of its frozen Russian assets does not belong to the CBR.&nbsp;&nbsp;</p><p>European diplomats recognise that if individual sanctions are not renewed, these assets could be lost.&nbsp;&nbsp;</p><p>According to an EU official who spoke to European Pravda on condition of anonymity due to the sensitivity of the matter, failure to extend the sanctions could effectively unfreeze up to 30% of all frozen Russian assets.&nbsp;&nbsp;</p><p>That means at least €60 billion (possibly more) could be at stake.&nbsp;&nbsp;</p><p>This poses a serious threat to Ukraine's financial aid programmes.&nbsp;&nbsp;</p><p>Since late 2024, a new mechanism has been in place whereby G7 countries provide Ukraine with financial aid through loans backed by windfall tax revenues from frozen Russian assets.&nbsp;&nbsp;</p><p>If a third of those assets are unfrozen, the resulting loss in revenues would undermine this funding model. Even more critically, it would dash hopes of transferring the frozen assets themselves to Ukraine – something Kyiv considers a potential source for war reparations and reconstruction funding.&nbsp;&nbsp;</p><p>For now, all these plans hang in the balance due to Hungary's obstruction.</p><p>Brussels has no doubt that Hungary is aligning its position with the United States.&nbsp;&nbsp;</p><p>\"They want to change everything through the so-called American peace negotiations,\" a diplomat familiar with EU sanctions talks told European Pravda.&nbsp;&nbsp;</p><p>The latest round of discussions took place on 10 March in Brussels, during a meeting of EU member state ambassadors.&nbsp;&nbsp;</p><p>\"For most EU countries, extending sanctions is about ensuring that Ukraine has a strong position in any negotiations. Hungary sees it differently,\" the diplomat emphasised, adding that Budapest is not demanding the complete removal of sanctions, but a reduction of the list.</p><p>Multiple sources say that Hungary initially sought to have eight individuals removed from the sanctions list, although diplomats refuse to disclose their names. There has been speculation that Budapest may be pushing for sanctions on Vladimir Putin, Sergei Lavrov and several other Russian officials to be lifted, potentially as a way of creating a more favourable atmosphere for peace talks from the Kremlin’s perspective. However, European Pravda has been unable to confirm or refute these claims.&nbsp;&nbsp;</p><p>One detail about Hungary's position is particularly alarming: its diplomats are no longer presenting clear demands.&nbsp;&nbsp;</p><p>\"Hungary has stated that for now, it does not have a mandate to make a decision on renewing the sanctions regime against Russia,\" an EU source familiar with the 10 March discussions told European Pravda.&nbsp;&nbsp;</p><p>At the time of publication, Hungarian representatives in Brussels had not responded to a request for comment.&nbsp;&nbsp;</p><p>The European Commission believes that Hungary will likely agree to extend sanctions at the last minute.&nbsp;&nbsp;</p><p>However, EU diplomats are considerably more sceptical.&nbsp;&nbsp;</p><p>Two diplomats representing different regions of the EU have suggested that an agreement with Hungary might not be reached by the deadline, meaning the sanctions could expire on 16 March.&nbsp;&nbsp;</p><p>\"We are very concerned, because this could create serious problems,\" one of them told European Pravda.&nbsp;&nbsp;</p><p>Even in the worst-case scenario, Brussels would still have a brief window to negotiate a late agreement and prevent the release of frozen assets. The EU’s infamous bureaucratic complexity, with its multiple legal and procedural steps, could delay Russia from regaining access to its funds.&nbsp;&nbsp;</p><p>Brussels is already preparing for this scenario.&nbsp;&nbsp;</p><p>If Hungary continues its blockade until 15 March, the issue will be raised at the EU Foreign Affairs Council meeting on Monday, 17 March. There, foreign ministers from 26 EU states will seek ways to pressure Hungary into approving the sanctions extension.&nbsp;&nbsp;</p><p>Some EU officials see this as the most likely outcome.&nbsp;&nbsp;</p><p>\"Individual sanctions against Russia will be extended on Monday, 17 March during the Foreign Affairs Council meeting, which oversees sanction regimes,\" one European diplomat confidently stated.&nbsp;&nbsp;</p><p>Even if the EU manages to avoid the consequences of a brief lapse in sanctions, this episode raises serious concerns about the integrity of the EU’s sanctions framework as a whole.&nbsp;&nbsp;</p><p>For now, European negotiators are using all available leverage, including behind-the-scenes diplomatic tools, to persuade Hungary to approve the sanctions in time.&nbsp;&nbsp;</p><p>The next meeting of EU ambassadors is scheduled for Wednesday, 12 March, followed by another critical session on Friday, 14 March, the eve of the deadline.&nbsp;&nbsp;</p><p><em><strong>European Pravda’s correspondent in Brussels&nbsp;</strong></em></p>","contentLength":9715,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1j912c7/hungary_defies_sanctions_trump_ally_moves_to/"},{"title":"Volkswagen open to building military equipment for German army","url":"https://www.telegraph.co.uk/business/2025/03/11/volkswagen-open-to-building-military-equipment-german-army/","date":1741720931,"author":"/u/Straight_Ad2258","guid":380,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1j8z469/volkswagen_open_to_building_military_equipment/"}],"tags":["news","reddit"]}