{"id":"3MxaK2JpEReqG7uUTfHxTELDZk2vRYBtH7tbJ586soFdUhL","title":"Coding Horror","displayTitle":"Dev - Coding Horror","url":"https://blog.codinghorror.com/rss/","feedLink":"https://blog.codinghorror.com/","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":1,"items":[{"title":"Launching The Rural Guaranteed Minimum Income Initiative","url":"https://blog.codinghorror.com/launching-the-rural-guaranteed-minimum-income-initiative/","date":1770191036,"author":"Jeff Atwood","guid":248,"unread":true,"content":"<img src=\"https://blog.codinghorror.com/content/images/2026/02/rgmii-metro-vs-rural-counties-usa-2026-1.png\" alt=\"Launching The Rural Guaranteed Minimum Income Initiative\"><p>It's been a year since I invited Americans to join us in a <strong>pledge to Share the American Dream</strong>:</p><blockquote>1. Support organizations you feel are&nbsp;<a href=\"https://www.charitynavigator.org/\" rel=\"noopener noreferrer\">effectively helping</a>&nbsp;those most in need across America .<p>2. Within the next five years, also contribute&nbsp;</p><strong>public dedications of time or funds towards longer term efforts&nbsp;</strong>to keep the American Dream fair and attainable for all our children.<a href=\"https://blog.codinghorror.com/stay-gold-america/\" rel=\"noreferrer\">Stay gold, America.</a> 💛</blockquote><p>Personally, I’ve become a big believer in one particular quote, especially considering the specific context in which it was delivered:</p><blockquote>“From those to whom much is given, much is expected.” — <a href=\"https://rgmii.org/mary-gates-philanthropic-quote/\" rel=\"noopener noreferrer\" target=\"_blank\">Mary Gates</a></blockquote><p>Those 10 words had a profound effect on the world. Indeed, we  given much, so we, as a family, . On <a href=\"https://denver-frederick.com/2025/06/24/the-american-dream-is-broken-this-50-million-bet-could-help-rebuild-it/\" rel=\"noreferrer\">a recent podcast</a>, my partner Betsy said it better than I could have:</p><blockquote><em>“Well, we have everything we need!” That’s how I’ve always phrased it to [our children]. That, I think, extends [to our philanthropy]. We have everything we need;&nbsp;</em><strong>how do we make sure everybody has what they need?</strong><em>&nbsp;Because that’s the basic thing — Do you have a comfortable place to live? Do you have enough to eat? Do you have healthcare? If you have the basics, you’re in a good place in life, and everybody should have that opportunity.</em></blockquote><p>It’s a question I’ve asked myself a lot <a href=\"https://techcrunch.com/2021/06/02/stack-overflow-acquired-by-prosus-for-a-reported-1-8-billion/\" rel=\"noreferrer\">since 2021</a>. </p><p>We do have everything we need. <em>Why can’t everyone else have the basic things they need, too?</em></p><p>Beyond the $1M to eight nonprofit charities we listed in January 2025, we saw immediate needs becoming so urgent that we quickly added an additional $13M in donations within a few months, for a total of $21M.</p><p>But you can’t take a completely short term view and fight each individual fire reactively, as it comes. You'll never stop firefighting. We also have to do fire abatement and deal with the root causes, improving conditions in this country such that <em>there aren’t so many fires</em>. Thus for the second half, much longer term part, in addition to the $21M already donated, we — half of our remaining wealth — to address the underlying, systemic issues. </p><p>I proposed some <a href=\"https://blog.codinghorror.com/stay-gold-america/#long-term-efforts\" rel=\"noreferrer\">speculative ideas</a> in “Stay Gold,” and this one ended up being the closest:</p><blockquote>We could found a new organization loosely based on the original&nbsp;<a href=\"https://en.wikipedia.org/wiki/RAND_Corporation\" rel=\"noopener noreferrer\">RAND Corporation</a>, but modernized like&nbsp;<a href=\"https://www.leverforchange.org/\" rel=\"noopener noreferrer\">Lever for Change</a>. We can empower the best and brightest to determine a realistic, achievable path toward preserving the American Dream for&nbsp;&nbsp;working within the current system or outside it.</blockquote><p><strong>Guaranteed Minimum Income (GMI)</strong> is an improved version of the older concept of Universal Basic Income (UBI) — rather than indiscriminately giving money to “everyone,” GMI <strong>directs the money towards those who most need it</strong>, particularly families experiencing generational poverty. </p><h3>Why did we decide on GMI?</h3><ul><li>Almost every <strong>existing UBI/GMI study result data we could find indicates </strong>. For example, OpenResearch <a href=\"https://rgmii.org/openresearch-ubi-study-2018-2023-analysis/\" rel=\"noreferrer\">data showed</a> the greatest increase in spending among study participants was in meeting basic needs, with the greatest percent increase in support to others (26%), along with huge decreases in reported alcohol use (20% less) and days using non-prescribed painkillers (53% fewer). Why wouldn’t we continue to build something that has generally been shown to work, study after study, time and time again? </li><li>This is ,cash for folks so they can put food on the table, get a roof over their heads, have a functioning vehicle to go to work, and decide how to meet their most basic, critical needs. It pains me to say this, but we live in a world where many people simply do not often experience open generosity, or regular income. When you show someone what it feels like to just not be hungry for a little while, their view of the world changes. They feel trusted. They see . </li></ul><div><div><blockquote><p>I moved here with my family. And I have no family up here other than who I brought with me. <strong>So, how most people can be like, “Hey, I’m having a hard time. Got $20 or a pack of diapers.” I have nobody up here to do that.</strong> So, if me and my husband don't figure it out, it don't get figured out.</p><p>So, I’ve got five kids that live with me... I was working full-time until I got pregnant. I prayed for this baby for 10 years. <strong>So, as soon as I got pregnant, I stopped working. I was high risk.</strong></p><p><strong>The day I got cleared to go back to work, my vehicle broke down.</strong> It was the only vehicle that we had that carried all the kids. So, I’ve been four months without my car. So this is also going to get my vehicle back on the road.</p><p>You don’t know how hard it is to ask people, hey, can I get a ride to the grocery store? Or, hey, my baby has two month shots. I had to borrow a vehicle. <strong>This is gonna... it’s going to do a lot!</strong></p></blockquote></div></div><ul><li>Unlike many other social programs, <strong>GMI studies require initiative</strong>. These are opt-in studies that you have to sign up for, demonstrate that you meet the income criteria and are a resident of the county — and because spots are limited, be randomly selected from eligible applicants. We emphasize that this is not passive, it is active  to improve the GMI program with your family, your community, and everyone else we can reach together over the next few decades.</li></ul><ul><li>The <a href=\"https://www.openresearchlab.org/studies/unconditional-cash-study/study\" rel=\"noreferrer\">massive OpenResearch UBI study</a>, the largest and most detailed guaranteed income study ever conducted in the USA, was designed to be a template for future, more refined studies, and that’s what we’re doing. We will also use what we learn in this group of three counties — as in software, <a href=\"https://blog.codinghorror.com/rule-of-three/\" rel=\"noreferrer\">the rule of three</a> — to <strong>iterate, adapt, and improve our GMI study playbook with every new group of three counties</strong>, generating a playbook anyone can use. </li><li>We strive to do repeatable, replicable  in every study, and <strong>all our data will be open and freely shared with the world</strong>. We’re contributing to — and partially funding — a global, open data repository for basic income pilots all around the world, <a href=\"https://ubidata.io/\" rel=\"noreferrer\">UBIdata</a>. It’s the same reason we made <a href=\"https://stackoverflow.com/\" rel=\"noreferrer\">Stack Overflow</a> content part of the creative commons, and <a href=\"https://www.discourse.org/\" rel=\"noreferrer\">Discourse</a> fully open source.</li><li>GMI is <strong>seed funding for families,</strong> investing in our fellow Americans, those who need it the most. A large body of research shows that dollars targeted to lower-income families are more likely to be spent quickly and reduce hardship, and can improve outcomes for children. “<strong>Trickle up” economics works,</strong> whereas \"trickle down\" tax cuts for the rich <a href=\"https://academic.oup.com/ser/article/20/2/539/6500315\" rel=\"noreferrer\">increase income inequality</a> and provide no significant effect on growth or jobs.</li><li>This is the newer <a href=\"https://ssir.org/articles/entry/trust-based-philanthropy-strategic\">trust based model of philanthropy</a>, much closer to venture capital funding. We primarily empower, fund, and build up  like GiveDirectly and OpenResearch, forming a collaborative team to leverage all their existing work and grow their organizations in whatever way they see fit, because they have the most experience in the GMI space. </li></ul><p>We focus on , where dollars go a lot further, poverty is more prevalent, and populations are smaller for tighter studies. Rural counties are also greatly overlooked in this country, in my opinion, yet they have so much incredible untapped talent. I know because that’s exactly where my parents and I are from.</p><p>We’ve funded three county level programs (Mercer, WV; Beaufort, NC; Warren, MS) that are already underway, where we will help lift thousands of people out of poverty for a period of 16 months, while sharing data and results with the world. That’s a good start.</p><p>But I think we can do  more. With your help, we hope to  over time. </p><p>In “Stay Gold,” I <a href=\"https://blog.codinghorror.com/stay-gold-america/#which-dream\" rel=\"noreferrer\">noted</a> that all of American history contains the path of love, and the path of hate. But the path of love is the only survivable path. It’s so much harder, and it’s going to be a lifetime of work. But what else could I possibly buy with our money that would be worth anything close to this, for all of us? </p><p><a href=\"https://rgmii.org/help-out/\" rel=\"noreferrer\">Everyone is invited to help</a>. Share <a href=\"https://rgmii.org/gmi-study-analysis/\" rel=\"noreferrer\">results</a>, learn the <a href=\"https://rgmii.org/history-of-gmi/\" rel=\"noreferrer\">history of GMI</a> (it’s actually fascinating, I swear), talk to your representatives and generally spread the word. A surprising number of people have never even heard the terms UBI or GMI, and sometimes have misconceptions about what they are and how they work.</p><p>If you, or someone you know, is “those to whom much is given,” and in a position to sponsor county-scale work, please join us in <a href=\"https://rgmii.org/become-a-donor/\" rel=\"noreferrer\">bringing a GMI study to a new rural county</a> and reach all 50 states. Let’s continue to do science and help lift thousands of people out of poverty while generating open data for the world.</p><p><strong>This is my third and final startup</strong>. Rather than an “Atwood Foundation,” all we want to do is advance the concept of direct cash transfer. Simply <em>giving money to those most in need </em>is perhaps the most radical act of love we can take on... and <a href=\"https://rgmii.org/gmi-study-analysis/\" rel=\"noreferrer\">all the data</a> I can find shows us that  — helping people afford basic needs, keep stable housing, and handle unexpected expenses.</p><p>Dreams, like happiness, are only real when shared. So let’s do that together.</p>","contentLength":8756,"flags":null,"enclosureUrl":"https://blog.codinghorror.com/content/images/2026/02/rgmii-metro-vs-rural-counties-usa-2026-1.png","enclosureMime":"","commentsUrl":null}],"tags":["dev"]}