{"id":"46aP2QbqUqBrWfYqAibo8xS24qkvbDNgWZUrxgZ6XNcyUn6fFxkgS1aSWJWwPwaqFp34erWr8NxVvd6jro8uiaPvDUjw","title":"top scoring links : kubernetes","displayTitle":"Reddit - Kubernetes","url":"https://www.reddit.com/r/kubernetes/top/.rss?sort=top&t=day&limit=6","feedLink":"https://www.reddit.com/r/kubernetes/top/?sort=top&t=day&limit=6","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":6,"items":[{"title":"Feeling Lost on My DevOps/Kubernetes Journey. What Should I Focus on Next?","url":"https://www.reddit.com/r/kubernetes/comments/1r5ty5i/feeling_lost_on_my_devopskubernetes_journey_what/","date":1771199263,"author":"/u/igottomakeit","guid":320,"unread":true,"content":"<p>Sorry in advance if this post is a bit long, but I really wanted to explain my situation clearly and get some honest advice.</p><p>I’m a fresh graduate currently looking for a job, and I’d really appreciate some guidance from more experienced people.</p><p>Even though my degree wasn’t purely computer science, I was always more drawn to CS-related topics. During university, I studied modules in Java, C, embedded systems, databases, HTML/CSS/JavaScript, etc. I also worked in different software development roles using C#, React, and other technologies. But I never really had the chance to deeply specialize in one area.</p><p>For my thesis, I intentionally chose Machine Learning because I’ve always loved the idea of extracting knowledge from data. While working on my thesis, I got introduced to Kubernetes for the first time, mainly through the MLOps/DevOps side of the project. That part felt extremely complex to me because I lacked strong Linux fundamentals, had limited Bash scripting experience, and basically zero knowledge of CI/CD pipelines.</p><p>After finishing my thesis, I decided that for the first time, I wanted to specialize seriously. I chose to focus on DevOps/Kubernetes.</p><p>I started building my own projects:</p><ul><li>Tried to build production-like use cases</li></ul><ul><li>I deployed a microservices app on Kubernetes with CI/CD using GitHub Actions</li><li>I implemented GitOps with ArgoCD</li><li>I configured monitoring with Prometheus and Grafana</li><li>I used Helm for packaging and deployments</li><li>I configured Nginx as a reverse proxy and worked with ingress concepts</li></ul><p>I also tried to use Terraform, Ansible, and AWS in one project to learn about them, but I decided to first properly finish a solid project with CI/CD, Kubernetes, ArgoCD, GitHub Actions, and networking/proxy configuration before going deeper into infrastructure provisioning.</p><p>Building these projects taught me a lot and made me more confident in job interviews. My long-term goal is to work as a DevOps/Platform engineer in a team managing production systems at scale, not just doing small projects.</p><p>But I still feel like I’m missing something. Even after a year of using Kubernetes, it still feels “new.” I can do the common tasks, but I often need to look up commands and concepts.</p><p>I realized I skipped some fundamentals:</p><ul><li>Pipes &amp; process management</li></ul><p>Sometimes I feel like I understand things when building projects, but not deeply enough to feel “solid.” I’m not sure if this is normal or a sign that I need to slow down and reinforce fundamentals.</p><ol><li>Am I doing the right thing by going back and focusing on Linux fundamentals?</li><li>Should I try to learn  tool? <ul><li>I’m comfortable with ArgoCD, should I also learn FluxCD?</li><li>I use GitHub Actions, should I also learn Jenkins and GitLab CI?</li></ul></li><li>What would be the most optimal next steps if my goal is to become a strong DevOps engineer?</li></ol><p>I genuinely want to master this field, and I’m fully ready to commit my time and focus to it. The problem isn’t motivation. it’s direction.</p><p>I sometimes feel unsure about how to structure my learning in a way that builds real depth, instead of just jumping from one tool to another without developing strong fundamentals.</p><p>I’d appreciate any advice from people who’ve been through this journey.</p>","contentLength":3196,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"kubeloom: a TUI for debugging Istio Ambient","url":"https://www.reddit.com/r/kubernetes/comments/1r5r8gg/kubeloom_a_tui_for_debugging_istio_ambient/","date":1771192386,"author":"/u/__4di__","guid":319,"unread":true,"content":"<p>I work with Istio Ambient and a fair share of other service meshes, applying them but also automating them. And in our team we used bang our heads trying to make sense of the flood of the logs from various components and making manifest modifications. So a while ago we came up with a toy tool to kinda quickly wrap our most frequent actions into a single pane of display and that eventually evolved into .</p><p>Its not perfect and has a few quirks, but I and the people using service mesh at my work find it quite useful and it's increased the speed in which we debug our policies. So, I just wanted to share it here in case any one else might find it useful!</p>","contentLength":654,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Has anyone gotten Cilium BGP Peer Autodiscovery to work correctly when native routing mode is enabled?","url":"https://www.reddit.com/r/kubernetes/comments/1r5q25f/has_anyone_gotten_cilium_bgp_peer_autodiscovery/","date":1771189598,"author":"/u/lacrosse1991","guid":318,"unread":true,"content":"<p>When I don't have native routing mode enabled, my kubernetes nodes are able to connect to my router using auto discovery without any issues. Once I enable native routing mode, the auto discovered peer IPs for BGP then somehow pick up a random pod cidr address and try using that instead. It's not the end of the world if I need to stop using auto discovery, although I would still like to get it working properly if possible. </p><p>I've included what I'm seeing for the BGP peers in a screenshot. </p>","contentLength":491,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"EKS Setup Help","url":"https://www.reddit.com/r/kubernetes/comments/1r5pa6j/eks_setup_help/","date":1771187761,"author":"/u/Specific-Swimming518","guid":317,"unread":true,"content":"<p>I'm designing an EKS cluster setup. I will have a monitoring stack (VictoriaMetrics, Grafana, Loki), databases, and maybe stateless microservices pods. For autoscaling and provisioning, I want to use Karpenter, and I want to ask you about this logic:</p><ol><li><strong>NodePool for stateless apps</strong> with spot instances and full consolidation capabilities.</li></ol><p>As a result, I can set up the CSI EBS DaemonSet with affinity to the <a href=\"http://karpenter.sh/stateful:\"></a> label and run CSI agents only on nodes that need it. This gives me optimization because I don't run them on stateless nodes. Stateful nodes are prevented from deletion by Karpenter because there will always be resources on them.</p><p>What do you think about such a setup?</p>","contentLength":669,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"What does “config hell” actually look like in the real world?","url":"https://www.reddit.com/r/kubernetes/comments/1r5euc1/what_does_config_hell_actually_look_like_in_the/","date":1771162680,"author":"/u/Real_Alternative_898","guid":322,"unread":true,"content":"<p>I've heard about \"Config Hell\" and have looked into different things like IAM sprawl and YAML drift, but it still feels a little abstract. I'm trying to understand what it looks like in practice.</p><p>I'm looking for war stories on when things blew up, why, what systems broke down, who was at fault.</p><p>Just looking for some examples to ground me. I'd take anything worth reading on it too.</p>","contentLength":381,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"CKA Exam Cancelled for “Talking Aloud”, Received Warnings but Wasn’t Speaking","url":"https://www.reddit.com/r/kubernetes/comments/1r58703/cka_exam_cancelled_for_talking_aloud_received/","date":1771139395,"author":"/u/Physical-Section-270","guid":321,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}],"tags":["dev","reddit","k8s"]}