{"id":"46aP2QbqUqBrWfYqAibo8xS24qkvbDNgWZV4Z6rf2nuJ3cBJ971pKb6XZkWhnDxr957c82fPU4Cg4j63MSkVSUXrPi55","title":"top scoring links : worldnews","displayTitle":"News - Reddit - World News","url":"https://www.reddit.com/r/worldnews/top/.rss?sort=top&t=day&limit=10","feedLink":"https://www.reddit.com/r/worldnews/top/?sort=top&t=day&limit=10","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":10,"items":[{"title":"Canadian passport holders can travel to China visa-free starting this week","url":"https://www.cbc.ca/news/politics/china-canada-visa-travel-9.7091435","date":1771181971,"author":"/u/Puginator","guid":356,"unread":true,"content":"<p>Canadian passport holders can travel to China visa-free starting Tuesday until the end of 2026, a spokesperson for China's Foreign Affairs Ministry announced Sunday — marking another step in Canada's thawing relationship with the Chinese government.</p><p>In a statement posted to the <a href=\"https://www.fmprc.gov.cn/mfa_eng/xw/fyrbt/202602/t20260215_11860467.html\" target=\"_blank\"><u>Chinese ministry's website</u></a>, the spokesperson said Canadian passport holders will be \"exempted from visa to enter China and stay for up to 30 days for business, tourism, family/friends visit, exchange and transit purposes.\"</p><p>\"The policy will be effective until December 31, 2026,\" the spokesperson said. The policy also applies to U.K. passport holders.</p><p>Foreign Affairs Minister Anita Anand <a href=\"https://x.com/AnitaAnandMP/status/2023090769095991543\">confirmed the policy on social media</a> and said the change is making \"travel easier, supporting business exchanges, and strengthening people-to-people ties between our countries.\"</p><p>The idea of Canadian visa-free travel to China was first mentioned in January after Prime Minister Mark Carney visited Beijing and met President Xi Jinping.</p><div><em><strong>WATCH | PM Mark Carney meets Chinese President Xi Jinping in Beijing:</strong></em></div><p>A <a href=\"https://www.pm.gc.ca/en/news/news-releases/2026/01/16/prime-minister-carney-forges-new-strategic-partnership-peoples\" target=\"_blank\"><u>statement from Carney's office</u></a> at the time mentioned that the prime minister \"welcomed [the president's] commitment to introducing visa-free access for Canadians travelling to China.\"</p><p>For most Canadian tourists, entering China currently requires a lengthy application process and roughly $140 in fees. China has dropped visa requirements for other Western nations in recent years as it tries to boost tourism following the COVID-19 pandemic.</p><p>Beijing maintained a visa for Canadians and restricted how many Chinese tourism groups could visit Canada during a years-long diplomatic spat.</p>","contentLength":1653,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1r5mswg/canadian_passport_holders_can_travel_to_china/"},{"title":"China has planted so many trees around the Taklamakan Desert that it's turned this 'biological void' into a carbon sink","url":"https://www.livescience.com/planet-earth/plants/china-has-planted-so-many-trees-around-the-taklamakan-desert-that-its-turned-this-biological-void-into-a-carbon-sink","date":1771175973,"author":"/u/liomenu","guid":360,"unread":true,"content":"<p>Mass tree planting in <a data-analytics-id=\"inline-link\" href=\"https://www.livescience.com/tag/china\" data-auto-tag-linker=\"true\" data-url=\"https://www.livescience.com/tag/china\" data-hl-processed=\"none\" data-mrf-recirculation=\"inline-link\" data-before-rewrite-localise=\"https://www.livescience.com/tag/china\">China</a> is turning one of the world's largest and driest deserts into a carbon sink, meaning it absorbs more carbon from the atmosphere than it emits, new research reveals.</p><p>The Taklamakan Desert (also spelled Taklimakan or Takla Makan) is slightly larger than Montana, stretching across about 130,000 square miles (337,000 square kilometers). It is encircled by high mountains, which block moist air from reaching the desert for most of the year, creating extremely arid conditions that are too harsh for most <a data-analytics-id=\"inline-link\" href=\"https://www.livescience.com/planet-earth/plants/plants-facts-about-our-oxygen-providers\" data-url=\"https://www.livescience.com/planet-earth/plants/plants-facts-about-our-oxygen-providers\" data-hl-processed=\"none\" data-mrf-recirculation=\"inline-link\" data-before-rewrite-localise=\"https://www.livescience.com/planet-earth/plants/plants-facts-about-our-oxygen-providers\"></a>.</p><p>\"We found, for the first time, that human-led intervention can effectively enhance carbon sequestration in even the most extreme arid landscapes, demonstrating the potential to transform a desert into a carbon sink and halt desertification,\" study co-author <a data-analytics-id=\"inline-link\" href=\"https://www.gps.caltech.edu/people/yuk-l-yung\" target=\"_blank\" data-url=\"https://www.gps.caltech.edu/people/yuk-l-yung\" referrerpolicy=\"no-referrer-when-downgrade\" data-hl-processed=\"none\" data-mrf-recirculation=\"inline-link\"></a>, a professor of planetary science at Caltech and a senior research scientist in <a data-analytics-id=\"inline-link\" href=\"https://www.livescience.com/tag/nasa\" data-auto-tag-linker=\"true\" data-url=\"https://www.livescience.com/tag/nasa\" data-hl-processed=\"none\" data-mrf-recirculation=\"inline-link\" data-before-rewrite-localise=\"https://www.livescience.com/tag/nasa\">NASA</a>'s Jet Propulsion Laboratory, told Live Science in an email.</p><p>Over 95% of the Taklamakan Desert is covered in shifting sand, meaning it has long been considered a \"biological void,\" according to the study. The desert has been growing since the 1950s, when China underwent massive urbanization and farmland expansion. This conversion of natural land created the conditions for more sandstorms, which, in general, blow away soil and deposit sand instead, causing land degradation and desertification.</p><p>In 1978, China implemented the Three-North Shelterbelt Program, a huge ecological engineering project intended to slow desertification. Also called the \"Great Green Wall,\" the project aimed to plant billions of trees around the margins of the Taklamakan and Gobi deserts by 2050. More than 66 billion trees have been planted in northern China to date, but experts <a data-analytics-id=\"inline-link\" href=\"https://doi.org/10.1016/j.jaridenv.2009.08.001\" target=\"_blank\" data-url=\"https://doi.org/10.1016/j.jaridenv.2009.08.001\" referrerpolicy=\"no-referrer-when-downgrade\" data-hl-processed=\"none\" data-mrf-recirculation=\"inline-link\"></a> whether the Great Green Wall has significantly reduced the frequency of sandstorms.</p><p>China finished encircling the Taklamakan Desert with vegetation in 2024, and researchers say the effort has stabilized sand dunes and <a data-analytics-id=\"inline-link\" href=\"https://www.reuters.com/world/china/china-completes-3000-km-green-belt-around-its-biggest-desert-state-media-says-2024-11-29/\" target=\"_blank\" data-url=\"https://www.reuters.com/world/china/china-completes-3000-km-green-belt-around-its-biggest-desert-state-media-says-2024-11-29/\" referrerpolicy=\"no-referrer-when-downgrade\" data-hl-processed=\"none\" data-mrf-recirculation=\"inline-link\"><u>grown forest cover in the country</u></a> from 10% of its area in 1949 to more than 25% today.</p><figure data-bordeaux-image-check=\"\"><figcaption itemprop=\"caption description\"></figcaption></figure><p>Now, scientists have found that sprawling vegetation in the Taklamakan Desert's periphery is absorbing more carbon dioxide (CO) from the atmosphere than the desert is releasing, meaning the Taklamakan may be transforming into a stable carbon sink.</p><p>The researchers analyzed ground observations of different vegetation-cover types, as well as satellite data showing precipitation, vegetation cover, <a data-analytics-id=\"inline-link\" href=\"https://www.livescience.com/51720-photosynthesis.html\" data-url=\"https://www.livescience.com/51720-photosynthesis.html\" data-hl-processed=\"none\" data-mrf-recirculation=\"inline-link\" data-before-rewrite-localise=\"https://www.livescience.com/51720-photosynthesis.html\"></a> and CO fluxes in the Taklamakan Desert over the past 25 years. They also used the National Oceanic and Atmospheric Administration's <a data-analytics-id=\"inline-link\" href=\"https://gml.noaa.gov/ccgg/carbontracker/\" target=\"_blank\" data-url=\"https://gml.noaa.gov/ccgg/carbontracker/\" referrerpolicy=\"no-referrer-when-downgrade\" data-hl-processed=\"none\" data-mrf-recirculation=\"inline-link\"></a>, which models CO sources and sinks globally, to bolster their findings.</p><p>The results, published Jan. 19 in the journal <a data-analytics-id=\"inline-link\" href=\"https://doi.org/10.1073/pnas.2523388123\" target=\"_blank\" data-url=\"https://doi.org/10.1073/pnas.2523388123\" referrerpolicy=\"no-referrer-when-downgrade\" data-hl-processed=\"none\" data-mrf-recirculation=\"inline-link\"></a>, show a long-term trend of expanding vegetation and rising CO uptake along the desert's edges that coincides both in time and space with the Great Green Wall.</p><figure data-bordeaux-image-check=\"\"><figcaption itemprop=\"caption description\"></figcaption></figure><p>Over the study period, precipitation during the Taklamakan Desert's wet season from July to September was 2.5 times higher than it was in the dry season, averaging about 0.6 inches (16 millimeters) per month. Precipitation enhanced vegetation cover, greenness and photosynthesis along the desert's margins, thereby lowering CO levels over the desert from 416 parts per million in the dry season to 413 ppm in the wet season.</p><p>Previous <a data-analytics-id=\"inline-link\" href=\"https://doi.org/10.1016/j.jenvman.2023.118416\" target=\"_blank\" data-url=\"https://doi.org/10.1016/j.jenvman.2023.118416\" referrerpolicy=\"no-referrer-when-downgrade\" data-hl-processed=\"none\" data-mrf-recirculation=\"inline-link\"></a><a data-analytics-id=\"inline-link\" href=\"https://doi.org/10.1016/j.scib.2019.12.022\" target=\"_blank\" data-url=\"https://doi.org/10.1016/j.scib.2019.12.022\" referrerpolicy=\"no-referrer-when-downgrade\" data-hl-processed=\"none\" data-mrf-recirculation=\"inline-link\"></a> that the Taklamakan Desert may be a carbon sink, but those studies focused on CO that is absorbed by the desert's sand. They also suggested that sand is not a stable carbon sink under <a data-analytics-id=\"inline-link\" href=\"https://www.livescience.com/planet-earth/climate-change/climate-change-facts-about-our-warming-planet\" data-url=\"https://www.livescience.com/planet-earth/climate-change/climate-change-facts-about-our-warming-planet\" data-hl-processed=\"none\" data-mrf-recirculation=\"inline-link\" data-before-rewrite-localise=\"https://www.livescience.com/planet-earth/climate-change/climate-change-facts-about-our-warming-planet\"></a>, because rising temperatures can cause air in the sand to expand, which releases extra CO.</p><p>\"Based on the results of this study, the Taklamakan Desert, although only around its rim, represents the first successful model demonstrating the possibility of transforming a desert into a carbon sink,\" Yung said.</p><p>The Great Green Wall's potential to slow desertification remains unclear, but its role as a carbon sink \"may serve as a valuable model for other desert regions,\" he added.</p><div><div><p>Noor, S., Jiang, X., Wang, X., Yang, J., Newman, S., Li, K., Li, L., Yu, L., Li, X., &amp; Yung, Y. L. (2026). Human-induced biospheric carbon sink: Impact from the Taklamakan Afforestation Project. <em>Proceedings of the National Academy of Sciences</em>, (4), e2523388123. <a href=\"https://doi.org/10.1073/pnas.2523388123\" target=\"_blank\" data-url=\"https://doi.org/10.1073/pnas.2523388123\" referrerpolicy=\"no-referrer-when-downgrade\" data-hl-processed=\"none\"><u>https://doi.org/10.1073/pnas.2523388123</u></a></p></div></div>","contentLength":4238,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1r5k7rv/china_has_planted_so_many_trees_around_the/"},{"title":"CIA, Pentagon reviewed secret 'Havana syndrome' device in Norway, Washington Post reports","url":"https://www.reuters.com/business/healthcare-pharmaceuticals/cia-pentagon-reviewed-secret-havana-syndrome-device-norway-washington-post-2026-02-14/","date":1771162078,"author":"/u/Street_Anon","guid":358,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1r5emki/cia_pentagon_reviewed_secret_havana_syndrome/"},{"title":"France: Navalny poisoning shows Putin ready to use nerve agents on own people","url":"https://www.reuters.com/world/france-navalny-poisoning-shows-putin-ready-use-nerve-agents-own-people-2026-02-14/","date":1771125875,"author":"/u/Raj_Valiant3011","guid":353,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1r545b4/france_navalny_poisoning_shows_putin_ready_to_use/"},{"title":"Macron urges calm after far-right activist fatally beaten","url":"https://www.lemonde.fr/en/france/article/2026/02/15/macron-urges-calm-after-far-right-activist-fatally-beaten_6750495_7.html","date":1771125609,"author":"/u/EquipmentSubject6801","guid":357,"unread":true,"content":"<p>French President Emmanuel Macron on Saturday, February 14, urged calm and restraint after the fatal beating of a 23-year-old French youth aligned with the far-right on the sidelines of a conference by a hard-left lawmaker in the southeastern city of Lyon. The death of the young man – identified only as Quentin – has intensified tensions between France's far-right and radical left.</p><p>He had been hospitalized in Lyon on Thursday after being attacked while providing what his supporters said was security for a protest against an appearance by hard-left MEP Rima Hassan at the Sciences Po Lyon university. The office of the Lyon prosecutor on Saturday told Agence France-Presse he had died of his wounds. An investigation has been opened into suspected aggravated manslaughter, it added.</p><p>Macron said on X that Quentin had been the victim of \"an unprecedented outburst of violence.\" \"Hatred that kills has no place in our country. I call for calm, restraint and respect,\" he added.</p><h2>'Organized and trained individuals'</h2><p>According to the Némésis collective, which is close to the far right, Quentin was part of the security team responsible for ensuring the safety of its activists. They were demonstrating against the conference by Hassan, who is known for her outspoken criticism of Israel.</p><p>The family's lawyer said in a statement that Quentin appeared to have been ambushed by \"organized and trained individuals, vastly superior in number and armed, some with their faces masked.\" Prosecutors have yet to give details on the circumstances of his death. Némésis accused members of a local anti-fascist association that was banned by the government in June of being behind the killing.</p><p>Three-time presidential candidate Marine Le Pen, who is still hoping to stand in 2027 despite a graft conviction, said on X that the \"barbarians responsible for this lynching\" should be brought to justice.</p><p>With Quentin's death sparking a wave of alarm across the political spectrum, concern also spread to the hard-left party of Hassan, La France Insoumise (LFI). \"What I have feared for years in Lyon is continuing,\" said LFI French parliament MP Raphaël Arnault. \"I offer my condolences to the family of this young man and I hope that the truth will be uncovered about this tragedy,\" he added.</p><p>In the wake of the incident, Interior Minister Laurent Nuñez urged authorities to \"increase vigilance around political gatherings, as well as around campaign offices.\"</p>","contentLength":2447,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1r54282/macron_urges_calm_after_farright_activist_fatally/"},{"title":"Air India flight 171 crash: Pilot deliberately cut fuel switch, report reveals","url":"https://www.khaleejtimes.com/world/asia/air-india-flight-171-crash-pilot-deliberately-cut-fuel-switch-report-says","date":1771124726,"author":"/u/UnderstandingBig949","guid":361,"unread":true,"content":"<p>Investigators probing last year's crash of <a href=\"https://www.khaleejtimes.com/business/aviation/air-india-plane-crash-casualties\">Air India flight 171</a> from Ahmedabad have concluded that the disaster that killed 260 people happened not because of a technical defect, but was an “intentional act” by the pilot in command.</p><p>The report, published on Thursday in the Italian daily Corriere della Sera, said Capt Sumeet Sabharwal, the pilot-in-command, allegedly turned off the fuel switches – that is “almost certainly” an intentional act. The paper cited Western aviation agency sources. </p><p>The Indian civil aviation ministry and the Aircraft Accident Investigation Bureau (AAIB), however, have yet to respond to media requests for comments on the claims.</p><p>The Boeing 787 Dreamliner crashed on <a href=\"https://www.khaleejtimes.com/world/asia/ahmedabad-airport-plane-crash-india\">June 12, 2025</a>, shortly after takeoff from the Ahmedabad airport, killing 260 people, including 241 of the 242 on board the aircraft and 19 on the ground. The aircraft crashed into a medical student hostel.</p><p>The preliminary report of the AAIB mentioned that one pilot asked the other in the cockpit why he had cut off the fuel. “I did not do so,” was the response from the other pilot. The paper said that Capt Sabharwal, the main suspect, had been suffering from depression a month before the disaster. </p><p>The Italian publication said Indian investigators have agreed with American experts that the crash did not happen due to mechanical failure, but was a deliberate action.</p><p>When similar reports leaked a few months ago, citing the AAIB’s preliminary findings that blamed one of the pilots, there were protests from pilots’ associations in India. Sabharwal’s father also rejected the charges about his son’s mental health and demanded a fresh probe.</p><div><img src=\"https://fea.assettype.com/khaleejtimes/static/assets/fallbackPlaceholder-CoqrVPcw.jpg\" alt=\"\" loading=\"lazy\" height=\"4788\" width=\"7181\"></div><p>Reports have also cited a preliminary technical assessment based on black box data, which ruled out mechanical failure and referred to manual movement of switches relating to engine ignition and shutdown. Both engines were found to have been switched off at the time of the crash.</p><p>The Italian paper cited anonymous sources as saying the conclusion will undergo a political evaluation, and a more cautious version would be adapted to avoid controversies.</p><p>Meanwhile, another news report claimed that Air India has offered cash settlements to families of the victims of the crash on condition that they do not initiate legal action against the airline and the aircraft manufacturer. </p>","contentLength":2340,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1r53rm5/air_india_flight_171_crash_pilot_deliberately_cut/"},{"title":"Ukraine destroys half of Russia's 'key' Pantsir air defense systems, security service says","url":"https://kyivindependent.com/ukraine-destroys-half-of-russias-key-pantsir-air-defense-systems-security-service-says/","date":1771123006,"author":"/u/eaglemaxie","guid":359,"unread":true,"content":"<p>The Alpha unit of Ukraine's Security Service (SBU) destroyed half of Russia's stockpile of the coveted Pantsir air defense system, the SBU announced Feb. 14.</p><p>\"The <a href=\"https://kyivindependent.com/tag/pantsir-s1/\">'Pantsir'</a> is one of Russia's modern and key air defense systems. The cost of a single system ranges from $15 to $20 million. These anti-aircraft missile systems are the most effective in countering Ukrainian long-range <a href=\"https://kyivindependent.com/tag/drones/\">drones</a>,\" the announcement <a href=\"https://t.me/SBUkr/16804\" target=\"_blank\" rel=\"noopener noreferrer\">read</a>.</p><p>The \"systemic destruction\" of the <a href=\"https://kyivindependent.com/tag/air-defense/\">air defense</a> system has the \"strategic goal\" of making <a href=\"https://kyivindependent.com/tag/russia/\">Russia</a> vulnerable to long-range strikes as Moscow continues to wage its war, the SBU said.</p><p>A diminished arsenal allows the Armed Forces to effectively strike Russian \"military bases, warehouses, airfields, and other occupied facilities.\"</p><p>Ukraine regularly strikes military infrastructure deep within Russia and its own occupied territories in an effort to diminish Moscow's fighting power.</p><p>The SBU claimed on Jan. 19 that its <a href=\"https://kyivindependent.com/ukraines-sbu-claims-to-have-destroyed-4-billion-worth-of-russian-air-defense-systems-over-past-year/\">long-range strikes</a> during the year of 2025 either \"destroyed or disabled\" Russian air defense systems worth a total of approximately $4 billion.</p><p>On Feb. 12, Ukraine struck a Russian 55Zh6U \"Nebo-U\" <a href=\"https://kyivindependent.com/ukraine-says-it-struck-100-million-russian-nebo-u-radar-system-in-occupied-crimea/\">long-range radar station</a>, estimated to be worth approximately $100 million, near Yevpatoriia in occupied Crimea, the General Staff of Ukraine’s Armed Forces later <a href=\"https://t.me/GeneralStaffZSU/34976\" rel=\"noopener noreferrer\" target=\"_blank\">reported</a> on Feb. 13.</p><p>Meanwhile, the 1st Separate Center of the <a href=\"https://kyivindependent.com/ukraines-unmanned-systems-forces-release-footage-of-strikes-on-russian-airfield-in-crimea-other-targets-in-occupied-territories/\">Unmanned Systems Forces</a> (USF) on Feb. 12 struck an airfield in the village of Hvardiiske in Crimea, the Kirova electrical substation in Luhansk, and a data center in Prymorsk, Zaporizhzhia Oblast.</p><p>Ukrainian long-range cruise <a href=\"https://kyivindependent.com/tambov-draft/\">\"Flamingo\" missiles</a> struck a major Russian arsenal storing missiles, ammunition, and explosives in Kotluban, Volgograd Oblast, overnight, Ukraine's General Staff reported on Feb. 12.</p><p>The facility belongs to Russia's Main <a href=\"https://t.me/GeneralStaffZSU/34951\" rel=\"noopener noreferrer\" target=\"_blank\">Missile and Artillery Directorate</a> (GRAU) and is described as one of the largest ammunition storage sites used by the Russian army. Powerful explosions and secondary detonations were recorded at the site.</p><p>In addition to the strike on the arsenal, Ukrainian forces on Feb. 12 hit the Progress Plant in Michurinsk, Tambov Oblast. The enterprise produces high-tech equipment for aviation and missile systems and is involved in supporting Russia’s military.</p>","contentLength":2244,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1r5373s/ukraine_destroys_half_of_russias_key_pantsir_air/"},{"title":"Zelenskyy blasts Orbán: Grows his belly instead of his army","url":"https://newsukraine.rbc.ua/news/zelenskyy-blasts-orb-n-grows-his-belly-instead-1771073043.html","date":1771121067,"author":"/u/jackytheblade","guid":355,"unread":true,"content":"<p data-end=\"226\" data-start=\"117\">\"Mr. Ischinger said in an interview before this conference that as long as Ukraine is defending Europe, the danger is not so great. If we speak plainly and a bit cynically, that is more or less the situation today. But look at the price,\" Zelenskyy said.</p><p data-end=\"697\" data-start=\"618\">The president stressed that Ukrainians are the ones holding the European front.</p><p data-end=\"976\" data-start=\"699\">\"Behind our people stand an independent Poland and the free Baltic states. There can be a sovereign Moldova. And Romania without dictatorship. And even one Viktor can think of how to grow his belly and not how to grow his army to stop Russian tanks from returning to the streets of Budapest,\" he added.</p><p data-end=\"1333\" data-start=\"1238\">The statement came amid Orbán’s repeated blocking of Ukraine’s EU accession and EU aid to Kyiv.</p>","contentLength":735,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1r52j9r/zelenskyy_blasts_orb%C3%A1n_grows_his_belly_instead_of/"},{"title":"More than 60 children infected in north London measles outbreak","url":"https://www.theguardian.com/society/2026/feb/14/more-than-60-children-infected-in-north-london-measles-outbreak?CMP=Share_AndroidApp_Other","date":1771119173,"author":"/u/tahiirhussain","guid":352,"unread":true,"content":"<p>More than 60 children have been infected by a measles outbreak in north <a href=\"https://www.theguardian.com/uk/london\" data-link-name=\"in body link\" data-component=\"auto-linked-tag\">London</a>, it has been reported.</p><p>Seven schools and a nursery in Enfield reported the cases, with some children treated in hospital, according to the Sunday Times.</p><p>There are concerns the outbreak is linked to low levels of <a href=\"https://www.theguardian.com/society/mmr\" data-link-name=\"in body link\" data-component=\"auto-linked-tag\">MMR</a> vaccination in the capital. For every one infected person, measles can spread to up to 18 unvaccinated people.</p><p>Dudu Sher-Arami, Enfield’s director of public health who is writing to every parent in the area, said the outbreak posed a serious threat to the wider capital and there was the potential to cause a “much greater and bigger pan-London outbreak” because residents travel across the city.</p><p>She told the Sunday Times London has “one of the lowest, if not the lowest, vaccination uptake rates” in the country.</p><p>Sher-Arami said: “It is possible for it to grow. We know that measles has got some very nasty complications. It can cause deafness. It can cause brain damage and one in five children can need hospital treatment.”</p><p>Temporary vaccination clinics are being held in schools and throughout Enfield, an area in which more than a fifth of children are not inoculated against measles, mumps or rubella by the age of five.</p><p>A government campaign promoting childhood vaccination is expected to be launched next week with adverts on social media, YouTube and radio to counter vaccine scepticism. Measles usually starts with cold-like symptoms followed by a rash a few days later, according to the NHS. Some people may also get small spots in their mouths.</p><p>It comes after a plateau in vaccination coverage and a surge in cases, with 3,681 cases recorded in the UK in 2024.</p><p>From 2021 to 2023, the UK was considered to have “eliminated” the disease.</p><p>WHO recommends at least 95% of children should receive vaccine doses for each illness to achieve herd immunity.</p><p>According to UK <a href=\"https://www.theguardian.com/society/health\" data-link-name=\"in body link\" data-component=\"auto-linked-tag\">Health</a> Security Agency figures 91.9% of five-year-olds had received one dose of the MMR (measles, mumps and rubella) vaccine in 2024-25, unchanged from 2023-24 and the lowest level since 2010-11.</p><p>The data also showed 83.7% of five-year-olds had received both MMR doses, the lowest level since 2009-10.</p>","contentLength":2179,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1r51wfk/more_than_60_children_infected_in_north_london/"},{"title":"Hungarian opposition leader says sex-tape is ‘Russian-style’ smear operation","url":"https://tvpworld.com/91558279/pter-magyar-denies-wrongdoing-ahead-of-blackmail-video","date":1771118839,"author":"/u/thhvancouver","guid":354,"unread":true,"content":"<!DOCTYPE html>","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1r51sb7/hungarian_opposition_leader_says_sextape_is/"}],"tags":["news","reddit"]}