{"id":"4PaGeZyGUC","title":"Youtube","displayTitle":"Youtube","url":"","feedLink":"","isQuery":true,"isEmpty":false,"isHidden":false,"itemCount":50,"items":[{"title":"Who Really Built The Sphinx?","url":"https://www.youtube.com/watch?v=Dlb44MZamw0","date":1771192817,"author":"Timeline - World History Documentaries","guid":499,"unread":true,"content":"<article>This documentary explores the controversial archaeological evidence challenging the historical accuracy of the Bible. From the \"riddle of the Sphinx\" - where geologists argue for a date 4,000 years earlier than traditional Egyptology - to the search for King Solomon’s lost palaces at Armageddon, we examine the artifacts, carbon dating, and ancient tunnels that are rewriting world history. Discover the scientific truth behind the legends of Jerusalem and the monumental mysteries of the ancient Middle East.\n\nYou can now become a History Hit member right here on YouTube! Join for access to a new exclusive documentary every week, and access to over 160+ of our documentaries presented by world renowned historians like Dan Snow, Eleanor Janega, Tristan Hughes, Mary Beard, Matt Lewis and more.\nGet an exclusive release every week by signing up here: https://bit.ly/4pyExyn\n\nThis channel is part of the History Hit Network. Any queries, please contact owned-enquiries@littledotstudios.com</article>","contentLength":993,"flags":null,"enclosureUrl":"https://www.youtube.com/v/Dlb44MZamw0?version=3","enclosureMime":"","commentsUrl":null},{"title":"The Remarkable Science of Sound | Sound Waves: The Symphony of Physics | BBC Earth Science","url":"https://www.youtube.com/watch?v=Zp_uXZ4hy3Y","date":1771178437,"author":"BBC Earth Science","guid":694,"unread":true,"content":"<article>Join Dr Helen Czerski as she investigates the remarkable science behind sound, with various experiments and an incredibly touching story from a woman who battled hearing loss.\n\nBest of Earth Science: http://bit.ly/EarthLabOriginals \nBest of BBC Earth: http://bit.ly/TheBestOfBBCEarthVideos \n\nTaken from: Sound Waves: The Symphony of Physics (2017)\n\nThis is a channel from BBC Studios who help fund new BBC programmes. Service information and feedback: http://bbcworldwide.com/vod-feedback--contact-details.aspx</article>","contentLength":510,"flags":null,"enclosureUrl":"https://www.youtube.com/v/Zp_uXZ4hy3Y?version=3","enclosureMime":"","commentsUrl":null},{"title":"The Kiel Canal: The busiest artificial waterway in the world | DW Documentary","url":"https://www.youtube.com/watch?v=gas9GGMw2N0","date":1771174853,"author":"DW Documentary","guid":16,"unread":true,"content":"<article>A technical masterpiece -- and a big responsibility. The Kiel Canal in Germany is the busiest artificial waterway in the world. But keeping it operational is expensive.\n\nThe infrastructure of the Kiel Canal is a much-discussed topic. As is the case in Germany with roads, bridges and railway tracks, cost-cutting measures are also impacting waterways. \n\nYet the canal offers decisive advantages for freight transport: every shipping container transported here replaces a long lorry journey. This saves fuel and improves the freight’s carbon footprint.\n\nEvery year, 25,000 to 30,000 ships pass through the artificial waterway that runs between the port cities of Kiel and Brunsbüttel, connecting the Baltic Sea with the North Sea. But the Kiel Canal, which opened in 1895 and is almost 100 kilometers long, requires constant monitoring and maintenance.\n\nIn the summer of 2024, one of the large lock chambers in Brunsbüttel had to be shut down for several months, and the canal was widened. Up to 30,000 cubic meters of soil were removed here every day to meet the increased demands of shipping traffic. \n\nTwo young boat builders, both named Paul, have little inkling of these challenges. They bought an old sailing boat and made it seaworthy again. The canal and its locks are the first big adventure of their journey, which will take them to the Canary Islands.\n\nThe impressive ships that sail the Kiel Canal have attracted their own fan base. Ship spotters regularly gather on the banks of the canal to watch the majestic cargo ships. \nParking attendant Rainer Schmidt is in charge of maintenance for the Rendsburg viewing point. One of his most important tasks is to keep the hedges trimmed, to ensure the view of the canal is not obstructed.\n\nThe report highlights the different facets of the Kiel Canal and shows how closely people are connected to this waterway. It accompanies them in their everyday lives and during special challenges, against the impressive backdrop of an ageing, but fascinating, technical monument.\n\n#documentary #dwdocumentary #dwdocs #germany #kiel \n______\n\nDW Documentary gives you knowledge beyond the headlines. Watch top documentaries from German broadcasters and international production companies. Meet intriguing people, travel to distant lands, get a look behind the complexities of daily life and build a deeper understanding of current affairs and global events. Subscribe and explore the world around you with DW Documentary.\n\nSubscribe to: ‬\n⮞ DW Documentary (English): https://www.youtube.com/@DWDocumentary \n⮞ DW Documental (Spanish): https://www.youtube.com/@DWDocumental \n⮞ DW Documentary وثائقية دي دبليو (Arabic): https://www.youtube.com/@dwdocarabia\n⮞ DW Documentary हिन्दी (Hindi): https://www.youtube.com/@dwdochindi\n⮞ DW Dokumenter (Indonesian): https://www.youtube.com/@DWDokumenter\n⮞ DW Doku (German): https://www.youtube.com/@dwdoku\n\nFor more visit: http://www.dw.com/en/tv/docfilm/s-3610\nFollow DW Documentary on Instagram: https://www.instagram.com/dwdocumentary/\nFollow DW Documental on Facebook: https://www.facebook.com/dwdocumental\n\nWe kindly ask viewers to read and stick to the DW netiquette policy on our channel: https://p.dw.com/p/MF1G</article>","contentLength":3244,"flags":null,"enclosureUrl":"https://www.youtube.com/v/gas9GGMw2N0?version=3","enclosureMime":"","commentsUrl":null},{"title":"The Man Who Survived Both Atomic Bombs","url":"https://www.youtube.com/watch?v=H3itdQ5Nrt0","date":1771167632,"author":"Weird History","guid":704,"unread":true,"content":"<article>Become a Member of Weird History! https://www.youtube.com/channel/UCc-N24Y5OA0gqbjBwe1ttfA/join\n\nWar is hell. And World War Two was inarguably one of the worst wars in history.  But what if you were at the epicenter of that trauma in a way that allowed you to witness not one… but two atomic bomb detonations… and survive? This is one incredible story of endurance!\n\nTo read more about the man who survived two atomic bomb blasts, go here:\nhttps://www.ranker.com/list/japan-atomic-bomb-survivor-accounts/philgibbons\n\nBe sure to subscribe to the Weird History Newsletter: https://bit.ly/WeirdHistoryNews\n\n#abomb #survival #weirdhistory</article>","contentLength":638,"flags":null,"enclosureUrl":"https://www.youtube.com/v/H3itdQ5Nrt0?version=3","enclosureMime":"","commentsUrl":null},{"title":"Dying with dignity | DW Documentary","url":"https://www.youtube.com/shorts/yIMcufEB1Rk","date":1771164090,"author":"DW Documentary","guid":15,"unread":true,"content":"<article>In hospices, caregivers and volunteers support patients who are seriously ill and dying. They focus on quality of life and dignity in those final stages, providing a peaceful environment where people can face their last days with grace and as little fear as possible. \n\nWhat are the stories behind hospices? \n\n#documentary #dwdocumentary #dwdocs\n______\n\nWe kindly ask viewers to read and stick to the DW netiquette policy on our channel: https://p.dw.com/p/MF1G</article>","contentLength":461,"flags":null,"enclosureUrl":"https://www.youtube.com/v/yIMcufEB1Rk?version=3","enclosureMime":"","commentsUrl":null},{"title":"\"I HATE GAMES as Programming Examples\" –@russolsen3122","url":"https://www.youtube.com/shorts/n-FSgfkqldA","date":1771160490,"author":"GOTO Conferences","guid":166,"unread":true,"content":"<article>Check out the full version on our YouTube channel now! #GOTOcon #RussOlsen #Clojure #lisplang #Agile #TDD #ChaosEngineering #FunctionalProgramming #CategoryTheory #FPvsOOP #Programming #SoftwareEngineering #TodayInTech #ViralProgrammingShorts #Viral #ViralShorts #TodayInTech #GOTO\n\nFull version available here:\nhttps://youtu.be/0SpsIgtOCbA\n\nRuss Olsen - Author of \"Getting Clojure\" &amp; \"Eloquent Ruby\" @russolsen3122 \n\nRECOMMENDED BOOKS\nRuss Olsen • Getting Clojure • https://amzn.to/3J8zI8s\nRuss Olsen • Eloquent Ruby • https://amzn.to/37gOhcG\nRuss Olsen • Design Patterns in Ruby • https://amzn.to/3r2uBjW\n\nCHANNEL MEMBERSHIP BONUS\nJoin this channel to get early access to videos &amp; other perks:\nhttps://www.youtube.com/channel/UCs_tLP3AiwYKwdUHpltJPuA/join\n\nLooking for a unique learning experience?\nAttend the next GOTO conference near you! Get your ticket at https://gotopia.tech\nSign up for updates and specials at https://gotopia.tech/newsletter\n\nSUBSCRIBE TO OUR CHANNEL - new videos posted almost daily.\nhttps://www.youtube.com/user/GotoConferences/?sub_confirmation=1</article>","contentLength":1087,"flags":null,"enclosureUrl":"https://www.youtube.com/v/n-FSgfkqldA?version=3","enclosureMime":"","commentsUrl":null},{"title":"Ajay Banga on India, Migration and a Youth Jobs Time Bomb | Leaders with Francine Lacqua","url":"https://www.youtube.com/watch?v=IqBXFwg3fk4","date":1771146031,"author":"Bloomberg Originals","guid":30,"unread":true,"content":"<article>Francine Lacqua sits down with Ajay Banga to discuss his journey to becoming president of the World Bank Group. From his childhood in India to a career in the private sector and eventually leading one of the world’s most influential institutions, Banga shares his leadership principles and discusses how emerging markets face a historic youth jobs gap that risks social unrest and increased migration.\n\n--------\nLike this video? Subscribe: http://www.youtube.com/Bloomberg?sub_confirmation=1\n\nGet unlimited access to Bloomberg.com for just $1.99 your first month: https://www.bloomberg.com/subscriptions?in_source=YoutubeOriginals\nBloomberg Originals offers bold takes for curious minds on today’s biggest topics. Hosted by experts covering stories you haven’t seen and viewpoints you haven’t heard, you’ll discover cinematic, data-led shows that investigate the intersection of business and culture. Exploring every angle of climate change, technology, finance, sports and beyond, Bloomberg Originals is business as you’ve never seen it. \n\nSubscribe for business news, but not as you've known it: exclusive interviews, fascinating profiles, data-driven analysis, and the latest in tech innovation from around the world.\n\nVisit our partner channel Bloomberg News for global news and insight in an instant.</article>","contentLength":1317,"flags":null,"enclosureUrl":"https://www.youtube.com/v/IqBXFwg3fk4?version=3","enclosureMime":"","commentsUrl":null},{"title":"Christian Martyrs: 2,000 Years Of Faith, Persecution And Sacrifice","url":"https://www.youtube.com/watch?v=jKU9IbEkBhY","date":1771106440,"author":"Timeline - World History Documentaries","guid":498,"unread":true,"content":"<article>From the brutal arenas of Ancient Rome to the secret resistance movements of WW2, the act of martyrdom has shaped the course of human history. This documentary explores the visceral and often terrifying stories recorded in John Foxe’s famous \"Book of Martyrs,\" detailing the lives of those who chose the stake, the axe, or the gallows over renouncing their convictions. We trace the evolution of sacrifice through the ages: the stoning of Saint Stephen, the political trial of Joan of Arc, the persecutions of Tudor England, and the defiant stand of Dietrich Bonhoeffer against the Nazi regime. Discover how these ultimate acts of faith became powerful tools of political and religious change, leaving a legacy that still resonates in the modern world. \n\nYou can now become a History Hit member right here on YouTube! Join for access to a new exclusive documentary every week, and access to over 160+ of our documentaries presented by world renowned historians like Dan Snow, Eleanor Janega, Tristan Hughes, Mary Beard, Matt Lewis and more.\nGet an exclusive release every week by signing up here: https://bit.ly/4pyExyn\n\nThis channel is part of the History Hit Network. Any queries, please contact owned-enquiries@littledotstudios.com</article>","contentLength":1236,"flags":null,"enclosureUrl":"https://www.youtube.com/v/jKU9IbEkBhY?version=3","enclosureMime":"","commentsUrl":null},{"title":"President of the World Bank: 'Fail Fast'","url":"https://www.youtube.com/shorts/OJ14VmfIjHk","date":1771099223,"author":"Bloomberg Originals","guid":29,"unread":true,"content":"<article>“Fail fast,” says Ajay Banga, president of the World Bank. He tells Francine Lacqua that if something doesn't work, move on quickly to the next idea.\n\nWatch the full episode of Leaders\n\n--------\nLike this video? Subscribe: http://www.youtube.com/Bloomberg?sub_confirmation=1\n\nGet unlimited access to Bloomberg.com for just $1.99 your first month: https://www.bloomberg.com/subscriptions?in_source=YoutubeOriginals\nBloomberg Originals offers bold takes for curious minds on today’s biggest topics. Hosted by experts covering stories you haven’t seen and viewpoints you haven’t heard, you’ll discover cinematic, data-led shows that investigate the intersection of business and culture. Exploring every angle of climate change, technology, finance, sports and beyond, Bloomberg Originals is business as you’ve never seen it. \n\nSubscribe for business news, but not as you've known it: exclusive interviews, fascinating profiles, data-driven analysis, and the latest in tech innovation from around the world.\n\nVisit our partner channel Bloomberg News for global news and insight in an instant.</article>","contentLength":1102,"flags":null,"enclosureUrl":"https://www.youtube.com/v/OJ14VmfIjHk?version=3","enclosureMime":"","commentsUrl":null},{"title":"Opioid crisis in the US - Business & addiction (2/2) | DW Documentary","url":"https://www.youtube.com/watch?v=2GLPaHa6fTs","date":1771099202,"author":"DW Documentary","guid":14,"unread":true,"content":"<article>Purdue Pharma earned billions with OxyContin. The company also triggered a race, as dozens of pharmaceutical companies rushed into the market. One was Insys, which sold fentanyl, a drug fifty times stronger than heroin.\n\nProfit was gained by any means necessary - from strippers seducing doctors to bribery, insurance fraud and massive dose increases without the consent of patients. Some did not survive.\n\nIn Florida, unscrupulous profiteers opened pain clinics that turned out to be \"pill mills” - legal hubs for drugs. Chris George, head of the largest network, cynically reports on the system that made him rich before he spent 11 years in prison.\n\nBut by the end of the 2010s, the party was over: the justice system put a stop to the legal trade. Pharmacies stopped selling opioids. But the pills did not disappear. Mexican drug cartels took over the business. Members of the Sinaloa cartel explain in the documentary how they copied the methods of US pharmaceutical companies. To this day, they continue to flood the streets of America with fentanyl.\n\n*[Part 1: https://youtu.be/MyQQiK3vn88]*\n\n#documentary #dwdocumentary #dwdocs #opioidcrisis  #usa #addictionawareness \n______\n\nDW Documentary gives you knowledge beyond the headlines. Watch top documentaries from German broadcasters and international production companies. Meet intriguing people, travel to distant lands, get a look behind the complexities of daily life and build a deeper understanding of current affairs and global events. Subscribe and explore the world around you with DW Documentary.\n\nSubscribe to: ‬\n⮞ DW Documentary (English): https://www.youtube.com/@DWDocumentary \n⮞ DW Documental (Spanish): https://www.youtube.com/@DWDocumental \n⮞ DW Documentary وثائقية دي دبليو (Arabic): https://www.youtube.com/@dwdocarabia\n⮞ DW Documentary हिन्दी (Hindi): https://www.youtube.com/@dwdochindi\n⮞ DW Dokumenter (Indonesian): https://www.youtube.com/@DWDokumenter\n⮞ DW Doku (German): https://www.youtube.com/@dwdoku\n\nFor more visit: http://www.dw.com/en/tv/docfilm/s-3610\nFollow DW Documentary on Instagram: https://www.instagram.com/dwdocumentary/\nFollow DW Documental on Facebook: https://www.facebook.com/dwdocumental\n\nWe kindly ask viewers to read and stick to the DW netiquette policy on our channel: https://p.dw.com/p/MF1G</article>","contentLength":2340,"flags":null,"enclosureUrl":"https://www.youtube.com/v/2GLPaHa6fTs?version=3","enclosureMime":"","commentsUrl":null},{"title":"The Problem With Uploading Your Consciousness | Cosmic Queries #105","url":"https://www.youtube.com/watch?v=p7lPFbiHwa0","date":1771093592,"author":"StarTalk","guid":514,"unread":true,"content":"<article>Sign up for your one-dollar-per-month trial period at https://www.shopify.com/startalk \n\nIs your consciousness a quantum phenomenon? Is the universe one predetermined block? Neil deGrasse Tyson and cohosts Chuck Nice and Gary O’Reilly answer grab bag questions about quantum theory, the cosmological constant, and retrocausality with astrophysicist Charles Liu.\n\nWe explore a question about the Big Rip, quarks, and whether tearing the universe apart could spark a brand-new Big Bang. We break down why phantom energy would be required, what dark energy might be, and why current observations suggest the universe probably won’t rip itself to shreds even though we still don’t know what 95% of the cosmos actually is. Could the cosmological constant be changing over time?\n\nCan light help us reconcile relativity and quantum mechanics? We discuss the work of Jacob Barandes at Harvard and whether the \"duality\" of light is the lynchpin to a unified theory. Are today’s mathematical tools just placeholders for physical phenomena? Questions about retrocausality, block time, and whether the universe already exists in full spark reflections on science fiction, free will, and the experiments we can’t yet perform.  Could extra dimensions provide a mathematical loophole for the laws of physics?\n\nWe confront quantum consciousness head-on. Is consciousness rooted in quantum mechanics? Could it persist beyond physical change or even death? We explore philosophical perspectives on Penrose’s ideas, AI consciousness, digital copies of the self, and why “I don’t know” remains the most powerful phrase in science. Along the way: pseudoscience, vaccines, human ignorance, collective behavior, spiritual experiences, and a final reminder that curiosity is what moves us forward.\n\nThanks to our Patrons Jules, Kelton Falls, Danielhero 11, Zaubergarden, Danilo Vieira Battistini, Brian Lacroix, Charles Baker, Matthew Krug, Chris A, Sandra Leduc, Rodney Schneider, Sir Sucknoramus, Dominik Zwahlen, Malachi Vanderpuye, Zac, Will Johnson, John DeGrey, ClumsyVirtuose, Holly Sweet, Chuck Montana, Jeffrey Holt, Stephen, Extronox, Jon, Ben Grund, Jona Smith, Christopher Zalenski, Wile E Coyote, Stephen Patterson, Amber Johnson, Cameron Clark, D. L. Brown, Maitreya Save, Samuel, John Blankenship, BridgesNotBurned, Nicholas, Katie Hoen, Mometc, Henry, Rajeev Patel, Neufin, Philip Olafsen, Kiara Barbosa, Justin Lodge, Ayaku, Rodney Long, Feeneydactyl, Holman Coates, John, Stephen Crotts, Scherzmeister, Cengiz Ozmen, Julie Cunningham, Ian, Chris Cutshall, Michael Taylor, Rahul, Ben Cruickshank, Jonathan Schneider, Masego Jacobs, Luis T. Guzmán, Ylian Arien, Kage, Doug Wilson, Kevin Talbot, Kevin Dillane, E. Hughes, BruceWayne, Paul Lopez, Aldo, Michael Sullivan, Gary Seighman, Bill M, Rajah, ScrubGhost, Trung N, Carl Kangas, Andres S., Emrys Roberts, Carson Grover, Marshall McCarty, Aaron Bailey, Allison Wilsmann, Callan Richardson, Elijah Rogers, Ismail Hamzaoui, Barrie Corp, Cezary Rzempoluch, Aaron Rodriquez, Tango66, CPhase595, LilB YT, M Hays, Keith, Rodriguez Rafael, Mary Howe, McGheezer, John Judkins, Jon Hicken, FiapoDM, and Manny for supporting us this week.\n\nTimestamps:\n00:00 - Introduction: Charles Liu\n04:07 - Is There an Infinite Quark Glitch with the Big Rip?\n14:56 - Is Light the Key to Joining Quantum and Relativity?\n20:23 - Are We in a Predetermined Block Universe?\n27:43 - Quantum Entanglement Through Other Dimensions\n34:18 - Is Consciousness the Result of Quantum Physics? \n45:25 - Is There Scientific Basis for an Afterlife?\n49:12 - Uploading Consciousness\n58:03 - Examples of Scientific Ignorance \n01:08:11 - Chuck’s Experience Being One with the Universe\n\nCheck out our second channel, @StarTalkPlus\n\nGet the NEW StarTalk book, 'To Infinity and Beyond: A Journey of Cosmic Discovery' on Amazon: https://amzn.to/3PL0NFn\n\nSupport us on Patreon: https://www.patreon.com/startalkradio\n\nFOLLOW or SUBSCRIBE to StarTalk:\nTwitter: http://twitter.com/startalkradio\nFacebook: https://www.facebook.com/StarTalk\nInstagram: https://www.instagram.com/startalk\n\nAbout StarTalk: \nScience meets pop culture on StarTalk! Astrophysicist &amp; Hayden Planetarium director Neil deGrasse Tyson, his comic co-hosts, guest celebrities &amp; scientists discuss astronomy, physics, and everything else about life in the universe. Keep Looking Up!\n\n#StarTalk #NeildeGrasseTyson</article>","contentLength":4395,"flags":null,"enclosureUrl":"https://www.youtube.com/v/p7lPFbiHwa0?version=3","enclosureMime":"","commentsUrl":null},{"title":"Venus, Cupid, Folly and Time by Agnolo Bronzino","url":"https://www.youtube.com/shorts/gLBi9GtGXpg","date":1771093079,"author":"Great Art Explained","guid":684,"unread":true,"content":"<article>Painted around 1545 for the Medici court in Florence, this is one of the most unsettling images of love ever made.\n\nThe painting was likely a diplomatic gift from Cosimo I de’ Medici to the French court — possibly to Francis I. That context matters. The French court loved complex allegories, intellectual puzzles, and refined eroticism. This is a painting designed to be decoded.\n\nUnlike Renaissance harmony (think Leonardo or Raphael) this painting feels tense, airless. There is no stable ground and Venus’ body twists unnaturally; Cupid’s leg bends at an impossible angle. Even beauty feels slightly disturbing.\n\nAnd that’s the point.</article>","contentLength":648,"flags":null,"enclosureUrl":"https://www.youtube.com/v/gLBi9GtGXpg?version=3","enclosureMime":"","commentsUrl":null},{"title":"What Happens When the Watchdog Is Accused of Wrongdoing?","url":"https://www.youtube.com/shorts/T-3CKcLXcuI","date":1771081253,"author":"Bloomberg Originals","guid":28,"unread":true,"content":"<article>Malaysia’s Anti-Corruption Commission is facing allegations of corruption despite being the agency tasked with holding others accountable. The MACC has denied any wrongdoing, but the controversy may signal a deeper crisis for the government.\n\nWatch the full story\n\n--------\nLike this video? Subscribe: http://www.youtube.com/Bloomberg?sub_confirmation=1\n\nGet unlimited access to Bloomberg.com for just $1.99 your first month: https://www.bloomberg.com/subscriptions?in_source=YoutubeOriginals\nBloomberg Originals offers bold takes for curious minds on today’s biggest topics. Hosted by experts covering stories you haven’t seen and viewpoints you haven’t heard, you’ll discover cinematic, data-led shows that investigate the intersection of business and culture. Exploring every angle of climate change, technology, finance, sports and beyond, Bloomberg Originals is business as you’ve never seen it. \n\nSubscribe for business news, but not as you've known it: exclusive interviews, fascinating profiles, data-driven analysis, and the latest in tech innovation from around the world.\n\nVisit our partner channel Bloomberg News for global news and insight in an instant.</article>","contentLength":1179,"flags":null,"enclosureUrl":"https://www.youtube.com/v/T-3CKcLXcuI?version=3","enclosureMime":"","commentsUrl":null},{"title":"The Worm with 4 Nobel Prizes","url":"https://www.youtube.com/shorts/5EPPBDdhe6o","date":1771081215,"author":"Kurzgesagt – In a Nutshell","guid":141,"unread":true,"content":"<article>This tiny worm helped scientists map every cell, trace the first brain connectome, light up genes, and unlock powerful genetic tools. With four Nobel prizes linked to it, C. elegans quietly changed science forever.\n\n#kurzgesagt\n#inanutshell #kurzgesagt_inanutshell #learnwithshorts #science #nobelprize #nobelprizewinner \n\nSources &amp; further reading: \nhttps://sites.google.com/view/kgs-tiktok-sources\n\nFollow us for more sciencey content! 🦆\n\nOUR CHANNELS\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nGerman:        https://kgs.link/youtubeDE\nSpanish:        https://kgs.link/youtubeES\nFrench:          https://kgs.link/youtubeFR\nPortuguese:  https://kgs.link/youtubePT\nArabic:           https://kgs.link/youtubeAR\nHindi:             https://kgs.link/youtubeHI\nJapanese:     https://kgs.link/youtubeJA\nKorean:          https://kgs.link/youtubeKO\n\n\nHOW CAN YOU SUPPORT US?\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nThis is how we make our living and it would be a pleasure if you support us!\n\nGet Products designed with ❤ https://shop.kgs.link/shorts\nBecome a Part of kurzgesagt by joining the Patreon Bird Army 🐧  https://kgs.link/patreon  \n\n\nDISCUSSIONS &amp; SOCIAL MEDIA\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nInstagram:     https://kgs.link/instagram\nTikTok:           https://kgs.link/tiktok\nReddit:            https://kgs.link/reddit\nDiscord:          https://kgs.link/discord\nTwitter:           https://kgs.link/twitter\nBluesky:          https://kgs.link/bluesky\nFacebook:      https://kgs.link/facebook\nNewsletter:    https://kgs.link/newsletter\n\n\nOUR VOICE\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nThe Kurzgesagt voice is from \nSteve Taylor:  https://kgs.link/youtube-voice\n\n\nOUR MUSIC ♬♪\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\n700+ minutes of Kurzgesagt Soundtracks by Epic Mountain:\n\nSpotify:            https://kgs.link/music-spotify\nSoundcloud:   https://kgs.link/music-soundcloud\nBandcamp:     https://kgs.link/music-bandcamp\nYoutube:          https://kgs.link/music-youtube\nFacebook:       https://kgs.link/music-facebook</article>","contentLength":2231,"flags":null,"enclosureUrl":"https://www.youtube.com/v/5EPPBDdhe6o?version=3","enclosureMime":"","commentsUrl":null},{"title":"JB Pritzker wants to take down Trump | Today, Explained","url":"https://www.youtube.com/watch?v=xcaUGZzdmaY","date":1771074103,"author":"Vox","guid":82,"unread":true,"content":"<article>Illinois Governor JB Pritzker has a playbook for fighting back against the Trump administration, and he says it’s working. Few Democratic politicians have leaned into the fight against the Trump administration as aggressively as he has. While some blue-state leaders have tried to find a lane of compromise or quiet resistance, Pritzker has gone the other direction: signing laws to limit ICE operations in Illinois, creating an accountability commission staffed by retired federal judges, suing the federal government, and successfully blocking the deployment of federalized National Guard troops on Chicago’s streets.\n\nPritzker is a unique figure in Democratic politics. A billionaire heir to the Hyatt hotel fortune, he has spent tens of millions of his own dollars to push for a more progressive income tax in Illinois and has advocated for a national wealth tax — policies that would directly cost him money. He's also a Jewish Democrat who has navigated his party’s shifting positions on Israel and Gaza and is a two-term governor who has drawn some public support as a potential 2028 presidential candidate.\n\n00:00 Intro \n01:22 The Illinois playbook against Trump \n03:23 Are Dems too timid in their pushback against Trump? \n05:07 Are our elections safe? \n06:17 Democrats and immigration \n09:27 A billionaire in favor of the wealth tax \n11:12 Is Gov. Pritzker running for president? \n14:03 Democratic missteps in the past \n15:58 Views on Israel and antisemitism\n19:31 Is Gov. Pritzker on GLP-1s? \n\nToday, Explained publishes compelling interviews with key figures in politics and culture every Saturday. Subscribe to Vox’s YouTube channel to get them or listen wherever you get your podcasts. And new episodes of Today, Explained drop every weekday on Apple Podcasts, Spotify, or your favorite listening app.\n\nIf you enjoy our reporting and want to hear more from Vox journalists, sign up for our Patreon at patreon.com/vox. Each month, our members get access to exclusive videos, livestreams, and chats with our newsroom.\n\nSubscribe to our channel! http://goo.gl/0bsAjO\n\nVox.com is a news website that helps you cut through the noise and understand what's really driving the events in the headlines. Check out http://www.vox.com.\n\nWatch our full video catalog: http://goo.gl/IZONyE\nFollow Vox on Facebook: http://goo.gl/U2g06o\nOr Twitter: http://goo.gl/XFrZ5H</article>","contentLength":2376,"flags":null,"enclosureUrl":"https://www.youtube.com/v/xcaUGZzdmaY?version=3","enclosureMime":"","commentsUrl":null},{"title":"Three takeaways from a conversation with Illinois Gov. JB Pritzker #shorts","url":"https://www.youtube.com/shorts/h8sUY1XC_xE","date":1771074076,"author":"Vox","guid":81,"unread":true,"content":"<article>Vox’s Astead Herndon is back in his hometown of Chicago to speak with Illinois Gov. JB Pritzker about why the Democrats lost in 2024, Pritzker’s own weight-loss journey, and everything in between.\n\nYou can watch their full interview here on YouTube. \n\nSubscribe to our channel and turn on notifications (🔔) so you don't miss any videos: http://goo.gl/0bsAjO\n\nVox.com is a news website that helps you cut through the noise and understand what's really driving the events in the headlines. Check out http://www.vox.com.\n\nWatch our full video catalog: http://goo.gl/IZONyE\nFollow Vox on TikTok: http://tiktok.com/@voxdotcom\nCheck out our articles: https://www.vox.com/\nListen to our podcasts: https://www.vox.com/podcasts</article>","contentLength":725,"flags":null,"enclosureUrl":"https://www.youtube.com/v/h8sUY1XC_xE?version=3","enclosureMime":"","commentsUrl":null},{"title":"The Hidden Message on This Japanese Battle Flag","url":"https://www.youtube.com/shorts/aojXuamElfo","date":1771070407,"author":"Imperial War Museums","guid":553,"unread":true,"content":"<article>This video examines how a captured Japanese good‑luck flag became a powerful metaphor for the cultural divide in the Burma war.</article>","contentLength":129,"flags":null,"enclosureUrl":"https://www.youtube.com/v/aojXuamElfo?version=3","enclosureMime":"","commentsUrl":null},{"title":"Epstein Files: The 6 Names the DOJ Didn't Want You to See","url":"https://www.youtube.com/watch?v=cvOuN5KqufE","date":1771026307,"author":"Patrick Boyle","guid":101,"unread":true,"content":"<article>Get an exclusive 15% discount on Saily data plans! Use code BOYLE at checkout. Download Saily app or go to https://saily.com/boyle\n\nThe February 2026 release of unredacted Epstein files is finally revealing a stark reality: while billionaire CEOs are losing their jobs overseas within hours of being unmasked, the U.S. security apparatus is still actively covering up for the \"Epstein Class.\" This video dives de into the congressional revelation of the \"protected six,\" exposing the truth behind Leslie Wexner's secret $100 million settlement and the disturbing \"torture video\" emails that immediately toppled the CEO of DP World. We analyze why the FBI is still hiding crucial investigation files—like the 302 victim statements—while Ghislaine Maxwell receives a mysterious prison upgrade and offers conditional testimony. The names are finally out, but as this investigation proves, the cover-up is far from over.\n\nIn this video we ask who are: Les Wexner and Sultan Ahmed bin Sulayem.  Since the video was released after being questioned by The Guardian - the Department of Justice said that four of the men have no connection to Epstein whatsoever, but rather appeared in a photo lineup assembled by the southern district of New York (SDNY). https://www.theguardian.com/us-news/2026/feb/13/four-men-unredacted-epstein-files-no-ties-ro-khanna\n\nPatrick's Books:\nStatistics For The Trading Floor:  https://amzn.to/3eerLA0\nDerivatives For The Trading Floor:  https://amzn.to/3cjsyPF\nCorporate Finance:  https://amzn.to/3fn3rvC \n\nWays To Support The Channel\nPatreon: https://www.patreon.com/PatrickBoyleOnFinance\nBuy Me a Coffee: https://www.buymeacoffee.com/patrickboyle\n\nVisit our website: https://www.onfinance.org\nFollow Patrick on Twitter Here: https://bsky.app/profile/pboyle.bsky.social\n\nBusiness Inquiries ➡️ sponsors@onfinance.org\n\nPatrick Boyle On Finance Podcast:\nSpotify: https://open.spotify.com/show/7uhrWlDvxzy9hLoW0EYf0b\nApple: https://podcasts.apple.com/us/podcast/patrick-boyle-on-finance/id1547740313\nGoogle Podcasts: https://tinyurl.com/62862nve\n\nJoin this channel to support making this content:\nhttps://www.youtube.com/channel/UCASM0cgfkJxQ1ICmRilfHLw/join</article>","contentLength":2186,"flags":null,"enclosureUrl":"https://www.youtube.com/v/cvOuN5KqufE?version=3","enclosureMime":"","commentsUrl":null},{"title":"Allegations of Intimidation by Malaysia’s Anti-Corruption Commission","url":"https://www.youtube.com/shorts/rCDMJL6GRMw","date":1771023669,"author":"Bloomberg Originals","guid":27,"unread":true,"content":"<article>A Bloomberg investigation uncovered allegations of intimidation by people questioned by Malaysia’s controversial anti-corruption commission -- claims the commission has denied.  \n\n--------\nLike this video? Subscribe: http://www.youtube.com/Bloomberg?sub_confirmation=1\n\nGet unlimited access to Bloomberg.com for just $1.99 your first month: https://www.bloomberg.com/subscriptions?in_source=YoutubeOriginals\nBloomberg Originals offers bold takes for curious minds on today’s biggest topics. Hosted by experts covering stories you haven’t seen and viewpoints you haven’t heard, you’ll discover cinematic, data-led shows that investigate the intersection of business and culture. Exploring every angle of climate change, technology, finance, sports and beyond, Bloomberg Originals is business as you’ve never seen it. \n\nSubscribe for business news, but not as you've known it: exclusive interviews, fascinating profiles, data-driven analysis, and the latest in tech innovation from around the world.\n\nVisit our partner channel Bloomberg News for global news and insight in an instant.</article>","contentLength":1094,"flags":null,"enclosureUrl":"https://www.youtube.com/v/rCDMJL6GRMw?version=3","enclosureMime":"","commentsUrl":null},{"title":"Thirty Years' War: The Religious Feud That Shattered Medieval Europe","url":"https://www.youtube.com/watch?v=Hkgpn3dRqSM","date":1771020015,"author":"Timeline - World History Documentaries","guid":497,"unread":true,"content":"<article>In 1618, a celestial omen sparked the 30 Years War, a conflict so devastating it wiped out one-third of Germany's population. This documentary explores the transition from a war of religion to a struggle for global supremacy. Through the rare diary of a mercenary, the secret coded letters of painter-spy Peter Paul Rubens, and the shadow operations of the \"Grey Eminence,\" we reveal how the first modern war shattered the old world and gave birth to the Europe we recognize today.\n\nYou can now become a History Hit member right here on YouTube! Join for access to a new exclusive documentary every week, and access to over 160+ of our documentaries presented by world renowned historians like Dan Snow, Eleanor Janega, Tristan Hughes, Mary Beard, Matt Lewis and more.\nGet an exclusive release every week by signing up here: https://bit.ly/4pyExyn\n\nThis channel is part of the History Hit Network. Any queries, please contact owned-enquiries@littledotstudios.com</article>","contentLength":962,"flags":null,"enclosureUrl":"https://www.youtube.com/v/Hkgpn3dRqSM?version=3","enclosureMime":"","commentsUrl":null},{"title":"NFL hall of famer on what players knew about CTE","url":"https://www.youtube.com/watch?v=b8uAuTDDOGo","date":1771016430,"author":"FRONTLINE PBS | Official","guid":484,"unread":true,"content":"<article>Former New York Giants linebacker Harry Carson who was diagnosed with post-concussion syndrome and advocated for other players to join a lawsuit against the NFL over brain injuries discusses why he regrets ever playing football.\n\nThis journalism is made possible by viewers like you. Donate to FRONTLINE now: https://bit.ly/47DFzCb\n\nAnd support your local PBS station here: https://www.pbs.org/donate\n\nHarry Carson spoke to FRONTLINE’s Michael Kirk on Sept. 4, 2013, for our 2013 documentary, “League of Denial.” The interview has been edited for accuracy and clarity as part of an editorial and legal review. See a more complete description of our process here: https://to.pbs.org/4lVZKzA\n\nThis interview is being published as part of FRONTLINE’s Transparency Project, an effort to open up the source material behind our documentaries. Read more about this project here: https://www.pbs.org/wgbh/frontline/about-frontlines-transparency-project/\n\n“League of Denial” is available to watch here: https://youtu.be/SedClkAnclk\n\nExplore more of our extended interviews in this playlist: https://www.youtube.com/playlist?list=PL_pPc6-qR9ZzEepVsKZsT58XiLb38Tttr\n\n #HarryCarson #Football #BrainInjuries\n\nSubscribe on YouTube: https://www.youtube.com/user/PBSfrontline\nSign up for our newsletter: https://frontline.org/newsletter\nInstagram: https://www.instagram.com/frontlinepbs\nFacebook: https://www.facebook.com/frontline\nBluesky: https://bsky.app/profile/frontlinepbs.bsky.social\n\nFRONTLINE is produced at GBH in Boston and airs nationwide on PBS.\n\nThe editor-in-chief and executive producer of FRONTLINE is Raney Aronson-Rath.\n\nFunding for FRONTLINE is provided through the support of PBS viewers and by the Corporation for Public Broadcasting, with major support from Ford Foundation. Additional support for FRONTLINE is provided by the Abrams Foundation, Park Foundation, John D. and Catherine T. MacArthur Foundation, Heising-Simons Foundation, and the FRONTLINE Trust, with major support from Jon and Jo Ann Hagler on behalf of the Jon L. Hagler Foundation, and additional support from Koo and Patricia Yuen.</article>","contentLength":2120,"flags":null,"enclosureUrl":"https://www.youtube.com/v/b8uAuTDDOGo?version=3","enclosureMime":"","commentsUrl":null},{"title":"Illinois Gov. JB Pritzker speaks about his weight loss #shorts","url":"https://www.youtube.com/shorts/ruTSZhdAL18","date":1771012790,"author":"Vox","guid":80,"unread":true,"content":"<article>Does Illinois Gov. JB Pritzker’s recent weight loss point to a potential 2028 presidential run? 👀 He sets the record straight in a conversation with Vox’s Astead Herndon. \n\nYou can watch their full interview on Saturday wherever you get your podcasts or here on YouTube.\n\nSubscribe to our channel and turn on notifications (🔔) so you don't miss any videos: http://goo.gl/0bsAjO\n\nVox.com is a news website that helps you cut through the noise and understand what's really driving the events in the headlines. Check out http://www.vox.com.\n\nWatch our full video catalog: http://goo.gl/IZONyE\nFollow Vox on TikTok: http://tiktok.com/@voxdotcom\nCheck out our articles: https://www.vox.com/\nListen to our podcasts: https://www.vox.com/podcasts</article>","contentLength":748,"flags":null,"enclosureUrl":"https://www.youtube.com/v/ruTSZhdAL18?version=3","enclosureMime":"","commentsUrl":null},{"title":"Paul Revere's Midnight Ride, myth or true? 🐴#AmericanRevolutionPBS","url":"https://www.youtube.com/shorts/xUVPmPYb9rs","date":1771002100,"author":"PBS","guid":128,"unread":true,"content":"<article>Historians are in agreement that Paul Revere did alert colonial rebels that soldiers were on the move in April of 1775, but he wasn't alone and his now famous quote: \"The British are coming!\" is an inaccuracy, it's just not how colonial people would have spoken at the time. The phrase is likely shaped by a popular poem written nearly a century after the events.\n\nMade possible by viewers like you. Support your local PBS station: https://www.pbs.org/donate\n\nEnjoy full episodes of your favorite PBS shows anytime, anywhere with the free PBS app!\n\n#shorts #myths #historyfacts #history #hero</article>","contentLength":592,"flags":null,"enclosureUrl":"https://www.youtube.com/v/xUVPmPYb9rs?version=3","enclosureMime":"","commentsUrl":null},{"title":"Humanity in the midst of war - Survival and loss in Ukraine | DW Documentary","url":"https://www.youtube.com/watch?v=EVW8igV-jhA","date":1771002018,"author":"DW Documentary","guid":13,"unread":true,"content":"<article>They evacuate elderly and sick people, set up medical stations and organize escape routes. New structures of protection, security and dignity are emerging in Ukraine, while war shapes everyday life.\n\nAll of Ukraine has been at war since Russia’s full-scale attack in February 2022. It is a war whose repercussions are inescapable. And it is giving rise to new structures that every country would be happier to be able to live without. \nOne of these is a network of carers who risk their lives to evacuate elderly and sick people from homes that they are often unable to leave on their own. For some, it’s the first journey of their lives, for others, the last. \nA different team, of forensic scientists and military personnel, works to identify the remains of young soldiers. The bodies of the fallen are then transported across Ukraine to their families so that they can be buried in their hometowns. These tasks are all the more difficult, as they must be accomplished amidst the constant threat of bombs and drones. \nAs Russia's war of aggression rages against Ukraine, Yuri Rechinsky documents the everyday lives of those who are too weak to flee, or who care for the dead. He captures impressions of displacement, uncertainty, grief and loss, but also shows moments of solidarity, humor and resilience. \"Dear Beautiful Beloved\" takes a sober look at the survival strategies of people who retain their humanity in the midst of war.\n\n#documentary #dwdocumentary #dwdocs #ukraine \n______\n\nDW Documentary gives you knowledge beyond the headlines. Watch top documentaries from German broadcasters and international production companies. Meet intriguing people, travel to distant lands, get a look behind the complexities of daily life and build a deeper understanding of current affairs and global events. Subscribe and explore the world around you with DW Documentary.\n\nSubscribe to: ‬\n⮞ DW Documentary (English): https://www.youtube.com/@DWDocumentary \n⮞ DW Documental (Spanish): https://www.youtube.com/@DWDocumental \n⮞ DW Documentary وثائقية دي دبليو (Arabic): https://www.youtube.com/@dwdocarabia\n⮞ DW Documentary हिन्दी (Hindi): https://www.youtube.com/@dwdochindi\n⮞ DW Dokumenter (Indonesian): https://www.youtube.com/@DWDokumenter\n⮞ DW Doku (German): https://www.youtube.com/@dwdoku\n\nFor more visit: http://www.dw.com/en/tv/docfilm/s-3610\nFollow DW Documentary on Instagram: https://www.instagram.com/dwdocumentary/\nFollow DW Documental on Facebook: https://www.facebook.com/dwdocumental\n\nWe kindly ask viewers to read and stick to the DW netiquette policy on our channel: https://p.dw.com/p/MF1G</article>","contentLength":2648,"flags":null,"enclosureUrl":"https://www.youtube.com/v/EVW8igV-jhA?version=3","enclosureMime":"","commentsUrl":null},{"title":"Meet Jennifer Siebel Newsom","url":"https://www.youtube.com/shorts/qTx3F0KzkI8","date":1770999791,"author":"Bloomberg Originals","guid":26,"unread":true,"content":"<article>California’s First Partner sits down with Emily Chang to talk about switching political parties, her acting career and the mission driving her now.\n\nWatch The Circuit\n\n--------\nLike this video? Subscribe: http://www.youtube.com/Bloomberg?sub_confirmation=1\n\nGet unlimited access to Bloomberg.com for just $1.99 your first month: https://www.bloomberg.com/subscriptions?in_source=YoutubeOriginals\nBloomberg Originals offers bold takes for curious minds on today’s biggest topics. Hosted by experts covering stories you haven’t seen and viewpoints you haven’t heard, you’ll discover cinematic, data-led shows that investigate the intersection of business and culture. Exploring every angle of climate change, technology, finance, sports and beyond, Bloomberg Originals is business as you’ve never seen it. \n\nSubscribe for business news, but not as you've known it: exclusive interviews, fascinating profiles, data-driven analysis, and the latest in tech innovation from around the world.\n\nVisit our partner channel Bloomberg News for global news and insight in an instant.</article>","contentLength":1082,"flags":null,"enclosureUrl":"https://www.youtube.com/v/qTx3F0KzkI8?version=3","enclosureMime":"","commentsUrl":null},{"title":"How Nuclear Power Went From Miracle To Nightmare | Compilation","url":"https://www.youtube.com/watch?v=P4JdQMG0cVY","date":1770994843,"author":"Weird History","guid":703,"unread":true,"content":"<article>One the world reached 'the nuclear age', reality got... interesting. Dicey, to say the least, and definitely not like it was before nuclear weapons. Today we are offering a compilation of insightful, scary, and downright interesting videos about all things nuclear. What exactly happened that caused the Chernobyl Meltdown in 1986? How about the American nuclear accident at 3 Mile Island? What plans does the U.S. government have in place in the event of a nuclear attack? What are nuclear bunkers made of? All fo these, and a number of other  wild nuclear situations all in one compilation for you. What part freaks you out the most, or do you find most interesting? Let us know in the comments!\n\n\nChapter:\n00:00:00 - Everything That Had To Go Wrong For Chernobyl To Happen\n00:11:02 - Everything That Went Wrong on 3-Mile Island\n00:21:28 - How a Soviet Soldier Saved the World From Annihilation\n00:31:57 - Everything The US Government Has Planned For Surviving A Nuclear Attack\n00:43:13 - How He Stumbled Upon The US Government's Nuclear Bunkers\n00:50:42 - Creepiest Chernobyl Stories You've Never Heard\n\nBe sure to subscribe to the Weird History Newsletter: https://bit.ly/WeirdHistoryNews\n\n#compilation #nuclear #weirdhistory</article>","contentLength":1229,"flags":null,"enclosureUrl":"https://www.youtube.com/v/P4JdQMG0cVY?version=3","enclosureMime":"","commentsUrl":null},{"title":"Brian Cox Flies to Earth's 'Thin Blue Line' | Wonders Of The Solar System | BBC Earth Science","url":"https://www.youtube.com/watch?v=233_krF8KM0","date":1770994809,"author":"BBC Earth Science","guid":693,"unread":true,"content":"<article>Whilst in South Africa, Professor Brian Cox gets aboard the now discontinued  English Electric Lightning Jet and flies around 18 kilometres to reach the atmospheric edge of the Earth to see the 'thin blue line' that protects us down below.\n\nBest of Earth Science: http://bit.ly/EarthLabOriginals \nBest of BBC Earth: http://bit.ly/TheBestOfBBCEarthVideos \n\nTaken from: Wonders of the Solar System (2010)\n\nThis is a channel from BBC Studios who help fund new BBC programmes. Service information and feedback: http://bbcworldwide.com/vod-feedback--contact-details.aspx</article>","contentLength":565,"flags":null,"enclosureUrl":"https://www.youtube.com/v/233_krF8KM0?version=3","enclosureMime":"","commentsUrl":null},{"title":"AI Fails at 96% of Jobs (New Study)","url":"https://www.youtube.com/watch?v=z3kaLM8Oj4o","date":1770994579,"author":"ColdFusion","guid":538,"unread":true,"content":"<article>Artificial intelligence has been hailed as one of the most transformative technologies of the century. That may be so, but just not yet. In this episode, we take a look at a study that pits humans directly against AI for paid work. The results were surprising. \nStudy here: https://www.remotelabor.ai/paper.pdf\nWebsite: https://www.remotelabor.ai\n\nWatch or listen to ColdFusion on Spotify: https://open.spotify.com/show/1YEwCKoRz8fEDqheXB6UJ1\n\n\nColdFusion Music: \nhttp://burnwater.bandcamp.com   \nhttps://www.youtube.com/@ColdFusionmusic\n\n\nColdFusion Socials: \n\nhttps://discord.gg/coldfusion\nhttps://facebook.com/ColdFusionTV \nhttps://twitter.com/ColdFusion_TV \nhttps://instagram.com/coldfusiontv\n\nCreated by: Dagogo Altraide\nProducers: Tawsif Akkas, Dagogo Altraide</article>","contentLength":766,"flags":null,"enclosureUrl":"https://www.youtube.com/v/z3kaLM8Oj4o?version=3","enclosureMime":"","commentsUrl":null},{"title":"Why GLP-1 drugs are a solution for some and a problem for others #shorts","url":"https://www.youtube.com/shorts/ncr0U4nEma0","date":1770991277,"author":"Vox","guid":79,"unread":true,"content":"<article>GLP-1 drugs seem to be everywhere these days. One in eight adults say they’re taking the drugs. And brands like Wegovy and Ro even ran commercials during the Super Bowl. But are GLP-1s a one-size-fits-all solution? Not exactly. \n\nClinical psychologist Dr. Sera Lavelle spoke to Today, Explained guest host Jonquilyn Hill about whether GLP-1 drugs are harmful or hurtful, and why the answer to that question is nuanced and dependent on a patient’s history. \n\nYou can listen to the full episode of Today, Explained wherever you get your podcasts. \n\nSubscribe to our channel and turn on notifications (🔔) so you don't miss any videos: http://goo.gl/0bsAjO\n\nVox.com is a news website that helps you cut through the noise and understand what's really driving the events in the headlines. Check out http://www.vox.com.\n\nWatch our full video catalog: http://goo.gl/IZONyE\nFollow Vox on TikTok: http://tiktok.com/@voxdotcom\nCheck out our articles: https://www.vox.com/\nListen to our podcasts: https://www.vox.com/podcasts</article>","contentLength":1020,"flags":null,"enclosureUrl":"https://www.youtube.com/v/ncr0U4nEma0?version=3","enclosureMime":"","commentsUrl":null},{"title":"Is bigger better when it comes to muscles? | DW Documentary","url":"https://www.youtube.com/shorts/2rAlkuiC8PI","date":1770991210,"author":"DW Documentary","guid":12,"unread":true,"content":"<article>Muscles can do much more than just set our bodies in motion: regular muscle training has a positive impact on our overall health. This is because muscles work in a similar way to an endocrine organ: when activated, muscles release messenger substances called myokines, which directly influence our central organs such as the brain, liver, heart and intestines. If we lose muscle mass, these organs can become diseased, or metabolic disorders like diabetes can develop. Increased strength and muscle mass have been linked to better mental health, increased focus, improved sleep, and stronger immunity. \n\n#documentary #dwdocumentary #dwdocs #fitness \n______\n\nWe kindly ask viewers to read and stick to the DW netiquette policy on our channel: https://p.dw.com/p/MF1G</article>","contentLength":765,"flags":null,"enclosureUrl":"https://www.youtube.com/v/2rAlkuiC8PI?version=3","enclosureMime":"","commentsUrl":null},{"title":"Clean Architecture with Python • Sam Keen & Max Kirchoff","url":"https://www.youtube.com/watch?v=w_yq--3wSzw","date":1770989160,"author":"GOTO Conferences","guid":165,"unread":true,"content":"<article>This interview was recorded for the GOTO Book Club.\nhttp://gotopia.tech/bookclub\n\nCheck out more here:\nhttps://gotopia.tech/episodes/418\n\nSam Keen - Founder &amp; Researcher at AlteredCraft &amp; Author of \"Clean Architecture with Python\"\nMax Kirchoff - CTO at Ginko &amp; Multidisciplinary Technologist &amp; Creative\n\nRESOURCES\nSam\nhttps://bsky.app/profile/samkeen.bsky.social\nhttps://x.com/samkeen\nhttps://github.com/samkeen\nhttps://www.linkedin.com/in/samkeen\nhttps://samkeen.dev\n\nMax\nhttps://x.com/ProductNihilist\nhttps://github.com/maxkirchoff\nhttps://www.linkedin.com/in/maxkirchoff\nhttps://maxkirchoff.com\n\nLinks\nhttps://www.heyginko.com\nhttps://martinfowler.com/bliki/TestPyramid.html\n\nDESCRIPTION\nMax Kirchoff interviews Sam Keen about his book \"Clean Architecture with Python\". Sam, a software developer with 30 years of experience spanning companies from startups to AWS, shares his approach to applying clean architecture principles with Python while maintaining the language's pragmatic nature.\n\nThe conversation explores the balance between architectural rigor and practical development, the critical relationship between architecture and testability, and how clean architecture principles can enhance AI-assisted coding workflows. Sam emphasizes that clean architecture isn't an all-or-nothing approach but a set of principles that developers can adapt to their context, with the core value lying in thoughtful dependency management and clear domain modeling.\n\nRECOMMENDED BOOKS\nSam Keen • Clean Architecture with Python • https://amzn.to/4pBT5g0\nFabrizio Romano &amp; Heinrich Kruger • Learn Python Programming • https://amzn.to/4myLBIt\nUncle Bob • Clean Code • https://amzn.to/3soPO6k\nUncle Bob • Clean Architecture • https://amzn.to/3x0gjBQ\nEric Evans • Domain-Driven Design • https://amzn.to/3tnGhwm\nNaomi Ceder • The Quick Python Book • https://amzn.to/3zwdDOa\nLuciano Ramalho • Fluent Python • https://amzn.to/3oSw2je\nDavid Beazley • Python Distilled (Developer's Library) • https://amzn.to/3QjNBEv\nSaleem Siddiqui • Learning Test-Driven Development • https://amzn.to/35OMb3n\nMaciej «MJ» Jedrzejewski • Master Software Architecture • https://leanpub.com/master-software-architecture\n\n\nBluesky (https://bsky.app/profile/gotocon.com) \nTwitter (https://twitter.com/GOTOcon) \nInstagram (https://www.instagram.com/goto_con) \nLinkedIn (https://www.linkedin.com/company/goto-) \nFacebook (https://www.facebook.com/GOTOConferences) \n\nCHANNEL MEMBERSHIP BONUS\nJoin this channel to get early access to videos &amp; other perks:\nhttps://www.youtube.com/channel/UCs_tLP3AiwYKwdUHpltJPuA/join\n\nLooking for a unique learning experience?\nAttend the next GOTO conference near you! Get your ticket: gotopia.tech (https://gotopia.tech) \n\nSUBSCRIBE TO OUR YOUTUBE CHANNEL (https://www.youtube.com/user/GotoConferences/?sub_confirmation=1)  - new videos posted daily!</article>","contentLength":2886,"flags":null,"enclosureUrl":"https://www.youtube.com/v/w_yq--3wSzw?version=3","enclosureMime":"","commentsUrl":null},{"title":"Why Iran’s Leaders Face a Dangerous Moment","url":"https://www.youtube.com/watch?v=YCEWDCDIHMI","date":1770973249,"author":"Bloomberg Originals","guid":25,"unread":true,"content":"<article>Iran’s leadership is under intense pressure. Its bloody crackdown in the face of widespread popular anger and threats by Donald Trump of another US attack have left it with few options for survival.\n\n00:00 Introduction \n01:46 Economic crisis \n04:31 Corruption &amp; mismanagement \n06:26 Nuclear program   \n08:00 Regional influence\n08:51 Leadership &amp; opposition\n10:18 What’s next \n\n#iran #trump #economy \n--------\nLike this video? Subscribe: http://www.youtube.com/Bloomberg?sub_confirmation=1\n\nGet unlimited access to Bloomberg.com for just $1.99 your first month: https://www.bloomberg.com/subscriptions?in_source=YoutubeOriginals\nBloomberg Originals offers bold takes for curious minds on today’s biggest topics. Hosted by experts covering stories you haven’t seen and viewpoints you haven’t heard, you’ll discover cinematic, data-led shows that investigate the intersection of business and culture. Exploring every angle of climate change, technology, finance, sports and beyond, Bloomberg Originals is business as you’ve never seen it. \n\nSubscribe for business news, but not as you've known it: exclusive interviews, fascinating profiles, data-driven analysis, and the latest in tech innovation from around the world.\n\nVisit our partner channel Bloomberg News for global news and insight in an instant.</article>","contentLength":1316,"flags":null,"enclosureUrl":"https://www.youtube.com/v/YCEWDCDIHMI?version=3","enclosureMime":"","commentsUrl":null},{"title":"Iqunix Magi96 Pro & Magi65 Pro review (Kailh Gold Red)","url":"https://www.youtube.com/watch?v=bbFr_xA1ZZU","date":1770962425,"author":"Chyrosran22","guid":96,"unread":true,"content":"<article>Skip to 9:08 for a typing demonstration. \nGet it here: https://iqunix.com/products/iqunix-magi75-96-aluminum-low-profile-mechanical-keyboard\nToday I'm taking a (rather cranky) look at Iqunix' Magi96 and -65 Pro keyboards. It's always good to cover one of these from time to time. Hope you enjoy the video! :)\n\nMy keyboard reviews: http://bit.ly/1TbOtft\nMy switch teardowns: http://bit.ly/2C1QGHz\nMy TOP X videos: http://bit.ly/2FmpZfd\nMy XL typing demos: https://bit.ly/2OoAW3w\nMy tutorials and featurettes: https://bit.ly/2OrkLUh\nMy unboxing videos: https://bit.ly/2TSrr0m\n\nI'm Thomas and I do videos and reviews on mechanical keyboards ranging from the most sickening modern RGB gaming keyboards to vintage hardware relics, or sometimes keycaps or keyswitches ranging from Cherry MX to Alps SKCM to IBM buckling springs and anything in between.\n\nFollow me on Twitter for updates on my keyboard videos! https://twitter.com/chyrosran22\n\nThe practice sentence was: \"Hello my name is Thomas and I'm typing on an Iqunix Magi96 Pro keyboard right now. It's been a while since I did a low-profile keyboard review; this one is alright actually!\"</article>","contentLength":1139,"flags":null,"enclosureUrl":"https://www.youtube.com/v/bbFr_xA1ZZU?version=3","enclosureMime":"","commentsUrl":null},{"title":"What’s Up With Greenland?","url":"https://www.youtube.com/watch?v=lUivkIrfKW4","date":1770934231,"author":"StarTalk","guid":513,"unread":true,"content":"<article>Go to https://ground.news/startalk to stay fully informed on the latest Space and Science news. Save 40% off through our link for unlimited access to the Vantage plan this month.\n\nWhat's up with Greenland? Neil deGrasse Tyson breaks down some important points about Greenland from a scientific, historical, and geopolitical lens. \n\nTimestamps:\n00:00 - A Strategic Position\n03:28 - Melting Ice\n05:50 - The Underground Tunnels\n07:04 - Geopolitics of Greenland\n \nCheck out our second channel, @StarTalkPlus\n\nGet the NEW StarTalk book, 'To Infinity and Beyond: A Journey of Cosmic Discovery' on Amazon: https://amzn.to/3PL0NFn\n\nSupport us on Patreon: https://www.patreon.com/startalkradio\n\nFOLLOW or SUBSCRIBE to StarTalk:\nTwitter: http://twitter.com/startalkradio\nFacebook: https://www.facebook.com/StarTalk\nInstagram: https://www.instagram.com/startalk\n\nAbout StarTalk: \nScience meets pop culture on StarTalk! Astrophysicist &amp; Hayden Planetarium director Neil deGrasse Tyson, his comic co-hosts, guest celebrities &amp; scientists discuss astronomy, physics, and everything else about life in the universe. Keep Looking Up!\n\n#StarTalk #NeildeGrasseTyson</article>","contentLength":1147,"flags":null,"enclosureUrl":"https://www.youtube.com/v/lUivkIrfKW4?version=3","enclosureMime":"","commentsUrl":null},{"title":"Could These Artifacts Rewrite America's Pre-Columbus History?","url":"https://www.youtube.com/watch?v=z7xUD9_s1WI","date":1770933658,"author":"Timeline - World History Documentaries","guid":496,"unread":true,"content":"<article>In 1924, a discovery in the Arizona desert threatened to rewrite American history. Forensic geologist Scott Wolter investigates the Tucson Lead Artifacts - 32 mysterious objects inscribed with Latin and dated to 800 AD. Were these relics left by a precursor to the Knights Templar, or were they part of an elaborate 20th-century hoax? Through microscopic analysis of mineral growth and \"desert cement,\" Wolter provides hard evidence that challenges the traditional narrative of who reached America first. \n\nYou can now become a History Hit member right here on YouTube! Join for access to a new exclusive documentary every week, and access to over 160+ of our documentaries presented by world renowned historians like Dan Snow, Eleanor Janega, Tristan Hughes, Mary Beard, Matt Lewis and more.\nGet an exclusive release every week by signing up here: https://bit.ly/4pyExyn\n\nThis channel is part of the History Hit Network. Any queries, please contact owned-enquiries@littledotstudios.com</article>","contentLength":986,"flags":null,"enclosureUrl":"https://www.youtube.com/v/z7xUD9_s1WI?version=3","enclosureMime":"","commentsUrl":null},{"title":"Is Gavin Newsom Eyeing the White House?","url":"https://www.youtube.com/shorts/l3zpyMdmu1M","date":1770922850,"author":"Bloomberg Originals","guid":24,"unread":true,"content":"<article>The California governor and First Partner share what they tells their kids when they ask about a 2028 presidential run. Watch The Circuit with Emily Chang.\n\n--------\nLike this video? Subscribe: http://www.youtube.com/Bloomberg?sub_confirmation=1\n\nGet unlimited access to Bloomberg.com for just $1.99 your first month: https://www.bloomberg.com/subscriptions?in_source=YoutubeOriginals\nBloomberg Originals offers bold takes for curious minds on today’s biggest topics. Hosted by experts covering stories you haven’t seen and viewpoints you haven’t heard, you’ll discover cinematic, data-led shows that investigate the intersection of business and culture. Exploring every angle of climate change, technology, finance, sports and beyond, Bloomberg Originals is business as you’ve never seen it. \n\nSubscribe for business news, but not as you've known it: exclusive interviews, fascinating profiles, data-driven analysis, and the latest in tech innovation from around the world.\n\nVisit our partner channel Bloomberg News for global news and insight in an instant.</article>","contentLength":1069,"flags":null,"enclosureUrl":"https://www.youtube.com/v/l3zpyMdmu1M?version=3","enclosureMime":"","commentsUrl":null},{"title":"The Race to Capture an Erupting Volcano (Part 2) | Spectacular Earth | BBC Earth Science","url":"https://www.youtube.com/watch?v=oB0B2kWq9mc","date":1770922847,"author":"BBC Earth Science","guid":692,"unread":true,"content":"<article>Duncan and his expert team get to the final part of their mission as they wait for Guatemala's Volcán de Fuego to erupt - all while trying to get a precision drone to capture the footage.\n\nBest of Earth Science: http://bit.ly/EarthLabOriginals \nBest of BBC Earth: http://bit.ly/TheBestOfBBCEarthVideos \n\nTaken from: Spectacular Earth (2022)\n\nThis is a channel from BBC Studios who help fund new BBC programmes. Service information and feedback: http://bbcworldwide.com/vod-feedback--contact-details.aspx</article>","contentLength":504,"flags":null,"enclosureUrl":"https://www.youtube.com/v/oB0B2kWq9mc?version=3","enclosureMime":"","commentsUrl":null},{"title":"WW2 Historian Explains Bloody Final Days of the War in Europe","url":"https://www.youtube.com/watch?v=pun2Xy0W-Hc","date":1770922800,"author":"History Hit","guid":711,"unread":true,"content":"<article>Just how brutal was the Soviet Advance on Berlin?\n\nDan Snow and military historian Sir Antony Beevor present the gripping account of the Battle of Berlin, the final, bloody chapter of World War Two in Europe. The pair discuss Joseph Stalin's secret plan to seize the city and its nuclear secrets while deceiving his Western Allies.\n\n00:00:00 intro\n00:01:34 Spring 1945\n00:02:51 Target Berlin\n00:03:40 Stalin’s Ambitions \n00:04:14 Soviet Advance \n00:05:31 Soviet Forces Breakdown \n00:06:42 Hitler’s Determination &amp; State of German Forces \n00:07:55 April 1945 Soviet Advance on Germany \n00:10:15 American and British Advance \n00:14:00 Distrust Amongst Allies \n00:15:18 The Battle for the Seelow Heights \n00:18:30 Stalin's Plan, Encirclement of Berlin \n00:18:54 State of Adolf Hitler\n00:20:30 Hitler’s Inner Circle \n00:22:05 Dying Moments of the Nazi Party \n00:22:50 SS Orgy \n00:24:18 Soviets March on Berlin &amp; German Defence \n00:25:24 Hitler’s Final Day\n00:26:00 German Civilians &amp; Hitler’s Nero Order \n00:27:50 Soviets in Berlin, Street Fighting \n00:30:30 French SS &amp; Capture of Reichstag\n00:33:00 Soviet Violence in Berlin \n00:35:00 Hitler’s Suicide &amp; Surrender \n00:36:50 Soviet Casualties \n00:38:00 Importance of Berlin \n\nFrom the colossal artillery battle at the Seelow Heights to the brutal street fighting in the city, this is the definitive story of the Third Reich's collapse.\n\nYou can now become a History Hit member right here on YouTube! Join for access to a new exclusive documentary every week, and access to over 160+ of our documentaries presented by world-renowned historians like Dan Snow, Eleanor Janega, Tristan Hughes, Mary Beard, Matt Lewis and more.\n\nGet an exclusive release every week by signing up here: https://www.youtube.com/channel/UCZwU2G-KVl-P-O-B35chZOQ/join\n\n#worldwartwo #battleofberlin #1945</article>","contentLength":1836,"flags":null,"enclosureUrl":"https://www.youtube.com/v/pun2Xy0W-Hc?version=3","enclosureMime":"","commentsUrl":null},{"title":"Illinois Gov. JB Pritzker encourages people to protest ICE #shorts","url":"https://www.youtube.com/shorts/WPHK9KZLBfw","date":1770919264,"author":"Vox","guid":78,"unread":true,"content":"<article>“They’re shooting moms in the face.” \n\nIllinois Gov. JB Pritzker told Vox’s Astead Herndon that peaceful protesting is the “least” people can do as ICE maintains a presence in Chicago. \nYou can watch their full interview on Saturday, here on YouTube.\n\nSubscribe to our channel and turn on notifications (🔔) so you don't miss any videos: http://goo.gl/0bsAjO\n\nVox.com is a news website that helps you cut through the noise and understand what's really driving the events in the headlines. Check out http://www.vox.com.\n\nWatch our full video catalog: http://goo.gl/IZONyE\nFollow Vox on TikTok: http://tiktok.com/@voxdotcom\nCheck out our articles: https://www.vox.com/\nListen to our podcasts: https://www.vox.com/podcasts</article>","contentLength":733,"flags":null,"enclosureUrl":"https://www.youtube.com/v/WPHK9KZLBfw?version=3","enclosureMime":"","commentsUrl":null},{"title":"Liberland: Crypto paradise or libertarian illusion? | DW Documentary","url":"https://www.youtube.com/watch?v=z5yln5Z5azs","date":1770915696,"author":"DW Documentary","guid":11,"unread":true,"content":"<article>Liberland is a country that doesn’t officially exist. A country that promises voluntary taxes and a lean state. It’s a libertarian utopia that’s finding more supporters worldwide.\n\nAfter the Yugoslav Wars, the border between Serbia and Croatia along the Danube river remained unresolved. Vit Jedlička, a former politician from the Czech Republic, took advantage of this situation. He proclaimed the \"Free Republic of Liberland” on a seven-square-kilometer piece of land in 2015. \nLiberland is not internationally recognized, and its president is not allowed to set foot on the soil of his republic. Croatia sees the founding of Liberland as an attack on its territorial integrity.\nThe film accompanies Samuela Davidova, influencer, crypto enthusiast, and spokesperson for Liberland, and Liberland‘s president, Vit Jedlička, on a journey into two very different worlds. \nOn the one hand, they travel to Dubai, a glittering metropolitan meeting place for crypto-enthusiastic elites. Here, they want to recruit investors — and new citizens. \nAnd on the other hand, they travel to \"Ark Village,” the base camp of the Liberland community on Serbian soil. Here, they celebrate the 10th anniversary of Liberland.\nThe highlight of the journey is a boat trip to the shores of Liberland. Liberland claims to function as a meritocracy: taxes are voluntary, but those who invest more have a greater say. \nThe Liberland experiment may seem like an oddity, but it also raises serious questions: Cryptocurrencies and decentralized networks are undermining traditional national borders, and radical market ideas are gaining influence. Parallel structures are emerging. Critics see them as a threat to democracy. Others, of course, sense opportunity. \n\n#documentary #dwdocumentary #dwdocs #liberland #crypto #cryptocurrency \n______\n\nDW Documentary gives you knowledge beyond the headlines. Watch top documentaries from German broadcasters and international production companies. Meet intriguing people, travel to distant lands, get a look behind the complexities of daily life and build a deeper understanding of current affairs and global events. Subscribe and explore the world around you with DW Documentary.\n\nSubscribe to: ‬\n⮞ DW Documentary (English): https://www.youtube.com/@DWDocumentary \n⮞ DW Documental (Spanish): https://www.youtube.com/@DWDocumental \n⮞ DW Documentary وثائقية دي دبليو (Arabic): https://www.youtube.com/@dwdocarabia\n⮞ DW Documentary हिन्दी (Hindi): https://www.youtube.com/@dwdochindi\n⮞ DW Dokumenter (Indonesian): https://www.youtube.com/@DWDokumenter\n⮞ DW Doku (German): https://www.youtube.com/@dwdoku\n\nFor more visit: http://www.dw.com/en/tv/docfilm/s-3610\nFollow DW Documentary on Instagram: https://www.instagram.com/dwdocumentary/\nFollow DW Documental on Facebook: https://www.facebook.com/dwdocumental\n\nWe kindly ask viewers to read and stick to the DW netiquette policy on our channel: https://p.dw.com/p/MF1G</article>","contentLength":2985,"flags":null,"enclosureUrl":"https://www.youtube.com/v/z5yln5Z5azs?version=3","enclosureMime":"","commentsUrl":null},{"title":"James Brown’s “Please Please Please” 🎙️ #musichistory","url":"https://www.youtube.com/shorts/WNrQ2_JqwSk","date":1770915661,"author":"PBS","guid":127,"unread":true,"content":"<article>Witness James Brown bring gospel fire to the secular stage, transforming a simple \"Please Please Please\" into a moment of pure ecstasy. Feel the raw power of his performance 🎤 Learn more about James Brown's early years in \"King of Them All: The Story of King Records\", now streaming on the PBS app!\n\n #JamesBrown #KingofThemAll #Gospel #LivePerformance  \n\nMade possible by viewers like you. Support your local PBS station: https://www.pbs.org/donate\n\nEnjoy full episodes of your favorite PBS shows anytime, anywhere with the free PBS app!\n\nKing of Them All: The Story of King Records\nFrom James Brown’s soul to the Stanley Brothers’ bluegrass, Cincinnati's King Records shaped genres that still echo today. Guided by voices like Seymour Stein, Vince Gill, and Christian McBride, the film restores a lost legacy.</article>","contentLength":818,"flags":null,"enclosureUrl":"https://www.youtube.com/v/WNrQ2_JqwSk?version=3","enclosureMime":"","commentsUrl":null},{"title":"The Responsibility of Producing Media","url":"https://www.youtube.com/shorts/X2Pn8rM7MRU","date":1770915658,"author":"Horses","guid":113,"unread":true,"content":"<article>Find more at: ⁠https://horses.land</article>","contentLength":36,"flags":null,"enclosureUrl":"https://www.youtube.com/v/X2Pn8rM7MRU?version=3","enclosureMime":"","commentsUrl":null},{"title":"3 things that can cause painful periods - Chen X. Chen","url":"https://www.youtube.com/watch?v=NOaeKRft-gc","date":1770912033,"author":"TED-Ed","guid":151,"unread":true,"content":"<article>Dig into the science of what makes period cramps so painful, and find out what we still don’t know about this common experience.\n\n--\n\nPeriod pain affects hundreds of millions of people. Anywhere from 50 to 90% of people who menstruate deal with painful abdominal or pelvic cramps during their period. Individual experiences can vary, from mild discomfort, to throbbing aches, to contraction-like cramps that rival the pain of labor. So, why do menstrual cramps hurt so much? Chen X. Chen explains this surprisingly common experience.\n\nLesson by Chen X. Chen, directed by Caitlin McCarthy.\n\nSupport Our Non-Profit Mission\n----------------------------------------------\nSupport us on Patreon: http://bit.ly/TEDEdPatreon\nCheck out our merch: http://bit.ly/TEDEDShop\n----------------------------------------------\n\nConnect With Us\n----------------------------------------------\nSign up for our newsletter: http://bit.ly/TEDEdNewsletter\nFollow us on Facebook: http://bit.ly/TEDEdFacebook\nFind us on Twitter: http://bit.ly/TEDEdTwitter\nPeep us on Instagram: http://bit.ly/TEDEdInstagram\n----------------------------------------------\n\nKeep Learning\n----------------------------------------------\nView full lesson: https://ed.ted.com/lessons/3-things-that-cause-painful-periods-chen-x-chen\nDig deeper with additional resources: https://ed.ted.com/lessons/3-things-that-cause-painful-periods-chen-x-chen/digdeeper\n\nAnimator's website: https://www.strangebeast.tv/directors/caitlin-mccarthy\nMusic: https://www.workplaywork.com\n----------------------------------------------\n\nThank you so much to our patrons for your support! Without you this video would not be possible! Jay M, Constantino Victor Delgado, Andrea Galvagni, Andrew Tweddle, Laurel-Ann Rice, Fernando A. Endo, Helen Lee, pam morgan, sarim haq, Gerardo Castro, Michel-Ange Hortegat, Enes Kirimi, Amaury BISIAUX, ND, Samyogita Hardikar, Vanessa Graulich, Vandana Gunwani, Abdulmohsin Almadi, AJ Lyon, Geoffrey Bultitude, Mi Mi, Thomas Rothert, Brian Elieson, Oge O, Weronika Falkowska, Nevin Spoljaric, Sid Chanpuriya, Anoop Varghese, David Yastremski, Noah Webb, Roberto Chena, Oliver Koo, Luke Pisano, Andrea Gordon, Aleksandar Donev, Nicole Klau Ibarra, Jesse Lira, Ezekiel Raui, Petr Vacek, Dennis, Olivia Fu, Kari Teffeau, Cindy Lai, Rajath Durgada Manjunath, Dan Nguyen, Chin Beng Tan, Tom Boman, Karen Warner, Iryna Panasiuk, and Aaron Torres.</article>","contentLength":2406,"flags":null,"enclosureUrl":"https://www.youtube.com/v/NOaeKRft-gc?version=3","enclosureMime":"","commentsUrl":null},{"title":"Rubber used to be useless…","url":"https://www.youtube.com/shorts/Bl0WZvAeDik","date":1770908533,"author":"Veritasium","guid":90,"unread":true,"content":"<article>Watch the full video here: https://youtu.be/AFXLZ7FEJc4?si=OaiAz42CzKGSPOYh\n\nWritten by Sulli Yost and @casper_mebius\n\nProduced and Directed by Sulli Yost\n\nHosted by Derek Muller and @henry.vandyck\n\n#science  #veritasium  #physics  #engineering  #experiment</article>","contentLength":257,"flags":null,"enclosureUrl":"https://www.youtube.com/v/Bl0WZvAeDik?version=3","enclosureMime":"","commentsUrl":null},{"title":"Inside Malaysia’s Controversial Anti-Corruption Commission","url":"https://www.youtube.com/shorts/bxjhskwx9YE","date":1770907032,"author":"Bloomberg Originals","guid":23,"unread":true,"content":"<article>The Malaysian Anti-Corruption Commission was set up to fight graft. Now some of its members have been accused of the very wrongdoing they are meant to stop, allegedly helping a group of businessmen seize control of companies. \n\nQuestions about the commission’s conduct go all the way to the top.&nbsp; \n\nWatch the full story\n\n--------\nLike this video? Subscribe: http://www.youtube.com/Bloomberg?sub_confirmation=1\n\nGet unlimited access to Bloomberg.com for just $1.99 your first month: https://www.bloomberg.com/subscriptions?in_source=YoutubeOriginals\nBloomberg Originals offers bold takes for curious minds on today’s biggest topics. Hosted by experts covering stories you haven’t seen and viewpoints you haven’t heard, you’ll discover cinematic, data-led shows that investigate the intersection of business and culture. Exploring every angle of climate change, technology, finance, sports and beyond, Bloomberg Originals is business as you’ve never seen it. \n\nSubscribe for business news, but not as you've known it: exclusive interviews, fascinating profiles, data-driven analysis, and the latest in tech innovation from around the world.\n\nVisit our partner channel Bloomberg News for global news and insight in an instant.</article>","contentLength":1236,"flags":null,"enclosureUrl":"https://www.youtube.com/v/bxjhskwx9YE?version=3","enclosureMime":"","commentsUrl":null},{"title":"After Q-Day: Quantum Applications at Scale • Matthew Keesan • YOW! 2025","url":"https://www.youtube.com/watch?v=oE9dGufCxoo","date":1770901291,"author":"GOTO Conferences","guid":164,"unread":true,"content":"<article>This presentation was recorded at YOW! Australia 2025. #GOTOcon #YOW\nhttps://yowcon.com\n\nMatthew Keesan - VP &amp; GM at IonQ\n\nRESOURCES\nhttps://twitter.com/keesan\nhttps://github.com/mjk\nhttps://www.linkedin.com/in/keesan\nhttps://www.keesan.net\n\nLinks\nhttps://plus.maths.org/content/hypersphere-in-4D\nhttps://iontrap.duke.edu/2021/10/19/fault-tolerant-operation-of-a-quantum-error-correction-code\nhttps://www.csiro.au/en/news/All/News/2025/October/Breakthrough-quantum-secure-link-protects-data-using-the-laws-of-physics\nhttps://arxiv.org/abs/2504.08732\nhttps://arxiv.org/abs/2506.22408\nhttps://arxiv.org/abs/2503.13128\nhttps://www.scottaaronson.com/democritus\nhttps://github.com/Munich-Quantum-Software-Stack\nhttps://openqse.org\nhttps://unitary.foundation\n\nABSTRACT\nIn the span of one generation, quantum computers have gone from thought experiments to globally deployed commercial products on the verge of becoming a standard tool in high-performance computing (HPC).\n\nMuch early motivation in (and funding for) developing practical quantum computers resulted from Peter Shor's discovery of an efficient quantum algorithm for factorization—thereby threatening the RSA encryption standard. If today's quantum computing manufacturers achieve their roadmaps, RSA-2048 will be broken within the next few years. Beyond a sea change for encrypted communications globally, this heralds the arrival of a new era of HPC workflows and the possibility of solving heretofore unsolvable problems.\n\nIn this talk, we will discuss the current state of research into what applications might come online first, the nascent ecosystems for delivering them, and the call to action to all developers to prepare for Q-Day and beyond! [...]\n\nTIMECODES\n00:00 Intro\n00:56 What is Q-Day?\n01:18 What is quantum computing?\n09:05 How to start worrying about Q-day\n20:01 Complexity theory in 100 seconds\n20:48 BQP: Bounded-error quantum polynomial time\n27:53 Part 1: Quantum AI\n30:16 Part 2: Quantum chemistry &amp; materials science\n33:20 Part 3: Modeling &amp; simulation\n34:05 Part 4: You?\n37:45 Outro\n\nRead the full abstract here:\nhttps://yowcon.com/brisbane-2025/sessions/3916\n\nRECOMMENDED BOOKS\nScott Aaronson • Quantum Computing Since Democritus • https://amzn.to/3kSH0nG\nJohan Vos • Quantum Computing in Action (available soon) • https://amzn.to/3oj7OQ6\nJack D. Hidary • Quantum Computing: An Applied Approach • https://amzn.to/3kdJ3CK\nSarah C. Kaiser &amp; Christopher Grenade • Learn Quantum Computing with Python and Q# • https://amzn.to/3CgL6f8\nVenkateswaran Kasirajan • Fundamentals of Quantum Computing • https://amzn.to/3nzk7aL\nBrian Clegg • Quantum Computing: The Transformative Technology of the Qubit Revolution • https://amzn.to/3AcdmiI\nWilliam (Chuck) Easttom • Quantum Computing Fundamentals • https://amzn.to/2ZzUUTy\nWolfgang Scherer • Mathematics of Quantum Computing • https://amzn.to/3CXYBRl\n\nhttps://bsky.app/profile/gotocon.com\nhttps://twitter.com/GOTOcon\nhttps://www.linkedin.com/company/goto-\nhttps://www.instagram.com/goto_con\nhttps://www.facebook.com/GOTOConferences\n#Quantum #QuantumComputing #QuantumComputer #QDay #QuantumAI #QC #Programming #Qubits #Qubit #QuantumAnnealing #QPU #HPC #BQP #BoundedErrorQuantumPolynomialTime #HighPerformanceComputing #DowlingNeven #Superconducting #ComplexityTheory #SoftwareEngineering #MatthewKeesan #YOWcon\n\nCHANNEL MEMBERSHIP BONUS\nJoin this channel to get early access to videos &amp; other perks:\nhttps://www.youtube.com/channel/UCs_tLP3AiwYKwdUHpltJPuA/join\n\nLooking for a unique learning experience?\nAttend the next GOTO conference near you! Get your ticket at https://gotopia.tech\nSign up for updates and specials at https://gotopia.tech/newsletter\n\nSUBSCRIBE TO OUR CHANNEL - new videos posted almost daily.\nhttps://www.youtube.com/user/GotoConferences/?sub_confirmation=1</article>","contentLength":3835,"flags":null,"enclosureUrl":"https://www.youtube.com/v/oE9dGufCxoo?version=3","enclosureMime":"","commentsUrl":null},{"title":"Mustang vs Thunderbolt - Pros and Cons","url":"https://www.youtube.com/shorts/Mnk50KYRKN4","date":1770897642,"author":"Imperial War Museums","guid":552,"unread":true,"content":"<article>#history #p51 #mustang #aviation #ww2planes</article>","contentLength":43,"flags":null,"enclosureUrl":"https://www.youtube.com/v/Mnk50KYRKN4?version=3","enclosureMime":"","commentsUrl":null},{"title":"Exhibiting WWII Arms (RA Winter Lecture)","url":"https://www.youtube.com/watch?v=54QKuEyxFLM","date":1770866101,"author":"Royal Armouries","guid":136,"unread":true,"content":"<article>How to exhibit arms: Weapons and technologies of the two World Wars in contemporary museums.\n\nSpeaker: Dr Stephan Jaeger, Professor of German Studies, University of Manitoba\n\nDiscover how the weapons of the two World Wars have been exhibited in contemporary museums in Europe and North America, highlighting military success and innovation, but also dehumanization and destruction.\n\nSubscribe to our channel for more videos about arms and armour  \n\nHelp us bring history to life by supporting us here: https://royalarmouries.org/support-us/donations/\n\nSign up to our museum membership scheme here: https://royalarmouries.org/support-us/membership/ \n\n⚔Website: https://royalarmouries.org/home\n⚔Blog: https://royalarmouries.org/stories/\n⚔Facebook: https://www.facebook.com/RoyalArmouriesMuseum/\n⚔Twitter: https://twitter.com/Royal_Armouries\n⚔ Instagram: http://instagram.com/royalarmouriesmuseum\n\nWe are the Royal Armouries, the United Kingdom's national collection of arms and armour. Discover what goes on behind the scenes and watch our collection come to life. See combat demonstrations, experience jousting and meet our experts. \n\nHave a question about arms and armour? Feel free to leave us a comment and we'll do our best to answer it.</article>","contentLength":1250,"flags":null,"enclosureUrl":"https://www.youtube.com/v/54QKuEyxFLM?version=3","enclosureMime":"","commentsUrl":null},{"title":"Inside The B-29 Superfortress: The Deadliest Bomber In History","url":"https://www.youtube.com/watch?v=n-Ko-gmxaPE","date":1770847258,"author":"Timeline - World History Documentaries","guid":495,"unread":true,"content":"<article>Discover the untold story of the United States Army Air Forces and their pivotal role in WW2. Using newly restored archival footage, we trace the journey from the desperate early days of the Pacific to the massive \"carpet bombing\" campaigns in Normandy. Witness the engineering marvel of the B-29 Superfortress, the grueling construction of airfields in China, and the strategic air battles that dismantled the Luftwaffe and the Japanese Empire. This is the definitive record of the men and machines that secured Allied air supremacy.\n\nYou can now become a History Hit member right here on YouTube! Join for access to a new exclusive documentary every week, and access to over 160+ of our documentaries presented by world renowned historians like Dan Snow, Eleanor Janega, Tristan Hughes, Mary Beard, Matt Lewis and more.\nGet an exclusive release every week by signing up here: https://bit.ly/4pyExyn\n\nThis channel is part of the History Hit Network. Any queries, please contact owned-enquiries@littledotstudios.com</article>","contentLength":1015,"flags":null,"enclosureUrl":"https://www.youtube.com/v/n-Ko-gmxaPE?version=3","enclosureMime":"","commentsUrl":null},{"title":"Inside Malaysia’s Controversial Anti-Corruption Commission | Bloomberg Investigates","url":"https://www.youtube.com/watch?v=pQ83FaJlGHo","date":1770847254,"author":"Bloomberg Originals","guid":22,"unread":true,"content":"<article>The Malaysian Anti-Corruption Commission was set up to fight graft. Now some of its members have been accused of the very wrongdoing they are meant to stop, allegedly helping a group of businessmen seize control of companies. Questions about the commission’s conduct go all the way to the top.  \n\nWho’s Watching Malaysia’s Anti-Corruption Watchdog?\nhttps://www.bloomberg.com/news/features/2026-02-11/malaysia-macc-allegedly-working-with-businessmen-to-seize-control-of-companies\n\nBloomberg Investigates is an award-winning series that sets out to uncover the truth behind some of the most powerful stories from around the world. Watch more: https://www.youtube.com/show/VLPLqq4LnWs3olVK53n-XDSRF10i6THmbCEx?sbp=QAE%3D\n\n#Malaysia #Corruption #Documentary\n\n--------\nLike this video? Subscribe: http://www.youtube.com/Bloomberg?sub_confirmation=1\n\nGet unlimited access to Bloomberg.com for just $1.99 your first month: https://www.bloomberg.com/subscriptions?in_source=YoutubeOriginals\nBloomberg Originals offers bold takes for curious minds on today’s biggest topics. Hosted by experts covering stories you haven’t seen and viewpoints you haven’t heard, you’ll discover cinematic, data-led shows that investigate the intersection of business and culture. Exploring every angle of climate change, technology, finance, sports and beyond, Bloomberg Originals is business as you’ve never seen it. \n\nSubscribe for business news, but not as you've known it: exclusive interviews, fascinating profiles, data-driven analysis, and the latest in tech innovation from around the world.\n\nVisit our partner channel Bloomberg News for global news and insight in an instant.</article>","contentLength":1673,"flags":null,"enclosureUrl":"https://www.youtube.com/v/pQ83FaJlGHo?version=3","enclosureMime":"","commentsUrl":null}],"tags":["yt"]}