{"id":"5uuu2QCw34EwQn","title":"World News","displayTitle":"World News","url":"","feedLink":"","isQuery":true,"isEmpty":false,"isHidden":false,"itemCount":44,"items":[{"title":"Netanyahu says US deal with Iran must dismantle nuclear infrastructure","url":"https://www.youtube.com/watch?v=qYmVM5Q9eDc","date":1771199764,"author":"Reuters","guid":633,"unread":true,"content":"<article>Israeli Prime Minister Benjamin Netanyahu said he told US President Trump that any US deal with Iran must include the dismantling of Iran's nuclear infrastructure, not just stopping the enrichment process.\n#News #Reuters #Newsfeed #netanyahu #trump #iran \n\nRead the story here: https://reut.rs/4rm1wNB\n\n👉  Subscribe: http://smarturl.it/reuterssubscribe\n\nKeep up with the latest news from around the world: https://www.reuters.com/\nFollow Reuters on Facebook: https://www.facebook.com/Reuters\nFollow Reuters on Twitter: https://twitter.com/Reuters\nFollow Reuters on Instagram: https://www.instagram.com/reuters/?hl=en</article>","contentLength":619,"flags":null,"enclosureUrl":"https://www.youtube.com/v/qYmVM5Q9eDc?version=3","enclosureMime":"","commentsUrl":null},{"title":"US does not dispute Europeans' Navalny poisoning assessment, says Rubio","url":"https://www.youtube.com/watch?v=lkw3sT8Sohw","date":1771190379,"author":"Reuters","guid":632,"unread":true,"content":"<article>US Secretary of State Marco Rubio called a report by European allies blaming Russia for killing late Kremlin critic Alexei Navalny using toxin from poison dart frogs ‘troubling,’ but said the US does not dispute.\n#News #Reuters #Newsfeed #rubio #navalny \n\nRead the story here: https://reut.rs/4rl7nTi\n\n👉  Subscribe: http://smarturl.it/reuterssubscribe\n\nKeep up with the latest news from around the world: https://www.reuters.com/\nFollow Reuters on Facebook: https://www.facebook.com/Reuters\nFollow Reuters on Twitter: https://twitter.com/Reuters\nFollow Reuters on Instagram: https://www.instagram.com/reuters/?hl=en</article>","contentLength":622,"flags":null,"enclosureUrl":"https://www.youtube.com/v/lkw3sT8Sohw?version=3","enclosureMime":"","commentsUrl":null},{"title":"Ukrainian anti-graft authorities detain ex-minister in major case","url":"https://www.youtube.com/watch?v=ZWQrTm6stHw","date":1771187909,"author":"Reuters","guid":631,"unread":true,"content":"<article>Ukrainian anti-corruption detectives detained a former energy minister as part of a wide-ranging probe that sparked a political crisis last November over high-level graft.\n#News #Reuters #Newsfeed #anticorruption #ukraine \n\nRead the story here: https://reut.rs/3MKHs8k\n\n👉  Subscribe: http://smarturl.it/reuterssubscribe\n\nKeep up with the latest news from around the world: https://www.reuters.com/\nFollow Reuters on Facebook: https://www.facebook.com/Reuters\nFollow Reuters on Twitter: https://twitter.com/Reuters\nFollow Reuters on Instagram: https://www.instagram.com/reuters/?hl=en</article>","contentLength":586,"flags":null,"enclosureUrl":"https://www.youtube.com/v/ZWQrTm6stHw?version=3","enclosureMime":"","commentsUrl":null},{"title":"Canadian passport holders can travel to China visa-free starting this week","url":"https://www.cbc.ca/news/politics/china-canada-visa-travel-9.7091435","date":1771181971,"author":"/u/Puginator","guid":356,"unread":true,"content":"<p>Canadian passport holders can travel to China visa-free starting Tuesday until the end of 2026, a spokesperson for China's Foreign Affairs Ministry announced Sunday — marking another step in Canada's thawing relationship with the Chinese government.</p><p>In a statement posted to the <a href=\"https://www.fmprc.gov.cn/mfa_eng/xw/fyrbt/202602/t20260215_11860467.html\" target=\"_blank\"><u>Chinese ministry's website</u></a>, the spokesperson said Canadian passport holders will be \"exempted from visa to enter China and stay for up to 30 days for business, tourism, family/friends visit, exchange and transit purposes.\"</p><p>\"The policy will be effective until December 31, 2026,\" the spokesperson said. The policy also applies to U.K. passport holders.</p><p>Foreign Affairs Minister Anita Anand <a href=\"https://x.com/AnitaAnandMP/status/2023090769095991543\">confirmed the policy on social media</a> and said the change is making \"travel easier, supporting business exchanges, and strengthening people-to-people ties between our countries.\"</p><p>The idea of Canadian visa-free travel to China was first mentioned in January after Prime Minister Mark Carney visited Beijing and met President Xi Jinping.</p><div><em><strong>WATCH | PM Mark Carney meets Chinese President Xi Jinping in Beijing:</strong></em></div><p>A <a href=\"https://www.pm.gc.ca/en/news/news-releases/2026/01/16/prime-minister-carney-forges-new-strategic-partnership-peoples\" target=\"_blank\"><u>statement from Carney's office</u></a> at the time mentioned that the prime minister \"welcomed [the president's] commitment to introducing visa-free access for Canadians travelling to China.\"</p><p>For most Canadian tourists, entering China currently requires a lengthy application process and roughly $140 in fees. China has dropped visa requirements for other Western nations in recent years as it tries to boost tourism following the COVID-19 pandemic.</p><p>Beijing maintained a visa for Canadians and restricted how many Chinese tourism groups could visit Canada during a years-long diplomatic spat.</p>","contentLength":1653,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1r5mswg/canadian_passport_holders_can_travel_to_china/"},{"title":"Hungarian opposition leader Magyar vows to pull Hungary back toward the West in campaign launch","url":"https://apnews.com/article/hungary-opposition-campaign-orban-f4e2d7a7cc73a19cc0dbb18a7286835d","date":1771181784,"author":"/u/stammerton","guid":362,"unread":true,"content":"<p>BUDAPEST, Hungary (AP) — Hungarian opposition leader Péter Magyar launched his party’s election campaign in Budapest on Sunday, vowing to restore Hungary’s Western orientation just eight weeks before he faces Prime Minister Viktor Orbán in a pivotal vote. </p><p>Magyar, a former insider in Orbán’s nationalist Fidesz party,  in 2024 after breaking with his political community and quickly forming the center-right Tisza party. </p><p>After taking around  in June 2024, he has grown Tisza into the most formidable political force Orbán has faced during his 16 years at Hungary’s helm. Most independent polls show Tisza with a significant lead before the April 12 vote, an advantage which has held steady for more than a year. </p><p>“We’re standing on the threshold of victory with 56 days left to go,” he told supporters during his speech at an exposition center in Budapest on Sunday. “Tisza stands ready to govern.” </p><p>Magyar has  across Hungary’s rural, conservative heartland — traditionally an Orbán stronghold — holding rallies and town hall events in scores of villages and towns. He has focused on bread and butter issues such as low wages and rapidly rising living costs that have made Hungary one of the poorest countries in the European Union. </p><p>Magyar accuses Orbán and his government of mismanaging Hungary’s economy and social services, and overseeing unchecked corruption he says has led to the accumulation of extreme wealth within a small circle of well-connected insiders while leaving ordinary Hungarians behind. </p><p>He has also criticized Orbán for conducting a combative foreign policy with the EU while maintaining close ties to Russia despite its war in neighboring Ukraine. </p><p>“Hungary’s place is in Europe, not only because Hungary needs Europe, but also because Europe needs Hungary,” he said. </p><p>Magyar’s comments contrasted starkly with statements Orbán made a day earlier at his own campaign launch, where  was not military aggression from Russia, but the European Union. </p><p>In a 239-page program released last week, Tisza outlined its plans for how it would govern Hungary if it wins April’s elections. Fidesz has not released a program, arguing that after governing for 16 years, its voters know what kinds of policies to expect. </p><p>On Sunday, Magyar reiterated that his party plans to retain a fence Orbán’s government built along the country’s southern border in 2015, and said he would maintain Fidesz’s policies of opposing illegal immigration and any accelerated procedure for Ukraine to join the EU. </p><p>However, Magyar has vowed to bring home billions in funding the EU has  over its concerns that Orbán has eroded democratic institutions, reduced judicial independence and failed to tackle corruption. </p><p>The program also pledges to fulfill conditions for adopting the euro currency by 2030, and to invest in Hungary’s faltering state health care and public transportation sectors. Tisza also plans to crack down on corruption and recover public funds it argues have been funneled into the hands of government-connected oligarchs.</p><p>“It is time to call corruption what it is: theft,” Magyar said Sunday.</p><p>For its candidates in each of Hungary’s 106 individual voting constituencies, Tisza has largely drawn on political neophytes locally active as entrepreneurs, doctors, economists, educators and other professionals. </p><p>Leading the ticket alongside Magyar are international energy expert Anita Orbán (no relation to the prime minister), whom the party tapped as its prospective foreign policy chief, and former Shell executive István Kapitány, who would fill a senior economy position in a future Tisza government. </p><p>Such candidates, Magyar has argued, will provide sectoral expertise he says is lacking under Orbán’s government, and will help rebuild relations with Western partners and end Hungary’s international isolation. </p><p>“I am proud that our experts are once again showing what it means to take the country’s fundamental issues seriously and to plan our shared future,” he said Sunday. “We don’t plan to dominate this country, but to serve it.”</p>","contentLength":4115,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1r5mq1j/hungarian_opposition_leader_magyar_vows_to_pull/"},{"title":"Russia’s Wagner Group pivots to European sabotage, say western officials","url":"https://www.ft.com/content/dbd1d803-ab37-43f1-920f-fce74952313a","date":1771180985,"author":"/u/homeinthecity","guid":363,"unread":true,"content":"<div aria-hidden=\"true\" data-offer-type=\"print\"><ul></ul></div>","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1r5mdt6/russias_wagner_group_pivots_to_european_sabotage/"},{"title":"China has planted so many trees around the Taklamakan Desert that it's turned this 'biological void' into a carbon sink","url":"https://www.livescience.com/planet-earth/plants/china-has-planted-so-many-trees-around-the-taklamakan-desert-that-its-turned-this-biological-void-into-a-carbon-sink","date":1771175973,"author":"/u/liomenu","guid":360,"unread":true,"content":"<p>Mass tree planting in <a data-analytics-id=\"inline-link\" href=\"https://www.livescience.com/tag/china\" data-auto-tag-linker=\"true\" data-url=\"https://www.livescience.com/tag/china\" data-hl-processed=\"none\" data-mrf-recirculation=\"inline-link\" data-before-rewrite-localise=\"https://www.livescience.com/tag/china\">China</a> is turning one of the world's largest and driest deserts into a carbon sink, meaning it absorbs more carbon from the atmosphere than it emits, new research reveals.</p><p>The Taklamakan Desert (also spelled Taklimakan or Takla Makan) is slightly larger than Montana, stretching across about 130,000 square miles (337,000 square kilometers). It is encircled by high mountains, which block moist air from reaching the desert for most of the year, creating extremely arid conditions that are too harsh for most <a data-analytics-id=\"inline-link\" href=\"https://www.livescience.com/planet-earth/plants/plants-facts-about-our-oxygen-providers\" data-url=\"https://www.livescience.com/planet-earth/plants/plants-facts-about-our-oxygen-providers\" data-hl-processed=\"none\" data-mrf-recirculation=\"inline-link\" data-before-rewrite-localise=\"https://www.livescience.com/planet-earth/plants/plants-facts-about-our-oxygen-providers\"></a>.</p><p>\"We found, for the first time, that human-led intervention can effectively enhance carbon sequestration in even the most extreme arid landscapes, demonstrating the potential to transform a desert into a carbon sink and halt desertification,\" study co-author <a data-analytics-id=\"inline-link\" href=\"https://www.gps.caltech.edu/people/yuk-l-yung\" target=\"_blank\" data-url=\"https://www.gps.caltech.edu/people/yuk-l-yung\" referrerpolicy=\"no-referrer-when-downgrade\" data-hl-processed=\"none\" data-mrf-recirculation=\"inline-link\"></a>, a professor of planetary science at Caltech and a senior research scientist in <a data-analytics-id=\"inline-link\" href=\"https://www.livescience.com/tag/nasa\" data-auto-tag-linker=\"true\" data-url=\"https://www.livescience.com/tag/nasa\" data-hl-processed=\"none\" data-mrf-recirculation=\"inline-link\" data-before-rewrite-localise=\"https://www.livescience.com/tag/nasa\">NASA</a>'s Jet Propulsion Laboratory, told Live Science in an email.</p><p>Over 95% of the Taklamakan Desert is covered in shifting sand, meaning it has long been considered a \"biological void,\" according to the study. The desert has been growing since the 1950s, when China underwent massive urbanization and farmland expansion. This conversion of natural land created the conditions for more sandstorms, which, in general, blow away soil and deposit sand instead, causing land degradation and desertification.</p><p>In 1978, China implemented the Three-North Shelterbelt Program, a huge ecological engineering project intended to slow desertification. Also called the \"Great Green Wall,\" the project aimed to plant billions of trees around the margins of the Taklamakan and Gobi deserts by 2050. More than 66 billion trees have been planted in northern China to date, but experts <a data-analytics-id=\"inline-link\" href=\"https://doi.org/10.1016/j.jaridenv.2009.08.001\" target=\"_blank\" data-url=\"https://doi.org/10.1016/j.jaridenv.2009.08.001\" referrerpolicy=\"no-referrer-when-downgrade\" data-hl-processed=\"none\" data-mrf-recirculation=\"inline-link\"></a> whether the Great Green Wall has significantly reduced the frequency of sandstorms.</p><p>China finished encircling the Taklamakan Desert with vegetation in 2024, and researchers say the effort has stabilized sand dunes and <a data-analytics-id=\"inline-link\" href=\"https://www.reuters.com/world/china/china-completes-3000-km-green-belt-around-its-biggest-desert-state-media-says-2024-11-29/\" target=\"_blank\" data-url=\"https://www.reuters.com/world/china/china-completes-3000-km-green-belt-around-its-biggest-desert-state-media-says-2024-11-29/\" referrerpolicy=\"no-referrer-when-downgrade\" data-hl-processed=\"none\" data-mrf-recirculation=\"inline-link\"><u>grown forest cover in the country</u></a> from 10% of its area in 1949 to more than 25% today.</p><figure data-bordeaux-image-check=\"\"><figcaption itemprop=\"caption description\"></figcaption></figure><p>Now, scientists have found that sprawling vegetation in the Taklamakan Desert's periphery is absorbing more carbon dioxide (CO) from the atmosphere than the desert is releasing, meaning the Taklamakan may be transforming into a stable carbon sink.</p><p>The researchers analyzed ground observations of different vegetation-cover types, as well as satellite data showing precipitation, vegetation cover, <a data-analytics-id=\"inline-link\" href=\"https://www.livescience.com/51720-photosynthesis.html\" data-url=\"https://www.livescience.com/51720-photosynthesis.html\" data-hl-processed=\"none\" data-mrf-recirculation=\"inline-link\" data-before-rewrite-localise=\"https://www.livescience.com/51720-photosynthesis.html\"></a> and CO fluxes in the Taklamakan Desert over the past 25 years. They also used the National Oceanic and Atmospheric Administration's <a data-analytics-id=\"inline-link\" href=\"https://gml.noaa.gov/ccgg/carbontracker/\" target=\"_blank\" data-url=\"https://gml.noaa.gov/ccgg/carbontracker/\" referrerpolicy=\"no-referrer-when-downgrade\" data-hl-processed=\"none\" data-mrf-recirculation=\"inline-link\"></a>, which models CO sources and sinks globally, to bolster their findings.</p><p>The results, published Jan. 19 in the journal <a data-analytics-id=\"inline-link\" href=\"https://doi.org/10.1073/pnas.2523388123\" target=\"_blank\" data-url=\"https://doi.org/10.1073/pnas.2523388123\" referrerpolicy=\"no-referrer-when-downgrade\" data-hl-processed=\"none\" data-mrf-recirculation=\"inline-link\"></a>, show a long-term trend of expanding vegetation and rising CO uptake along the desert's edges that coincides both in time and space with the Great Green Wall.</p><figure data-bordeaux-image-check=\"\"><figcaption itemprop=\"caption description\"></figcaption></figure><p>Over the study period, precipitation during the Taklamakan Desert's wet season from July to September was 2.5 times higher than it was in the dry season, averaging about 0.6 inches (16 millimeters) per month. Precipitation enhanced vegetation cover, greenness and photosynthesis along the desert's margins, thereby lowering CO levels over the desert from 416 parts per million in the dry season to 413 ppm in the wet season.</p><p>Previous <a data-analytics-id=\"inline-link\" href=\"https://doi.org/10.1016/j.jenvman.2023.118416\" target=\"_blank\" data-url=\"https://doi.org/10.1016/j.jenvman.2023.118416\" referrerpolicy=\"no-referrer-when-downgrade\" data-hl-processed=\"none\" data-mrf-recirculation=\"inline-link\"></a><a data-analytics-id=\"inline-link\" href=\"https://doi.org/10.1016/j.scib.2019.12.022\" target=\"_blank\" data-url=\"https://doi.org/10.1016/j.scib.2019.12.022\" referrerpolicy=\"no-referrer-when-downgrade\" data-hl-processed=\"none\" data-mrf-recirculation=\"inline-link\"></a> that the Taklamakan Desert may be a carbon sink, but those studies focused on CO that is absorbed by the desert's sand. They also suggested that sand is not a stable carbon sink under <a data-analytics-id=\"inline-link\" href=\"https://www.livescience.com/planet-earth/climate-change/climate-change-facts-about-our-warming-planet\" data-url=\"https://www.livescience.com/planet-earth/climate-change/climate-change-facts-about-our-warming-planet\" data-hl-processed=\"none\" data-mrf-recirculation=\"inline-link\" data-before-rewrite-localise=\"https://www.livescience.com/planet-earth/climate-change/climate-change-facts-about-our-warming-planet\"></a>, because rising temperatures can cause air in the sand to expand, which releases extra CO.</p><p>\"Based on the results of this study, the Taklamakan Desert, although only around its rim, represents the first successful model demonstrating the possibility of transforming a desert into a carbon sink,\" Yung said.</p><p>The Great Green Wall's potential to slow desertification remains unclear, but its role as a carbon sink \"may serve as a valuable model for other desert regions,\" he added.</p><div><div><p>Noor, S., Jiang, X., Wang, X., Yang, J., Newman, S., Li, K., Li, L., Yu, L., Li, X., &amp; Yung, Y. L. (2026). Human-induced biospheric carbon sink: Impact from the Taklamakan Afforestation Project. <em>Proceedings of the National Academy of Sciences</em>, (4), e2523388123. <a href=\"https://doi.org/10.1073/pnas.2523388123\" target=\"_blank\" data-url=\"https://doi.org/10.1073/pnas.2523388123\" referrerpolicy=\"no-referrer-when-downgrade\" data-hl-processed=\"none\"><u>https://doi.org/10.1073/pnas.2523388123</u></a></p></div></div>","contentLength":4238,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1r5k7rv/china_has_planted_so_many_trees_around_the/"},{"title":"Starmer has grasped what his predecessors would not – that Britain is better off in Europe than with the US","url":"https://www.independent.co.uk/news/world/europe/starmer-nato-europe-us-trump-defence-ukraine-b2920255.html","date":1771175216,"author":"/u/rezwenn","guid":368,"unread":true,"content":"<p>There will be consternation in some quarters of the nation’s armed forces, particularly the Special Forces, but ending the junior partner status of <a href=\"https://www.independent.co.uk/topic/britain\">Britain</a> under the <a href=\"https://www.independent.co.uk/topic/us\">US</a> puts an end to the fantasy of the “special relationship”.</p><p>The PM has grasped a barbed wire nettle many of his predecessors could not even see when he stands up at the <a href=\"https://www.independent.co.uk/topic/munich-security-conference\">Munich Security Conference</a> to say: “There is no British security without Europe, and no European security without Britain. That is the lesson of history – and it is today’s reality too.” </p><p>He has insisted the US remains an indispensable ally. But he is now insisting that America is<a href=\"https://www.independent.co.uk/news/world/europe/munich-security-conference-2026-ukraine-europe-trump-russia-b2918260.html\"> no longer the only ally</a> and recognising that Washington is not even a reliable friend.</p><p>It has been a long time coming. But it has not always been the case.</p><p>Until the end of the Cold War, Britain and the US had a more equal partnership. It was underpinned by the Five Eyes intelligence-sharing relationship with Canada, New Zealand, Australia, the US and UK, but London showed fierce independence.</p><p>The UK stayed out of the Vietnam war. The US gave little to no support to Britain’s recapture of the Falkland Islands from Argentina in 1982. </p><p>When the US led a multinational UN-sanctioned mission to end warlordism and mass starvation in Somalia in 1992, France, Turkey, Morocco, Pakistan and numerous other nations joined a mission of noble intent. But not Britain.</p><p>In those days, it was recognised by a British defence attache in Washington, a major general, that the “special relationship is special to us but not to the Americans”.</p><p>“They’re polite and courtly and always seem to listen. Then they close the door behind us when we’ve gone and ignore what we said. It made us feel important but we mattered little to them,” he said before the UK joined the US in the ill-fated war in Iraq and the two-decade fiasco of Afghanistan.</p><p>In taking Britain into the Iraq war, the UK became a sub-unit of the US military and in the decade of the so-called war on terror that followed, that status was cemented by underfunding and overreliance on the equipment known as “enablers” – the satellite imagery, air transport and refuelling, and the logistics chains that the US leads the world in providing. </p><p>Then, last year, 80 years of assumptions about the UK’s future defences were upended by the Trump administration when the junior relationship was downgraded.</p><p>Writing on Substack this week, Tom Tugendhat, a Tory backbencher and former chair of the defence select committee (and former frontline intelligence officer), said: “British defence policy rested on four pillars. The assumption of automatic American support. The credibility of Nato as a guaranteed security provider. The stability of long-term defence planning. And the political consensus that defence could remain a secondary concern. Within the first fifty days of <a href=\"https://www.independent.co.uk/topic/donald-trump\">Donald Trump</a>’s return to the White House, all four were effectively dismantled.”</p><p>Britain’s Special Air Service and the Special Boat Service, each (officially) comprising four squadrons of tier 1 “operators”, are the only units with which the UK and US are on parity. The Americans have about the same number of their most highly trained soldiers. </p><p>For the last 25 years, they have worked hand in glove. Britain’s military reputation with the US has largely rested on this relationship; even though the UK lacked the specialist equipment and aircraft their cousins could call on, they enjoyed access to the very best kit through that relationship.</p><p>Elsewhere, the UK has fared less well from the relationship. In Iraq, American and Iraqi troops had to bail the British out of a disastrous campaign in Basra and the south of the country. In Helmand, embattled British-led troops in southern Afghanistan were again bailed out by a 30,000-person surge by US Marines.</p><p>For the Americans, it has been good to have the British along. Frontline soldiers deeply appreciated the panache and bravery of the UK’s fighting men and women. But they were never militarily necessary. </p><p>The British army, now around 72,000, is less than half the size of the US Marine Corps, 172,000. Active service personnel in the whole of the British armed forces are less than the marines can field – and on top of that, the marines have their own jets, transport, artillery and ships. They can operate with far greater direct punch and autonomy than the British. There are more of them, they have better equipment, and they’re all from the same unit.</p><p>The threat to the UK is from <a href=\"https://www.independent.co.uk/topic/russia\">Russia</a>. So it makes sense to concentrate military efforts and improve military capacity in Europe, and with European forces.</p><p>“We are not the Britain of the Brexit years any more. Because we know that, in dangerous times, we would not take control by turning inward – we would surrender it. And I won’t let that happen,” the prime minister said.</p><p>“I'm talking about a vision of European security and greater European autonomy that does not herald US withdrawal but answers the call for more burden sharing in full, and remakes the ties that have served us so well.”</p><p>He is right to argue that Europe and the UK need to invest in their own arms manufacturing capability and wean themselves off American-made equipment. A rapid end to duplication across the continent will be essential for the region to better cope with the autonomy that Trump is thrusting upon it with his threats against Greenland and his general contempt for Nato.</p><p>Britain’s Royal Navy is the most powerful in Europe, with two aircraft carriers and nuclear-powered submarines, with the total tonnage of vessels greater than the German, French and Italian navies combined. France has more people in its forces, around 200,000, and a larger army, but the UK has more specialised units focused on fast deployment. </p><p>Poland’s forces are fast-growing, with around 215,000 on active service, and it is arming at a staggering pace. Turkey is Nato’s second-largest force of about 440,000 after the US (1.3 million).</p><p>But in more directly working in Europe and as a European nation, the UK’s forces will have the opportunity to be the first among equals in cooperating over defending against a real and present danger in the Kremlin, and dealing with Moscow’s grey, or hybrid, war that’s already being fought across Europe.</p><p>They’ll be joined, no doubt, by <a href=\"https://www.independent.co.uk/topic/ukraine\">Ukraine</a>’s 800,000-plus battle-hardened veterans and Kyiv’s fast-growing military-industrial sector.</p><p>“We want to bring our leadership in defence, tech and AI together with Europe – to multiply our strengths and build a shared industrial base across Europe which can turbocharge our defence production,” Sir Keir said.</p><p>Trump has insisted that is what he wants to see. But when it starts to happen, an independent Europe will leave America much enfeebled.</p>","contentLength":6814,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1r5jvvn/starmer_has_grasped_what_his_predecessors_would/"},{"title":"TikTok Germany manipulation: 3M posts influencing minds, exposed","url":"https://cybernews.com/news/germany-tiktok-telegram-politics/","date":1771173334,"author":"/u/Wagamaga","guid":367,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1r5j2ub/tiktok_germany_manipulation_3m_posts_influencing/"},{"title":"US-Iran talks, Rubio and Draco Malfoy","url":"https://www.youtube.com/watch?v=qdv_auvrHpo","date":1771173012,"author":"Reuters","guid":630,"unread":true,"content":"<article>Iran signals flexibility ahead of Tuesday’s Geneva nuclear talks. Israeli strikes Gaza over alleged ceasefire violations ahead of U.S. President Donald Trump's Peace Board meeting. Designer Michael Kors celebrates the brand's 45th anniversary at New York Fashion Week with a celeb-packed audience. A Carnival tribute to Brazil's president sparks political backlash. Plus, Draco Malfoy becomes an unlikely Lunar New Year good‑luck icon in China.\n\n\n \n\n\nLearn more about your ad choices. Visit megaphone.fm/adchoices (https://megaphone.fm/adchoices)</article>","contentLength":550,"flags":null,"enclosureUrl":"https://www.youtube.com/v/qdv_auvrHpo?version=3","enclosureMime":"","commentsUrl":null},{"title":"US public transit is overpaying for buses #shorts #publictransport #transit #buses #funding","url":"https://www.youtube.com/shorts/eWnNIQXsT0k","date":1771171251,"author":"Bloomberg Television","guid":603,"unread":true,"content":"<article>Public transit is essential for millions of Americans, but the way buses are procured may be limiting how much service cities can afford. Harvard professor Ed Glaeser discusses the challenges on \"Wall Street Week.\" Tune in at 6 p.m. ET https://bloom.bg/4aBoTvr</article>","contentLength":260,"flags":null,"enclosureUrl":"https://www.youtube.com/v/eWnNIQXsT0k?version=3","enclosureMime":"","commentsUrl":null},{"title":"US Briefly Names Alibaba, Baidu as Firms Aiding China’s Military","url":"https://www.youtube.com/watch?v=kQkAVQuibXM","date":1771170218,"author":"Bloomberg Television","guid":602,"unread":true,"content":"<article>The Pentagon added&nbsp;Alibaba,&nbsp;BYD,&nbsp;Baidu&nbsp;and&nbsp;TP-Link Technologies Co.&nbsp;to a list of companies that aid the Chinese military – before withdrawing it minutes later without explanation. The moves on Friday roiled shares of the affected listed companies and left analysts wondering about the administration’s intentions. If the list is reposted, they said it would be a show of strength ahead of President&nbsp;Donald Trump’s expected trip to China and meeting with Chinese leader&nbsp;Xi Jinping&nbsp;in April. The&nbsp;updated list, which the US Federal Register a short while later declared “unpublished,” also removed two of China’s champions in production of memory chips,&nbsp;ChangXin Memory Technologies Inc.&nbsp;and&nbsp;Yangtze Memory Technologies Co.&nbsp;Asked about the notice, the Pentagon said in a statement to Bloomberg News that “we have nothing to announce at this time.” Bloomberg News Senior Editor for Technology &amp; Strategic Industries Michael Shepard joins Bloomberg Businessweek Daily to discuss. He speaks with Carol Massar and Tim Stenovec.\n--------\nWatch Bloomberg Radio LIVE on YouTube\nWeekdays 7am-6pm ET\nWATCH HERE: http://bit.ly/3vTiACF\n \nFollow us on X: https://twitter.com/BloombergRadio\n\nSubscribe to our Podcasts:\n\n    Bloomberg Daybreak: http://bit.ly/3DWYoAN\n    Bloomberg Surveillance: http://bit.ly/3OPtReI\n    Bloomberg Intelligence: http://bit.ly/3YrBfOi\n    Balance of Power: http://bit.ly/3OO8eLC\n    Bloomberg Businessweek: http://bit.ly/3IPl60i\n\nListen on Apple CarPlay and Android Auto with the Bloomberg Business app:\nApple CarPlay: https://apple.co/486mghI\nAndroid Auto: https://bit.ly/49benZy\n \nVisit our YouTube channels:\nBloomberg Podcasts: https://www.youtube.com/bloombergpodcasts\nBloomberg Television: https://www.youtube.com/@markets\nBloomberg Originals: https://www.youtube.com/bloomberg\nQuicktake: https://www.youtube.com/@BloombergQuicktake</article>","contentLength":1882,"flags":null,"enclosureUrl":"https://www.youtube.com/v/kQkAVQuibXM?version=3","enclosureMime":"","commentsUrl":null},{"title":"Rubio Says US Wants Europe to Prosper, Alliance Is 'Critical'","url":"https://www.youtube.com/watch?v=m1lU8EXhrqI","date":1771170135,"author":"Bloomberg Television","guid":601,"unread":true,"content":"<article>Secretary of State Marco Rubio says that the US and Europe are bound together and that the alliance is \"critical.\" He made the comments during an interview with Bloomberg News Editor-in-Chief&nbsp;John Micklethwait on the sidelines of the Munich Security Conference. He also comments on Iran negotiations, Cuba and China.\n--------\nMore on Bloomberg Television and Markets\n \nLike this video? Subscribe and turn on notifications so you don't miss any videos from Bloomberg Markets &amp; Finance: https://tinyurl.com/ysu5b8a9\nVisit http://www.bloomberg.com for business news &amp; analysis, up-to-the-minute market data, features, profiles and more.\n \nConnect with Bloomberg Television on:\nX: https://twitter.com/BloombergTV\nFacebook: https://www.facebook.com/BloombergTelevision\nInstagram: https://www.instagram.com/bloombergtv/\n \nConnect with Bloomberg Business on:\nX: https://twitter.com/business\nFacebook: https://www.facebook.com/bloombergbusiness\nInstagram: https://www.instagram.com/bloombergbusiness/\nTikTok: https://www.tiktok.com/@bloombergbusiness?lang=en\nReddit: https://www.reddit.com/r/bloomberg/\nLinkedIn: https://www.linkedin.com/company/bloomberg-news/\n \nMore from Bloomberg:\nBloomberg Radio: https://twitter.com/BloombergRadio\n\nBloomberg Surveillance: https://twitter.com/bsurveillance\nBloomberg Politics: https://twitter.com/bpolitics\nBloomberg Originals: https://twitter.com/bbgoriginals\n \nWatch more on YouTube:\nBloomberg Technology: https://www.youtube.com/@BloombergTechnology\nBloomberg Originals: https://www.youtube.com/@business\nBloomberg Quicktake: https://www.youtube.com/@BloombergQuicktake\nBloomberg Espanol: https://www.youtube.com/@bloomberg_espanol\nBloomberg Podcasts: https://www.youtube.com/@BloombergPodcasts</article>","contentLength":1729,"flags":null,"enclosureUrl":"https://www.youtube.com/v/m1lU8EXhrqI?version=3","enclosureMime":"","commentsUrl":null},{"title":"Rubio Says Trump's Preference Is to Reach Deal With Iran","url":"https://www.youtube.com/watch?v=AhQ90ifuh6g","date":1771170042,"author":"Bloomberg Television","guid":600,"unread":true,"content":"<article>US Secretary of State Marco Rubio discusses the outlook for negotiations with Iran, telling Bloomberg News Editor-in-Chief&nbsp;John Micklethwait that President Donald Trump \"would always prefer to end problems with a deal.\" They speak on the sidelines of the Munich Security Conference.\n--------\nMore on Bloomberg Television and Markets\n \nLike this video? Subscribe and turn on notifications so you don't miss any videos from Bloomberg Markets &amp; Finance: https://tinyurl.com/ysu5b8a9\nVisit http://www.bloomberg.com for business news &amp; analysis, up-to-the-minute market data, features, profiles and more.\n \nConnect with Bloomberg Television on:\nX: https://twitter.com/BloombergTV\nFacebook: https://www.facebook.com/BloombergTelevision\nInstagram: https://www.instagram.com/bloombergtv/\n \nConnect with Bloomberg Business on:\nX: https://twitter.com/business\nFacebook: https://www.facebook.com/bloombergbusiness\nInstagram: https://www.instagram.com/bloombergbusiness/\nTikTok: https://www.tiktok.com/@bloombergbusiness?lang=en\nReddit: https://www.reddit.com/r/bloomberg/\nLinkedIn: https://www.linkedin.com/company/bloomberg-news/\n \nMore from Bloomberg:\nBloomberg Radio: https://twitter.com/BloombergRadio\n\nBloomberg Surveillance: https://twitter.com/bsurveillance\nBloomberg Politics: https://twitter.com/bpolitics\nBloomberg Originals: https://twitter.com/bbgoriginals\n \nWatch more on YouTube:\nBloomberg Technology: https://www.youtube.com/@BloombergTechnology\nBloomberg Originals: https://www.youtube.com/@business\nBloomberg Quicktake: https://www.youtube.com/@BloombergQuicktake\nBloomberg Espanol: https://www.youtube.com/@bloomberg_espanol\nBloomberg Podcasts: https://www.youtube.com/@BloombergPodcasts</article>","contentLength":1695,"flags":null,"enclosureUrl":"https://www.youtube.com/v/AhQ90ifuh6g?version=3","enclosureMime":"","commentsUrl":null},{"title":"Rubio begins Europe tour to bolster ties with pro-Trump leaders","url":"https://www.youtube.com/watch?v=GOKaP8qCDkw","date":1771169899,"author":"Reuters","guid":629,"unread":true,"content":"<article>Secretary of State Marco Rubio began a two-day trip to eastern Europe to bolster ties with Slovakia and Hungary, whose conservative leaders have warm ties with President Donald Trump.\n\n#News #Reuters #Newsfeed #world #USA #UnitedStates #MarcoRubio #Europe \n\nRead the story here: https://reut.rs/4qHOIj7\n\n👉  Subscribe: http://smarturl.it/reuterssubscribe\n\nKeep up with the latest news from around the world: https://www.reuters.com/\nFollow Reuters on Facebook: https://www.facebook.com/Reuters\nFollow Reuters on Twitter: https://twitter.com/Reuters\nFollow Reuters on Instagram: https://www.instagram.com/reuters/?hl=en</article>","contentLength":620,"flags":null,"enclosureUrl":"https://www.youtube.com/v/GOKaP8qCDkw?version=3","enclosureMime":"","commentsUrl":null},{"title":"Danish PM says Trump's desire to acquire Greenland hasn't changed","url":"https://www.youtube.com/watch?v=U6BnVsl1ZuI","date":1771168304,"author":"Reuters","guid":628,"unread":true,"content":"<article>Danish Prime Minister Mette Frederiksen and Greenlandic Prime Minister Jens-Frederik Nielsen criticized President Donald Trump's interest in owning Greenland during a panel on Arctic security at the Munich Security Conference.\n\n#News #Reuters #Newsfeed #world #Denmark #DonaldTrump #Greenland #JensFrederikNielsen\n\n👉  Subscribe: http://smarturl.it/reuterssubscribe\n\nKeep up with the latest news from around the world: https://www.reuters.com/\nFollow Reuters on Facebook: https://www.facebook.com/Reuters\nFollow Reuters on Twitter: https://twitter.com/Reuters\nFollow Reuters on Instagram: https://www.instagram.com/reuters/?hl=en</article>","contentLength":631,"flags":null,"enclosureUrl":"https://www.youtube.com/v/U6BnVsl1ZuI?version=3","enclosureMime":"","commentsUrl":null},{"title":"Why Your $3 Trader Joe's Tote Bag Is Now a Status Symbol","url":"https://www.youtube.com/shorts/wXBWScW92rg","date":1771167687,"author":"The Wall Street Journal","guid":648,"unread":true,"content":"<article>The Trader Joe’s tote, which sells for $2.99 in the U.S., has joined the ranks of geographically specific status bags like those from London’s Daunt Books or Paris’s Shakespeare and Company.⁠\n⁠\nBecause there are no Trader Joe’s stores abroad, the bags are listed on resale platforms like Depop, eBay and Korea’s Karrot market for up to $10,000—with some eBay listings reaching $50,000.⁠\n\n#TraderJoes #Grocery #WSJ</article>","contentLength":431,"flags":null,"enclosureUrl":"https://www.youtube.com/v/wXBWScW92rg?version=3","enclosureMime":"","commentsUrl":null},{"title":"Spend a day in Livigno","url":"https://www.youtube.com/shorts/mVIacwqAQvQ","date":1771167673,"author":"Reuters","guid":627,"unread":true,"content":"<article>Here’s a simple way to soak in the northern Italian town of Livigno during the Olympics when you want a break from the competition.\n \n#Travel #Italy #WinterOlympics #Coffee #MilanoCortina2026\n\n👉  Subscribe: http://smarturl.it/reuterssubscribe\n\nKeep up with the latest news from around the world: https://www.reuters.com/\nFollow Reuters on Facebook: https://www.facebook.com/Reuters\nFollow Reuters on Twitter: https://twitter.com/Reuters\nFollow Reuters on Instagram: https://www.instagram.com/reuters/?hl=en</article>","contentLength":511,"flags":null,"enclosureUrl":"https://www.youtube.com/v/mVIacwqAQvQ?version=3","enclosureMime":"","commentsUrl":null},{"title":"Who will survive and thrive in the new AI era?","url":"https://www.youtube.com/watch?v=NGV9OzduSSc","date":1771167640,"author":"Bloomberg Television","guid":599,"unread":true,"content":"<article>AI is already reshaping the value of human expertise, but its effects on workers aren’t predetermined. MIT professor David Autor says the key question isn’t what jobs can be automated, but which tasks within a job are automated and who benefits from that shift. In some cases, AI can increase wages and productivity; in others, it can lower barriers to entry, intensify competition and compress pay. Stanford professor Erik Brynjolfsson discusses whether AI will widen inequality or expand opportunity, and how policymakers can steer its development.\n--------\nMore on Bloomberg Television and Markets\n \nLike this video? Subscribe and turn on notifications so you don't miss any videos from Bloomberg Markets &amp; Finance: https://tinyurl.com/ysu5b8a9\nVisit http://www.bloomberg.com for business news &amp; analysis, up-to-the-minute market data, features, profiles and more.\n \nConnect with Bloomberg Television on:\nX: https://twitter.com/BloombergTV\nFacebook: https://www.facebook.com/BloombergTelevision\nInstagram: https://www.instagram.com/bloombergtv/\n \nConnect with Bloomberg Business on:\nX: https://twitter.com/business\nFacebook: https://www.facebook.com/bloombergbusiness\nInstagram: https://www.instagram.com/bloombergbusiness/\nTikTok: https://www.tiktok.com/@bloombergbusiness?lang=en\nReddit: https://www.reddit.com/r/bloomberg/\nLinkedIn: https://www.linkedin.com/company/bloomberg-news/\n \nMore from Bloomberg:\nBloomberg Radio: https://twitter.com/BloombergRadio\n\nBloomberg Surveillance: https://twitter.com/bsurveillance\nBloomberg Politics: https://twitter.com/bpolitics\nBloomberg Originals: https://twitter.com/bbgoriginals\n \nWatch more on YouTube:\nBloomberg Technology: https://www.youtube.com/@BloombergTechnology\nBloomberg Originals: https://www.youtube.com/@business\nBloomberg Quicktake: https://www.youtube.com/@BloombergQuicktake\nBloomberg Espanol: https://www.youtube.com/@bloomberg_espanol\nBloomberg Podcasts: https://www.youtube.com/@BloombergPodcasts</article>","contentLength":1966,"flags":null,"enclosureUrl":"https://www.youtube.com/v/NGV9OzduSSc?version=3","enclosureMime":"","commentsUrl":null},{"title":"Sober raves offer Pakistan's Gen Z a new kind of nightlife","url":"https://www.youtube.com/shorts/QeVmjGyRW08","date":1771167607,"author":"Reuters","guid":626,"unread":true,"content":"<article>Under neon lights at an indoor sports club in Karachi, twenty-somethings drifted between glowing courts and a DJ booth, dancing with coffee cups and iced tea in hand. No alcohol. No drugs. And the music ended promptly at 10 pm.\n\n#rave #pakistan #genz #nightlife #club</article>","contentLength":267,"flags":null,"enclosureUrl":"https://www.youtube.com/v/QeVmjGyRW08?version=3","enclosureMime":"","commentsUrl":null},{"title":"Outgoing Dutch Defense Secretary Tuinman: If the US blocks F-35 software updates, we will crack the code and do our own updates to make the plane fully European. I'm not allowed to say more","url":"https://www.bnr.nl/podcast/boekestijn-en-de-wijk/10594220/een-race-tegen-de-klok","date":1771166547,"author":"/u/goldstarflag","guid":371,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1r5ga51/outgoing_dutch_defense_secretary_tuinman_if_the/"},{"title":"Faster, Higher, Stronger—and Way More Fun. The Olympics Are Back. | WSJ","url":"https://www.youtube.com/shorts/CsHoK59XG-s","date":1771166054,"author":"The Wall Street Journal","guid":647,"unread":true,"content":"<article>The biggest comeback in Milan Cortina is the Olympics itself. WSJ’s Ben Cohen reports between the Games. \n\n#WSJ #olympics #Milan</article>","contentLength":130,"flags":null,"enclosureUrl":"https://www.youtube.com/v/CsHoK59XG-s?version=3","enclosureMime":"","commentsUrl":null},{"title":"CIA, Pentagon reviewed secret 'Havana syndrome' device in Norway, Washington Post reports","url":"https://www.reuters.com/business/healthcare-pharmaceuticals/cia-pentagon-reviewed-secret-havana-syndrome-device-norway-washington-post-2026-02-14/","date":1771162078,"author":"/u/Street_Anon","guid":358,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1r5emki/cia_pentagon_reviewed_secret_havana_syndrome/"},{"title":"Protests against Iran regime draw hundreds of thousands","url":"https://www.youtube.com/watch?v=tZj34Mu7muw","date":1771160760,"author":"Reuters","guid":625,"unread":true,"content":"<article>Huge crowds gathered in cities around the world to protest Iran’s government.\n\n#News #Reuters #Newsfeed #world #protests #Iran #regime #politics \n\n👉  Subscribe: http://smarturl.it/reuterssubscribe\n\nKeep up with the latest news from around the world: https://www.reuters.com/\nFollow Reuters on Facebook: https://www.facebook.com/Reuters\nFollow Reuters on Twitter: https://twitter.com/Reuters\nFollow Reuters on Instagram: https://www.instagram.com/reuters/?hl=en</article>","contentLength":465,"flags":null,"enclosureUrl":"https://www.youtube.com/v/tZj34Mu7muw?version=3","enclosureMime":"","commentsUrl":null},{"title":"How America Ended Up Paying So Much for Public Buses","url":"https://www.youtube.com/watch?v=qBUyayNaUBQ","date":1771160491,"author":"Bloomberg Television","guid":598,"unread":true,"content":"<article>Public transit is essential for millions of Americans, but the way buses are procured may be limiting how much service cities can afford. Harvard professor Ed Glaeser says agencies often order highly-customized buses in a market with shrinking competition, while federal funding rules shape how purchases are made. Transit executives argue that operating realities require flexibility, yet agree reform is needed. Could smarter procurement and more competition help cities get more buses for less money?\n--------\nMore on Bloomberg Television and Markets\n \nLike this video? Subscribe and turn on notifications so you don't miss any videos from Bloomberg Markets &amp; Finance: https://tinyurl.com/ysu5b8a9\nVisit http://www.bloomberg.com for business news &amp; analysis, up-to-the-minute market data, features, profiles and more.\n \nConnect with Bloomberg Television on:\nX: https://twitter.com/BloombergTV\nFacebook: https://www.facebook.com/BloombergTelevision\nInstagram: https://www.instagram.com/bloombergtv/\n \nConnect with Bloomberg Business on:\nX: https://twitter.com/business\nFacebook: https://www.facebook.com/bloombergbusiness\nInstagram: https://www.instagram.com/bloombergbusiness/\nTikTok: https://www.tiktok.com/@bloombergbusiness?lang=en\nReddit: https://www.reddit.com/r/bloomberg/\nLinkedIn: https://www.linkedin.com/company/bloomberg-news/\n \nMore from Bloomberg:\nBloomberg Radio: https://twitter.com/BloombergRadio\n\nBloomberg Surveillance: https://twitter.com/bsurveillance\nBloomberg Politics: https://twitter.com/bpolitics\nBloomberg Originals: https://twitter.com/bbgoriginals\n \nWatch more on YouTube:\nBloomberg Technology: https://www.youtube.com/@BloombergTechnology\nBloomberg Originals: https://www.youtube.com/@business\nBloomberg Quicktake: https://www.youtube.com/@BloombergQuicktake\nBloomberg Espanol: https://www.youtube.com/@bloomberg_espanol\nBloomberg Podcasts: https://www.youtube.com/@BloombergPodcasts</article>","contentLength":1915,"flags":null,"enclosureUrl":"https://www.youtube.com/v/qBUyayNaUBQ?version=3","enclosureMime":"","commentsUrl":null},{"title":"Protest in Mexico over murder of workers at Canadian-run mine","url":"https://www.youtube.com/watch?v=EZiIzFJkgRI","date":1771158875,"author":"Reuters","guid":624,"unread":true,"content":"<article>Miners, students and relatives of victims marched in Zacatecas, Mexico, to protest the abduction and murder of workers at a silver mine operated by Canada's Vizsla Silver Corp.\n\n#News #Reuters #Newsfeed #world #Americas #crime #Mexico #protest \n\n👉  Subscribe: http://smarturl.it/reuterssubscribe\n\nKeep up with the latest news from around the world: https://www.reuters.com/\nFollow Reuters on Facebook: https://www.facebook.com/Reuters\nFollow Reuters on Twitter: https://twitter.com/Reuters\nFollow Reuters on Instagram: https://www.instagram.com/reuters/?hl=en</article>","contentLength":562,"flags":null,"enclosureUrl":"https://www.youtube.com/v/EZiIzFJkgRI?version=3","enclosureMime":"","commentsUrl":null},{"title":"‘Woke Europe not facing civilisational erasure,’ says EU’s Kallas after Rubio’s Munich speech","url":"https://www.theguardian.com/world/live/2026/feb/15/munich-security-conference-rubio-kallas-lagarde-europe-latest-news-updates","date":1771157695,"author":"/u/Any-Original-6113","guid":370,"unread":true,"content":"<div data-gu-marker=\"pinned-post\" data-component=\"pinned-post\"><div><article><p>EU’s is speaking on the main stage now.</p><p>In her first response to Rubio’s speech yesterday, she somewhat snarkily says that “contrary to what some may say woke decadent <a href=\"https://www.theguardian.com/world/europe-news\" data-link-name=\"in body link\" data-component=\"auto-linked-tag\">Europe</a> is not facing civilizational erasure,” and says that many countries still “want to join our club – and not just fellow Europeans,” pointing to Canada.</p><p>She says that <a href=\"https://www.theguardian.com/world/russia\" data-link-name=\"in body link\" data-component=\"auto-linked-tag\">Russia</a> continues to pose a significant challenge.</p><p>“This starts in <a href=\"https://www.theguardian.com/world/ukraine\" data-link-name=\"in body link\" data-component=\"auto-linked-tag\">Ukraine</a>, but we know that Russia’s endgame is not Donbas,” she says, pointing to continuing attempts to sabotage or undermine EU countries.</p><blockquote data-spacefinder-role=\"inline\"><p><em>“But let’s be clear-eyed about Russia:  After more than a decade of a conflict, including 4 years of full-scale war in Ukraine. Russia has barely advanced beyond the 2014 lines, and the cost? 1.2 million casualties.</em></p><p><em>Today, <strong>Russia is broken, its economy is in shreds. </strong>It is disconnected from the European energy markets and its own citizens are fleeing.</em></p><p><em>In fact, the greatest threat Russia presents right now is that it gains more at the negotiation table, then it has achieved on the battlefield.”</em></p></blockquote></article></div></div><article><p>… and on that note, <strong>it’s a wrap for today and for our coverage from the 2026 Munich Security Conference!</strong></p><ul><li><p><strong>“Contrary to what some may say, woke decadent Europe is not facing civilizational erasure,” the EU’s top diplomat, Kaja Kallas, insisted</strong> as she appeared on stage on the final day of the conference (<a href=\"https://www.theguardian.com/world/live/2026/feb/15/munich-security-conference-rubio-kallas-lagarde-europe-latest-news-updates?page=with%3Ablock-699184798f0893c883d51f0d#block-699184798f0893c883d51f0d\" data-link-name=\"in body link\">9:48</a>).</p></li><li><p>But <strong>Kallas welcomed US secretary of state Marco Rubio’s speech</strong> from Saturday, saying that “we don’t see eye to eye in all the issues and that this will remain the case as well, but I think we can work from there” (<a href=\"https://www.theguardian.com/world/live/2026/feb/15/munich-security-conference-rubio-kallas-lagarde-europe-latest-news-updates?page=with%3Ablock-699185218f0893c883d51f0e#block-699185218f0893c883d51f0e\" data-link-name=\"in body link\">9:51</a>).</p></li><li><p>But <strong>other European leaders urged Europe to not “cling to love words” from the US,</strong><strong>but focus on reforming itself,</strong> ramping up its defence production and strenghtening its strategic independence (<a href=\"https://www.theguardian.com/world/live/2026/feb/15/munich-security-conference-rubio-kallas-lagarde-europe-latest-news-updates?page=with%3Ablock-699186068f0807ca30822ac0#block-699186068f0807ca30822ac0\" data-link-name=\"in body link\">9:52</a>, <a href=\"https://www.theguardian.com/world/live/2026/feb/15/munich-security-conference-rubio-kallas-lagarde-europe-latest-news-updates?page=with%3Ablock-699187b98f0893c883d51f16#block-699187b98f0893c883d51f16\" data-link-name=\"in body link\">9:53</a>, <a href=\"https://www.theguardian.com/world/live/2026/feb/15/munich-security-conference-rubio-kallas-lagarde-europe-latest-news-updates?page=with%3Ablock-6991886e8f0807ca30822acc#block-6991886e8f0807ca30822acc\" data-link-name=\"in body link\">9:58</a>).</p></li><li><p><strong>The European Central Bank president, Christine Lagarde, struck an upbeat tone that Europe always “gets better in crisis,”</strong> as she called for a reaction to “kick in butt by Trump” (<a href=\"https://www.theguardian.com/world/live/2026/feb/15/munich-security-conference-rubio-kallas-lagarde-europe-latest-news-updates?page=with%3Ablock-699193df8f0893c883d51f50#block-699193df8f0893c883d51f50\" data-link-name=\"in body link\">10:40</a>).</p></li><li><p>Meanwhile, <strong>former US secretary of state Hillary Clinton accused Donald Trump of “betraying the west”</strong> with his “disgraceful” policy of pressurising Ukraine to strike a peace deal with Russia (<a href=\"https://www.theguardian.com/world/live/2026/feb/15/munich-security-conference-rubio-kallas-lagarde-europe-latest-news-updates?page=with%3Ablock-69919b118f0893c883d51f80#block-69919b118f0893c883d51f80\" data-link-name=\"in body link\">11:18</a>).</p></li></ul><ul><li><p>Both  and Latvian president said that while the EU was broadly agreed on prioritising Ukraines’ accession to the bloc, they currently appeared “not ready” to commit to a specific date (<a href=\"https://www.theguardian.com/world/live/2026/feb/15/munich-security-conference-rubio-kallas-lagarde-europe-latest-news-updates?page=with%3Ablock-699188808f08a3236d064d5f#block-699188808f08a3236d064d5f\" data-link-name=\"in body link\">10:06</a>), as Ukraine’s  keeps pushing for a 2027 target.</p></li><li><p>Looking forward to the upcoming peace talks in Geneva, <strong>Kallas said the EU should focus on identifying its key asks of Russia</strong> (<a href=\"https://www.theguardian.com/world/live/2026/feb/15/munich-security-conference-rubio-kallas-lagarde-europe-latest-news-updates?page=with%3Ablock-699190a48f0807ca30822af5#block-699190a48f0807ca30822af5\" data-link-name=\"in body link\">10:26</a>).</p></li><li><p>The US secretary of state, Marco Rubio, has landed in Slovakia as he continues his European charm offensive tour, with a visit to Hungary expected on Monday (<a href=\"https://www.theguardian.com/world/live/2026/feb/15/munich-security-conference-rubio-kallas-lagarde-europe-latest-news-updates?page=with%3Ablock-699198628f0893c883d51f69#block-699198628f0893c883d51f69\" data-link-name=\"in body link\">11:04</a>).</p></li></ul><p>And that’s all from me, </p><p><strong>Thank you for following our reporting from Munich.</strong></p><p>If you have <strong>any tips, comments or suggestions,</strong> email me at jakub.krupa@theguardian.com.</p><p>I am also on Bluesky at  and on X at .</p></article><article><p>Ex Nato secretary general  also briefly comes in on in the context of managing differences between Europe and the US.</p><blockquote data-spacefinder-role=\"inline\"><p><em>“As friends and as allies, <strong>we have to be very clear when some core values are threatened or challenged.</strong></em></p><p><em>For instance, on Greenland, many European countries and Norway said <strong>very clearly it is unacceptable to claim the territory of another country,</strong> and we said that to our strongest ally. I think that was the right thing to do. </em></p><p><em><strong>Sometimes we have to be very clear, especially when these core values are challenged;</strong> but it’s not all about clarity and [simply] saying what we think, but it’s also about finding a way to address the problem.</em></p><p><em>The good news now is that <strong>we are in a better place now</strong> than we just were a few weeks ago because now there is actually an ongoing process between Greenland and Denmark and the United States to address the issues that have been raised and hopefully we’ll find a way to sort it out and continue to be together in this big transatlantic family.”</em></p></blockquote></article><article><p> also talks about how the EU can benefit from what’s happening in the US as some scientists seek to relocate to <a href=\"https://www.theguardian.com/world/europe-news\" data-link-name=\"in body link\" data-component=\"auto-linked-tag\">Europe</a>.</p><p>Responding to a question from an American member of the audience, she says:</p><p><em>“I am very happy we have a lot of American scientists coming to my home town, for example, Heidelberg, and helping us to work on Alzheimer and many things, because you have a health minister who believes in no science. </em></p><p><em>It will strengthen Europe, if I may say so, [even though] it’s a pity for the US.”</em></p></article><article><p>Alliance 90/Greens co-chair gets a round of applause as she says in response to a question from a Ukrainian MP:</p><p>“First of all, allow me to say that I want to <strong>thank all Ukrainians who are fighting for their freedom, but also for our freedom.</strong>”</p><p>Others on the panel chip in with their thanks, too.</p></article><article><p>Okay, now Andrej says we need to defend free and independent press, “even if they are a bit annoying.”</p></article><article><p>Plenković says no young people buy papers any more, maybe except for sport newspapers, and now I feel kind of personally offended.</p><p>Try the Guardian, Andrej!</p></article><article><p>Speaking on values, <strong>Croatian prime minister Andrej Plenković says that “the most important political event that somehow swept across <a href=\"https://www.theguardian.com/world/europe-news\" data-link-name=\"in body link\" data-component=\"auto-linked-tag\">Europe</a> happened 10 years ago, and that was the unprecedented migration crisis.”</strong></p><blockquote data-spacefinder-role=\"inline\"><p><em>“<strong>The 2015-2016 migration crisis changed political scenery across Europe.</strong></em></p><p><em>It had an impact on every single member state – in some of them faster, in some of them maybe with a sort of delayed effect – but it had an impact on strengthening the political parties who were, let’s say, on the [extreme ends] of the political spectrum [and] the mainstream parties had to react, everybody gradually became more restrictive vis a vis migration.”</em></p></blockquote><blockquote data-spacefinder-role=\"inline\"><p><em>“I think <strong>we are still in the age where we are living on a daily basis, the consequences of that event</strong>, including in the country where we are today.”</em></p></blockquote></article><article><p> also says that <strong>“the most urgent challenge to the values of freedom and democracy is what we see now on the frontlines in <a href=\"https://www.theguardian.com/world/ukraine\" data-link-name=\"in body link\" data-component=\"auto-linked-tag\">Ukraine</a>.”</strong></p><blockquote data-spacefinder-role=\"inline\"><p><em>“<strong>There’s no doubt that that that Ukraine has to prevail</strong>; military support to Ukraine is so obviously the right thing to do for everyone that believes in democracy and freedom.”</em></p></blockquote><p>But <strong>he says he is open to a broader discussion on inconsistencies in how countries respond to global events</strong>, potentially muddling the understanding of their values.</p><blockquote data-spacefinder-role=\"inline\"><p><em>“I think that <strong>one of the challenges we have seen is, for instance, the conflict in the Middle East compared to Ukraine.</strong></em></p><p><em>There are huge differences, but it is about sovereignty and respecting international law and therefore my own country Norway, we have been very clear … in condemning Russia’s invasion of Ukraine and supporting Ukraine, but we’ve also been very clear that Israel is responsible for illegal occupation of the West Bank and Gaza.</em></p><p><em>Again, two very different situations, <strong>but it undermines our credibility that we believe in these values if we are not clear when international law is violated</strong> regardless of where it is, why and by whom. …</em></p><p><em>I think that of course <strong>any double standard weakens the credibility of our values</strong> and we need to be honest about ourselves because I think we all have demonstrated that we are not always consistent, also my own country.”</em></p></blockquote></article><article><p>Speaking on values, former Nato secretary general  has just offered this pragmatic view on how the alliance should work:</p><blockquote data-spacefinder-role=\"inline\"><p><em>“So <strong>yes, the more we can agree on values, the better. </strong></em></p><p><em>But fundamentally, <strong>what really matters when it comes to security, is that we are realising that we have a common interest to protect and defend each other.</strong></em></p><p><em>And sometimes these issues are mixed, and of course, there is a relationship between values and interest, but I think the history of Nato and its friends demonstrates that there can be quite serious differences on values, but still we’re able to rally around our common interests.”</em></p></blockquote></article><article><p>Late panels are not always particularly popular, but last night’s discussion on the “west-west” divide and what remains of the shared EU-US values proved to be a hit with many Munich attendees.</p><p>During a wide-ranging discussion, one moment stood out in particular as former US secretary of state <strong>Hillary Clinton offered this brutal takedown of Donald Trump’s foreign policy on <a href=\"https://www.theguardian.com/world/ukraine\" data-link-name=\"in body link\" data-component=\"auto-linked-tag\">Ukraine</a>.</strong></p><blockquote data-spacefinder-role=\"inline\"><p><em>“<strong>I think that the Trump administration’s position toward Ukraine is disgraceful.</strong> I think the effort to force Ukraine into a surrender deal with Putin is shameful. I think the effort that Putin and Trump are making to profit off the misery and death of the Ukrainian people is a historic error and corrupt to the nth degree.</em></p><p><em>I believe Ukraine is fighting for our democracy and our values of freedom and civilisation on the frontlines, losing thousands of people and having their country destroyed by one man’s mania to control them, and <strong>I think Trump either doesn’t understand or could [not] care less about that suffering.</strong>”</em></p></blockquote><blockquote data-spacefinder-role=\"inline\"><p><em>“<strong>He has betrayed the west. He’s betrayed human values.</strong> He’s betrayed the Nato charter, the Atlantic Charter, the Universal Declaration of Human Rights.</em></p><p><em>A lot of what has been done before to try to make sense of how difficult it is to restrain people who want unaccountable power – and none of us in this room, including all of us on this panel, would choose to live under a regime that was so unaccountable that it could act with impunity the way that Putin does – except that’s who Trump is modeling himself on.”</em></p></blockquote></article><article><p>Meanwhile, US secretary of state  has arrived in Slovakia as he continues his European charm offensive tour.</p><p>He was welcomed by Slovakia’s foreign minister and will meet with both the country’s controversial prime minister, , and the president, </p><p>The <a href=\"https://spravy.pravda.sk/domace/clanok/786352-sef-americkej-diplomacie-marco-rubio-pristal-na-letisku-v-bratislave-privital-ho-juraj-blanar/?utm_source=pravda&amp;utm_medium=hp-box&amp;utm_campaign=shp_3clanok_box\" data-link-name=\"in body link\">local</a><a href=\"https://www.sme.sk/domov/c/na-slovensko-pride-sef-americkej-diplomacie-rubio-stretne-sa-s-prezidentom-i-s-premierom\" data-link-name=\"in body link\">media</a> reported they will be talking among the US-Slovak relations, regional security, and nuclear energy, among other things.</p><p><strong>Rubio will later go on to Hungary,</strong> in a closely watched visit less than two months before the high-stakes parliamentary election that could see Viktor Orbán ousted from the office.</p><p>The top US diplomat’s decision to visit two countries governed by most pro-Russian countries governments in Europe – whose leaders continue to engage with  and regularly oppose measures targeting <a href=\"https://www.theguardian.com/world/russia\" data-link-name=\"in body link\" data-component=\"auto-linked-tag\">Russia</a> – raised some eyebrows in other parts Europe.</p><p>Let’s see what comes out of it.</p></article><article><p> also offers her take on the European preference policy idea, as she says she is “a bit concerned” about it.</p><blockquote data-spacefinder-role=\"inline\"><p><em>“I think that it’s an area where the policymakers must talk to the private sector, and they must understand whether the European preference will actually work for them to be as efficient as possible while keeping security as high as is necessary.</em></p><p><em>We are in this wonderful setting at the Munich Security Conference; you can talk to the militaries, you can talk to the people in the defence sector. </em></p><p><em>Many of them will tell you: yes, it’s fine, but the preference perimeter must be large enough to have the best technology brought into the equipment that they make – and you can define your parameter on the basis of the good partners and the real friends and exclude those that are not in that category.”</em></p></blockquote></article><article><blockquote data-spacefinder-role=\"inline\"><p><em>“And that is why we have together found the evidence of this  that was found in Alexei Navalny’s body at time he died.</em></p><p><em>And only the Russian regime had the motive, the means and the opportunity to administer this lethal posion while he was in prison in Russia.</em></p><p><em>They wanted to silence him because he was a critic of their regime and that is why <strong>we have exposed this barbaric Kremlin plot</strong> to do so and made sure that we have done so with evidence as well.</em></p><p><em>The reason as well that we have done this is was one of the things that Alexei Navalny himself said that. He said ‘tell the truth, spread the truth, that is the most dangerous weapon of all’. The Russian regime tried to stop him doing so, so we have done so instead.”</em></p></blockquote></article><article><p>The European Central Bank president, is now speaking on a panel about competitiveness and EU economy.</p><blockquote data-spacefinder-role=\"inline\"><p><em>“If you read Jean Monnet, if you read Schuman, if you read the founding fathers, they all say the same thing: <strong>Europe grows in times of crisis. Europe is stronger, gets better together in times of crisis.</strong>”</em></p><p><em>She says that the EU is responding to a number of crises currently, including <strong>“the kick in the butt that we all received as a result of president Trump’s change of attitude towards Europe.”</strong></em></p><p><em>“I’m just saying this is what is happening at the moment, and <strong>it does bring the leaders of Europe, the policymakers much closer together – that needs to continue.</strong>”</em></p></blockquote></article>","contentLength":12447,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1r5d6yg/woke_europe_not_facing_civilisational_erasure/"},{"title":"Australia pledges $2.7 billion for submarine shipyard","url":"https://www.youtube.com/watch?v=Op1qHtXy0QQ","date":1771157247,"author":"Reuters","guid":623,"unread":true,"content":"<article>Australia said it would spend $2.76 billion on a shipyard that will deliver nuclear-powered submarines under a defense pact with the US and Britain.\n\n#News #Reuters #Newsfeed #world #Australia #shipyard #submarine #AUKUS \n\nRead the story here: https://reut.rs/4rtLd15\n\n👉  Subscribe: http://smarturl.it/reuterssubscribe\n\nKeep up with the latest news from around the world: https://www.reuters.com/\nFollow Reuters on Facebook: https://www.facebook.com/Reuters\nFollow Reuters on Twitter: https://twitter.com/Reuters\nFollow Reuters on Instagram: https://www.instagram.com/reuters/?hl=en</article>","contentLength":585,"flags":null,"enclosureUrl":"https://www.youtube.com/v/Op1qHtXy0QQ?version=3","enclosureMime":"","commentsUrl":null},{"title":"Gazans mourn loved ones killed in overnight Israeli strikes","url":"https://www.youtube.com/watch?v=5r7oHc-qePg","date":1771155296,"author":"Reuters","guid":622,"unread":true,"content":"<article>Palestinians in Khan Younis mourned loved ones killed in overnight Israeli strikes. At least nine people died in the Gaza strikes, officials said.\n\n#News #Reuters #Newsfeed #world #militaryconflict #Gaza #Israel #IsraelHamasWar \n\nRead the story here: https://reut.rs/4rj8ouV\n\n👉  Subscribe: http://smarturl.it/reuterssubscribe\n\nKeep up with the latest news from around the world: https://www.reuters.com/\nFollow Reuters on Facebook: https://www.facebook.com/Reuters\nFollow Reuters on Twitter: https://twitter.com/Reuters\nFollow Reuters on Instagram: https://www.instagram.com/reuters/?hl=en</article>","contentLength":592,"flags":null,"enclosureUrl":"https://www.youtube.com/v/5r7oHc-qePg?version=3","enclosureMime":"","commentsUrl":null},{"title":"Ski jumping 101: How to fly big at the Olympics","url":"https://www.youtube.com/shorts/gkF70UW_LAY","date":1771149652,"author":"Reuters","guid":621,"unread":true,"content":"<article>The 2026 Winter Games debuts the first Women’s Large Hill event in ski jumping as the Olympic gender gap narrows. Reuters global sports editor Ossian Shine and Sam Macuga from Team USA explain the stages and technique that launch ski jumpers into the air.\n \n#olympics #italy #ski #skijump #sports\n\n👉  Subscribe: http://smarturl.it/reuterssubscribe\n\nKeep up with the latest news from around the world: https://www.reuters.com/\nFollow Reuters on Facebook: https://www.facebook.com/Reuters\nFollow Reuters on Twitter: https://twitter.com/Reuters\nFollow Reuters on Instagram: https://www.instagram.com/reuters/?hl=en</article>","contentLength":616,"flags":null,"enclosureUrl":"https://www.youtube.com/v/gkF70UW_LAY?version=3","enclosureMime":"","commentsUrl":null},{"title":"Macron urges calm after far-right activist fatally beaten","url":"https://www.lemonde.fr/en/france/article/2026/02/15/macron-urges-calm-after-far-right-activist-fatally-beaten_6750495_7.html","date":1771145285,"author":"/u/ChewZBeggar","guid":366,"unread":true,"content":"<p>French President Emmanuel Macron on Saturday, February 14, urged calm and restraint after the fatal beating of a 23-year-old French youth aligned with the far-right on the sidelines of a conference by a hard-left lawmaker in the southeastern city of Lyon. The death of the young man – identified only as Quentin – has intensified tensions between France's far-right and radical left.</p><p>He had been hospitalized in Lyon on Thursday after being attacked while providing what his supporters said was security for a protest against an appearance by hard-left MEP Rima Hassan at the Sciences Po Lyon university. The office of the Lyon prosecutor on Saturday told Agence France-Presse he had died of his wounds. An investigation has been opened into suspected aggravated manslaughter, it added.</p><p>Macron said on X that Quentin had been the victim of \"an unprecedented outburst of violence.\" \"Hatred that kills has no place in our country. I call for calm, restraint and respect,\" he added.</p><h2>'Organized and trained individuals'</h2><p>According to the Némésis collective, which is close to the far right, Quentin was part of the security team responsible for ensuring the safety of its activists. They were demonstrating against the conference by Hassan, who is known for her outspoken criticism of Israel.</p><p>The family's lawyer said in a statement that Quentin appeared to have been ambushed by \"organized and trained individuals, vastly superior in number and armed, some with their faces masked.\" Prosecutors have yet to give details on the circumstances of his death. Némésis accused members of a local anti-fascist association that was banned by the government in June of being behind the killing.</p><p>Three-time presidential candidate Marine Le Pen, who is still hoping to stand in 2027 despite a graft conviction, said on X that the \"barbarians responsible for this lynching\" should be brought to justice.</p><p>With Quentin's death sparking a wave of alarm across the political spectrum, concern also spread to the hard-left party of Hassan, La France Insoumise (LFI). \"What I have feared for years in Lyon is continuing,\" said LFI French parliament MP Raphaël Arnault. \"I offer my condolences to the family of this young man and I hope that the truth will be uncovered about this tragedy,\" he added.</p><p>In the wake of the incident, Interior Minister Laurent Nuñez urged authorities to \"increase vigilance around political gatherings, as well as around campaign offices.\"</p>","contentLength":2447,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1r59shr/macron_urges_calm_after_farright_activist_fatally/"},{"title":"France assembles magistrate team to examine 'Epstein files'","url":"https://www.dw.com/en/epstein-files-france-investigation-magistrates/a-75975774","date":1771135900,"author":"/u/AggravatingResist635","guid":369,"unread":true,"content":"<p>The Paris prosecutor's office on Saturday announced the formation of a special team of magistrates to scrutinize evidence that may implicate French nationals in crimes committed by convicted child sex offender, <a href=\"https://www.dw.com/en/epstein-files/t-74800490\">Jeffrey Epstein</a>.</p><p>The special team was created&nbsp;\"to be able to extract any piece that could be usefully reused in a new investigative framework,\" the prosecutor's office told the AFP news agency.</p><p>It will work closely with police and with prosecutors from the national financial crimes unit, according to French media outlets including <a rel=\"noopener follow\" target=\"_blank\" href=\"https://www.franceinfo.fr/monde/usa/affaire-jeffrey-epstein/le-parquet-de-paris-annonce-exploiter-les-fichiers-epstein-pour-identifier-d-eventuelles-infractions-et-une-reanalyse-integrale-du-dossier-jean-luc-brunel_7806008.html\" title=\"External link — Franceinfo\">Franceinfo</a>.</p><h2>Brunel case to be re-examined</h2><p>Among the cases that will receive special attention is that of the late modelling agency executive, Jean-Luc Brunel, a close associate of Epstein.</p><p>Prosecutors said Brunel had engaged in sexual acts with underage girls in the United States, the US Virgin Islands, Paris and the south of France.</p><p>The case against him was dropped in 2023 in the wake of his death and no one else was charged.</p><h2>French public figures in 'Epstein files'</h2><p>Several French public figures feature in the newly released files by the US Department of Justice and prosecutors are now looking into senior diplomat Fabrice Aidan at the request of the French Foreign Ministry.</p><p>\"An investigation is underway to gather various pieces of evidence that could substantiate this report,\" the prosecutor's office stated.</p><p>The prosecutor's office has also received a complaint filed by a Swedish woman against Daniel Siad, a model recruiter with close ties to Epstein.</p><p>Prosecutor's said she accused him of \"sexual acts that she describes as rape and that may have been committed in France in 1990.\"</p><p>A complaint was also filed against French conductor Frederic Chaslin, alleging acts of sexual harassment&nbsp;in 2016, prosecutors said.</p><div><h2 aria-label=\"Embedded video — New Epstein files reveal ties to Trump, Musk and royalty\">New Epstein files reveal ties to Trump, Musk and royalty</h2></div><p>Just over a week ago,&nbsp;French financial crimes prosecutors confirmed that a preliminary case against former minister of culture, Jack Lang and his daughter, film producer Caroline Lang, had been opened for \"laundering of aggravated tax-fraud proceeds.\"</p><p>Being mentioned in the \"Epstein files\" does not in itself mean an offence has been committed.</p>","contentLength":2163,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1r577yr/france_assembles_magistrate_team_to_examine/"},{"title":"How horse dung could be used as a plastic alternative","url":"https://www.youtube.com/shorts/VJ8ZJGuSoeA","date":1771135206,"author":"Reuters","guid":620,"unread":true,"content":"<article>British researchers are developing a new \"waste to wonder\" process that aims to turn horse dung into a sustainable alternative to plastic, according to the team at University College London, who are extracting cellulose-based fibers from the manure.\n\n#horse #dung #plastic #environment #waste</article>","contentLength":292,"flags":null,"enclosureUrl":"https://www.youtube.com/v/VJ8ZJGuSoeA?version=3","enclosureMime":"","commentsUrl":null},{"title":"How Jeffrey Epstein used the glamour of the Nobel Peace Prize to entice his global network of elites","url":"https://apnews.com/article/epstein-nobel-jagland-branson-summers-bannon-trump-a947bbf2bd307658014862d01517d21f","date":1771132210,"author":"/u/GregWilson23","guid":365,"unread":true,"content":"<p>STAVANGER, Norway (AP) — Jeffrey Epstein repeatedly played up his ties to the former head of the Nobel Peace Prize committee in invitations to and chats with elites like Richard Branson, Larry Summers, Bill Gates and Steve Bannon, a top ally of President Donald Trump, </p><p>Thorbjørn Jagland, who headed the Norwegian Nobel Committee from 2009 to 2015, turns up hundreds of times in the millions of  and convicted sex offender that were released by the U.S. Justice Department last month. </p><p>Since the release, Jagland, 75,  in Norway for “aggravated corruption” in connection with an investigation prompted by information in the files, the economic crime unit of Norwegian police Økokrim said. </p><p>Økokrim has said it would investigate whether gifts, travel and loans were received in connection with Jagland’s position. Its teams searched his Oslo residence on Thursday, plus two other properties in Risør, a coastal town to the south, and in Rauland to the west.</p><p>His attorneys at Elden law firm in Norway said Jagland denies the charges, and was questioned by the police unit on Thursday.</p><p>While there is no evidence in the documents seen so far of any outright lobbying for the Nobel Peace Prize, Epstein repeatedly played up hosting Jagland at his properties in New York and Paris in the 2010s.</p><h2>From an ‘interesting’ guest to subject of banter with Bannon</h2><p>In September 2018, during Trump’s first term and in an apparent allusion to his interest in the peace prize, Epstein had a varied text-message exchange with Bannon, at one point writing — in one of many messages with untidy grammar: “donalds head would explode if he knew you were now buds with the guy who on monday will decide the nobel peace prize.”</p><p>“I told him next year it should be you when we settle china,” he added, without elaborating.</p><p>In one email from 2013, mixing in investment tips and praise for PR tips, Epstein told British entrepreneur and magnate  that Jagland would be staying with Epstein in September that year, adding: “if you are there, you might find him interesting.”</p><p>A year after she left a job as White House counsel to President Barack Obama, in 2015,  got an email from Epstein saying: “head of nobel peace prize coming to visit, want to join?” </p><p>In 2012, Epstein wrote former Treasury Secretary and Harvard University president Larry Summers about Jagland, saying “head of the nobel peace prize staying with me, if you have any interest.”</p><p>In that exchange, Epstein referred to Jagland — also a former Norwegian prime minister and former head of the Council of Europe, a human rights body — as “not bright” but someone who offered a “unique perspective.” </p><p>The financier wrote Bill Gates in 2014, saying that Jagland had been reelected as head of the Council of Europe. </p><p>“That is good,” the Microsoft co-founder and formerly the world’s richest man, wrote. “I guess his peace prize committee job is also up in the air?”</p><p>During Jagland’s tenure as chair of the committee, it gave the peace prize to Obama, in 2009, and the European Union in 2012.</p><p>Jagland was brought into Epstein’s orbit by Terje Rød Larsen, a Norwegian diplomat who helped broker the Oslo Peace Accords between Israel and Palestinians. </p><p>Larsen and his wife are also facing corruption charges in Norway due to their association with Epstein.</p><p>Associated Press writer Jamey Keaten in Geneva contributed to this report. </p><p>The AP is reviewing the documents released by the Justice Department in collaboration with journalists from CBS, NBC, MS NOW and CNBC. Journalists from each newsroom are working together to examine the files and share information about what is in them. Each outlet is responsible for its own independent news coverage of the documents.</p>","contentLength":3746,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1r564kf/how_jeffrey_epstein_used_the_glamour_of_the_nobel/"},{"title":"Britain says toxin killed Navalny; Rubio takes friendlier approach to Europe, and more","url":"https://shows.acast.com/theeconomistmorningbriefing/episodes/britain-says-toxin-killed-navalny-rubio-takes-friendlier-app","date":1771129178,"author":"","guid":391,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"https://sphinx.acast.com/p/acast/s/theeconomistmorningbriefing/e/6991478c4d911476d8989d0c/media.mp3?tk=eyJ0ayI6ImRlZmF1bHQiLCJhZHMiOnRydWUsInNwb25zIjp0cnVlLCJpbiI6Imh0dHBzOi8vczMuYW1hem9uYXdzLmNvbS9hc3NldHMucGlwcGEuaW8vc2hvd3MvNjJlMjg2YTkzNGQ0ZDkwNmUzODc0MjRiLzE3NzExMjg1NzY2NzEtYmRiOGUwMzAtZGNiNi00MWNmLTlkMTgtNzg2NTBkNDQ0M2RiLXB1YmxpY0ludHJvLm1wMyIsIm91dCI6Imh0dHBzOi8vczMuYW1hem9uYXdzLmNvbS9hc3NldHMucGlwcGEuaW8vc2hvd3MvNjJlMjg2YTkzNGQ0ZDkwNmUzODc0MjRiLzE3NzExMjg1NzkyNzgtZGZhNDhmOGItNjMwZi00NDc3LTg2MGYtYmUzMGU0MjJhMjg1LXB1YmxpY091dHJvLm1wMyIsInN0YXR1cyI6InB1YmxpYyJ9&sig=gL80zxYHV-Zsf6tziD1hjImVCTqQ9PkjPY5wVmxDQII","enclosureMime":"","commentsUrl":null},{"title":"France: Navalny poisoning shows Putin ready to use nerve agents on own people","url":"https://www.reuters.com/world/france-navalny-poisoning-shows-putin-ready-use-nerve-agents-own-people-2026-02-14/","date":1771125875,"author":"/u/Raj_Valiant3011","guid":353,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1r545b4/france_navalny_poisoning_shows_putin_ready_to_use/"},{"title":"Macron urges calm after far-right activist fatally beaten","url":"https://www.lemonde.fr/en/france/article/2026/02/15/macron-urges-calm-after-far-right-activist-fatally-beaten_6750495_7.html","date":1771125609,"author":"/u/EquipmentSubject6801","guid":357,"unread":true,"content":"<p>French President Emmanuel Macron on Saturday, February 14, urged calm and restraint after the fatal beating of a 23-year-old French youth aligned with the far-right on the sidelines of a conference by a hard-left lawmaker in the southeastern city of Lyon. The death of the young man – identified only as Quentin – has intensified tensions between France's far-right and radical left.</p><p>He had been hospitalized in Lyon on Thursday after being attacked while providing what his supporters said was security for a protest against an appearance by hard-left MEP Rima Hassan at the Sciences Po Lyon university. The office of the Lyon prosecutor on Saturday told Agence France-Presse he had died of his wounds. An investigation has been opened into suspected aggravated manslaughter, it added.</p><p>Macron said on X that Quentin had been the victim of \"an unprecedented outburst of violence.\" \"Hatred that kills has no place in our country. I call for calm, restraint and respect,\" he added.</p><h2>'Organized and trained individuals'</h2><p>According to the Némésis collective, which is close to the far right, Quentin was part of the security team responsible for ensuring the safety of its activists. They were demonstrating against the conference by Hassan, who is known for her outspoken criticism of Israel.</p><p>The family's lawyer said in a statement that Quentin appeared to have been ambushed by \"organized and trained individuals, vastly superior in number and armed, some with their faces masked.\" Prosecutors have yet to give details on the circumstances of his death. Némésis accused members of a local anti-fascist association that was banned by the government in June of being behind the killing.</p><p>Three-time presidential candidate Marine Le Pen, who is still hoping to stand in 2027 despite a graft conviction, said on X that the \"barbarians responsible for this lynching\" should be brought to justice.</p><p>With Quentin's death sparking a wave of alarm across the political spectrum, concern also spread to the hard-left party of Hassan, La France Insoumise (LFI). \"What I have feared for years in Lyon is continuing,\" said LFI French parliament MP Raphaël Arnault. \"I offer my condolences to the family of this young man and I hope that the truth will be uncovered about this tragedy,\" he added.</p><p>In the wake of the incident, Interior Minister Laurent Nuñez urged authorities to \"increase vigilance around political gatherings, as well as around campaign offices.\"</p>","contentLength":2447,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1r54282/macron_urges_calm_after_farright_activist_fatally/"},{"title":"Air India flight 171 crash: Pilot deliberately cut fuel switch, report reveals","url":"https://www.khaleejtimes.com/world/asia/air-india-flight-171-crash-pilot-deliberately-cut-fuel-switch-report-says","date":1771124726,"author":"/u/UnderstandingBig949","guid":361,"unread":true,"content":"<p>Investigators probing last year's crash of <a href=\"https://www.khaleejtimes.com/business/aviation/air-india-plane-crash-casualties\">Air India flight 171</a> from Ahmedabad have concluded that the disaster that killed 260 people happened not because of a technical defect, but was an “intentional act” by the pilot in command.</p><p>The report, published on Thursday in the Italian daily Corriere della Sera, said Capt Sumeet Sabharwal, the pilot-in-command, allegedly turned off the fuel switches – that is “almost certainly” an intentional act. The paper cited Western aviation agency sources. </p><p>The Indian civil aviation ministry and the Aircraft Accident Investigation Bureau (AAIB), however, have yet to respond to media requests for comments on the claims.</p><p>The Boeing 787 Dreamliner crashed on <a href=\"https://www.khaleejtimes.com/world/asia/ahmedabad-airport-plane-crash-india\">June 12, 2025</a>, shortly after takeoff from the Ahmedabad airport, killing 260 people, including 241 of the 242 on board the aircraft and 19 on the ground. The aircraft crashed into a medical student hostel.</p><p>The preliminary report of the AAIB mentioned that one pilot asked the other in the cockpit why he had cut off the fuel. “I did not do so,” was the response from the other pilot. The paper said that Capt Sabharwal, the main suspect, had been suffering from depression a month before the disaster. </p><p>The Italian publication said Indian investigators have agreed with American experts that the crash did not happen due to mechanical failure, but was a deliberate action.</p><p>When similar reports leaked a few months ago, citing the AAIB’s preliminary findings that blamed one of the pilots, there were protests from pilots’ associations in India. Sabharwal’s father also rejected the charges about his son’s mental health and demanded a fresh probe.</p><div><img src=\"https://fea.assettype.com/khaleejtimes/static/assets/fallbackPlaceholder-CoqrVPcw.jpg\" alt=\"\" loading=\"lazy\" height=\"4788\" width=\"7181\"></div><p>Reports have also cited a preliminary technical assessment based on black box data, which ruled out mechanical failure and referred to manual movement of switches relating to engine ignition and shutdown. Both engines were found to have been switched off at the time of the crash.</p><p>The Italian paper cited anonymous sources as saying the conclusion will undergo a political evaluation, and a more cautious version would be adapted to avoid controversies.</p><p>Meanwhile, another news report claimed that Air India has offered cash settlements to families of the victims of the crash on condition that they do not initiate legal action against the airline and the aircraft manufacturer. </p>","contentLength":2340,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1r53rm5/air_india_flight_171_crash_pilot_deliberately_cut/"},{"title":"Ukraine destroys half of Russia's 'key' Pantsir air defense systems, security service says","url":"https://kyivindependent.com/ukraine-destroys-half-of-russias-key-pantsir-air-defense-systems-security-service-says/","date":1771123006,"author":"/u/eaglemaxie","guid":359,"unread":true,"content":"<p>The Alpha unit of Ukraine's Security Service (SBU) destroyed half of Russia's stockpile of the coveted Pantsir air defense system, the SBU announced Feb. 14.</p><p>\"The <a href=\"https://kyivindependent.com/tag/pantsir-s1/\">'Pantsir'</a> is one of Russia's modern and key air defense systems. The cost of a single system ranges from $15 to $20 million. These anti-aircraft missile systems are the most effective in countering Ukrainian long-range <a href=\"https://kyivindependent.com/tag/drones/\">drones</a>,\" the announcement <a href=\"https://t.me/SBUkr/16804\" target=\"_blank\" rel=\"noopener noreferrer\">read</a>.</p><p>The \"systemic destruction\" of the <a href=\"https://kyivindependent.com/tag/air-defense/\">air defense</a> system has the \"strategic goal\" of making <a href=\"https://kyivindependent.com/tag/russia/\">Russia</a> vulnerable to long-range strikes as Moscow continues to wage its war, the SBU said.</p><p>A diminished arsenal allows the Armed Forces to effectively strike Russian \"military bases, warehouses, airfields, and other occupied facilities.\"</p><p>Ukraine regularly strikes military infrastructure deep within Russia and its own occupied territories in an effort to diminish Moscow's fighting power.</p><p>The SBU claimed on Jan. 19 that its <a href=\"https://kyivindependent.com/ukraines-sbu-claims-to-have-destroyed-4-billion-worth-of-russian-air-defense-systems-over-past-year/\">long-range strikes</a> during the year of 2025 either \"destroyed or disabled\" Russian air defense systems worth a total of approximately $4 billion.</p><p>On Feb. 12, Ukraine struck a Russian 55Zh6U \"Nebo-U\" <a href=\"https://kyivindependent.com/ukraine-says-it-struck-100-million-russian-nebo-u-radar-system-in-occupied-crimea/\">long-range radar station</a>, estimated to be worth approximately $100 million, near Yevpatoriia in occupied Crimea, the General Staff of Ukraine’s Armed Forces later <a href=\"https://t.me/GeneralStaffZSU/34976\" rel=\"noopener noreferrer\" target=\"_blank\">reported</a> on Feb. 13.</p><p>Meanwhile, the 1st Separate Center of the <a href=\"https://kyivindependent.com/ukraines-unmanned-systems-forces-release-footage-of-strikes-on-russian-airfield-in-crimea-other-targets-in-occupied-territories/\">Unmanned Systems Forces</a> (USF) on Feb. 12 struck an airfield in the village of Hvardiiske in Crimea, the Kirova electrical substation in Luhansk, and a data center in Prymorsk, Zaporizhzhia Oblast.</p><p>Ukrainian long-range cruise <a href=\"https://kyivindependent.com/tambov-draft/\">\"Flamingo\" missiles</a> struck a major Russian arsenal storing missiles, ammunition, and explosives in Kotluban, Volgograd Oblast, overnight, Ukraine's General Staff reported on Feb. 12.</p><p>The facility belongs to Russia's Main <a href=\"https://t.me/GeneralStaffZSU/34951\" rel=\"noopener noreferrer\" target=\"_blank\">Missile and Artillery Directorate</a> (GRAU) and is described as one of the largest ammunition storage sites used by the Russian army. Powerful explosions and secondary detonations were recorded at the site.</p><p>In addition to the strike on the arsenal, Ukrainian forces on Feb. 12 hit the Progress Plant in Michurinsk, Tambov Oblast. The enterprise produces high-tech equipment for aviation and missile systems and is involved in supporting Russia’s military.</p>","contentLength":2244,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1r5373s/ukraine_destroys_half_of_russias_key_pantsir_air/"},{"title":"Canada has officially joined the EU's loans-for-weapons program","url":"https://www.cbc.ca/news/politics/canada-eu-safe-agreement-defence-loans-weapons-9.7090635","date":1771122718,"author":"/u/Old_General_6741","guid":364,"unread":true,"content":"<p>Defence Minister David McGuinty says Canada has now officially joined the European Union’s Security Action for Europe (SAFE) program, which offers loans to member states to invest in defence capabilities.</p><p>\"The agreement strengthens our collective security, supports the development of key defence capabilities, and gives Canadian industry access to European defence markets while contributing to European and Ukrainian security,\" McGuinty said in a statement sent to CBC News.</p><p>The SAFE program allows partner countries to access low-interest loans for the joint procurement of military gear and weapons. It also allows Canadian companies to bid on those joint projects.</p><p>The program was announced by the EU in March and is part of a European effort to rearm in the face of Russia's ongoing war with Ukraine.</p><p>On Wednesday, the Council of the EU announced the first wave of financial assistance under SAFE, which can go to Belgium, Bulgaria, Cyprus, Denmark, Spain, Croatia, Portugal and Romania.</p><p>The second wave, which the Council said it expects to adopt on Tuesday, will open up financial assistance to Estonia, Greece, Italy, Latvia, Lithuania, Poland, Slovakia and Finland.</p>","contentLength":1172,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1r533kb/canada_has_officially_joined_the_eus/"},{"title":"Zelenskyy blasts Orbán: Grows his belly instead of his army","url":"https://newsukraine.rbc.ua/news/zelenskyy-blasts-orb-n-grows-his-belly-instead-1771073043.html","date":1771121067,"author":"/u/jackytheblade","guid":355,"unread":true,"content":"<p data-end=\"226\" data-start=\"117\">\"Mr. Ischinger said in an interview before this conference that as long as Ukraine is defending Europe, the danger is not so great. If we speak plainly and a bit cynically, that is more or less the situation today. But look at the price,\" Zelenskyy said.</p><p data-end=\"697\" data-start=\"618\">The president stressed that Ukrainians are the ones holding the European front.</p><p data-end=\"976\" data-start=\"699\">\"Behind our people stand an independent Poland and the free Baltic states. There can be a sovereign Moldova. And Romania without dictatorship. And even one Viktor can think of how to grow his belly and not how to grow his army to stop Russian tanks from returning to the streets of Budapest,\" he added.</p><p data-end=\"1333\" data-start=\"1238\">The statement came amid Orbán’s repeated blocking of Ukraine’s EU accession and EU aid to Kyiv.</p>","contentLength":735,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1r52j9r/zelenskyy_blasts_orb%C3%A1n_grows_his_belly_instead_of/"},{"title":"More than 60 children infected in north London measles outbreak","url":"https://www.theguardian.com/society/2026/feb/14/more-than-60-children-infected-in-north-london-measles-outbreak?CMP=Share_AndroidApp_Other","date":1771119173,"author":"/u/tahiirhussain","guid":352,"unread":true,"content":"<p>More than 60 children have been infected by a measles outbreak in north <a href=\"https://www.theguardian.com/uk/london\" data-link-name=\"in body link\" data-component=\"auto-linked-tag\">London</a>, it has been reported.</p><p>Seven schools and a nursery in Enfield reported the cases, with some children treated in hospital, according to the Sunday Times.</p><p>There are concerns the outbreak is linked to low levels of <a href=\"https://www.theguardian.com/society/mmr\" data-link-name=\"in body link\" data-component=\"auto-linked-tag\">MMR</a> vaccination in the capital. For every one infected person, measles can spread to up to 18 unvaccinated people.</p><p>Dudu Sher-Arami, Enfield’s director of public health who is writing to every parent in the area, said the outbreak posed a serious threat to the wider capital and there was the potential to cause a “much greater and bigger pan-London outbreak” because residents travel across the city.</p><p>She told the Sunday Times London has “one of the lowest, if not the lowest, vaccination uptake rates” in the country.</p><p>Sher-Arami said: “It is possible for it to grow. We know that measles has got some very nasty complications. It can cause deafness. It can cause brain damage and one in five children can need hospital treatment.”</p><p>Temporary vaccination clinics are being held in schools and throughout Enfield, an area in which more than a fifth of children are not inoculated against measles, mumps or rubella by the age of five.</p><p>A government campaign promoting childhood vaccination is expected to be launched next week with adverts on social media, YouTube and radio to counter vaccine scepticism. Measles usually starts with cold-like symptoms followed by a rash a few days later, according to the NHS. Some people may also get small spots in their mouths.</p><p>It comes after a plateau in vaccination coverage and a surge in cases, with 3,681 cases recorded in the UK in 2024.</p><p>From 2021 to 2023, the UK was considered to have “eliminated” the disease.</p><p>WHO recommends at least 95% of children should receive vaccine doses for each illness to achieve herd immunity.</p><p>According to UK <a href=\"https://www.theguardian.com/society/health\" data-link-name=\"in body link\" data-component=\"auto-linked-tag\">Health</a> Security Agency figures 91.9% of five-year-olds had received one dose of the MMR (measles, mumps and rubella) vaccine in 2024-25, unchanged from 2023-24 and the lowest level since 2010-11.</p><p>The data also showed 83.7% of five-year-olds had received both MMR doses, the lowest level since 2009-10.</p>","contentLength":2179,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1r51wfk/more_than_60_children_infected_in_north_london/"},{"title":"Hungarian opposition leader says sex-tape is ‘Russian-style’ smear operation","url":"https://tvpworld.com/91558279/pter-magyar-denies-wrongdoing-ahead-of-blackmail-video","date":1771118839,"author":"/u/thhvancouver","guid":354,"unread":true,"content":"<!DOCTYPE html>","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1r51sb7/hungarian_opposition_leader_says_sextape_is/"},{"title":"US military preparing for potentially weeks-long Iran operations","url":"https://www.youtube.com/watch?v=nHEy0c7hFQk","date":1771115594,"author":"Reuters","guid":619,"unread":true,"content":"<article>The US military is preparing for the possibility of sustained, weeks-long operations against Iran if President Trump orders an attack, in what could become a far more serious conflict than previously seen between the countries.\n#News #Reuters #Newsfeed #iran #usa #military \n\nRead the story here: https://reut.rs/3ZHms5k\n\n👉  Subscribe: http://smarturl.it/reuterssubscribe\n\nKeep up with the latest news from around the world: https://www.reuters.com/\nFollow Reuters on Facebook: https://www.facebook.com/Reuters\nFollow Reuters on Twitter: https://twitter.com/Reuters\nFollow Reuters on Instagram: https://www.instagram.com/reuters/?hl=en</article>","contentLength":638,"flags":null,"enclosureUrl":"https://www.youtube.com/v/nHEy0c7hFQk?version=3","enclosureMime":"","commentsUrl":null}],"tags":["news"]}