{"id":"7DceLgR4szFyHjpUotrBgPp9fEDdwmRmyXGW53xLQnbPAifjKVFPj1dyKJ6sHa1bC6AC9QFBhYUJLmJ6GyX57","title":"top scoring links : linux","displayTitle":"Reddit - Linux","url":"https://www.reddit.com/r/linux/top/.rss?sort=top&t=day&limit=6","feedLink":"https://www.reddit.com/r/linux/top/?sort=top&t=day&limit=6","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":6,"items":[{"title":"Station Amsterdam Bijlmer ArenA","url":"https://www.reddit.com/r/linux/comments/1j9pgmq/station_amsterdam_bijlmer_arena/","date":1741800252,"author":"/u/nicq88","guid":346,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"KDE Plasma 6.3.3, Bugfix Release for March","url":"https://kde.org/announcements/plasma/6/6.3.3/","date":1741777988,"author":"/u/gabriel_3","guid":347,"unread":true,"content":"<section><p>You can give us feedback and get updates on our social media channels:\n<a href=\"https://go.kde.org/matrix/#/#kde:kde.org\" aria-label=\"Share on Matrix\"></a><a href=\"https://floss.social/@kde\" aria-label=\"Share on Mastodon\"></a><a href=\"https://bsky.app/profile/kde.org\" aria-label=\"Share on Bluesky\"></a><a href=\"https://www.facebook.com/kde/\" aria-label=\"\"></a><a href=\"https://www.linkedin.com/company/29561/\" aria-label=\"Share on LinkedIn\"></a><a href=\"https://www.reddit.com/r/kde/\" aria-label=\"Share on Reddit\"></a><a href=\"https://lemmy.kde.social/\" aria-label=\"Share on Lemmy\"></a><a href=\"https://www.youtube.com/@KdeOrg\" aria-label=\"Share on YouTube\"></a><a href=\"https://tube.kockatoo.org/a/kde_community/video-channels\" aria-label=\"Share on PeerTube\"></a><a href=\"https://vk.com/kde_ru\" aria-label=\"Share on VK\"></a><a href=\"https://www.instagram.com/kdecommunity/\" aria-label=\"Share on Instagram\"></a></p><p align=\"justify\">Your feedback is greatly appreciated.</p></section><p align=\"justify\">KDE is a <a href=\"https://www.gnu.org/philosophy/free-sw.html\">Free Software</a> community that exists and grows only because of the help of many volunteers that donate their time and effort. KDE is always looking for new volunteers and contributions, whether it is help with coding, bug fixing or reporting, writing documentation, translations, promotion, money, etc. All contributions are gratefully appreciated and eagerly accepted. Please read through the <a href=\"https://kde.org/community/donations/\">Supporting KDE page</a> for further information or become a KDE e.V. supporting member through our <a href=\"https://kde.org/community/donations/\">Join the Game</a> initiative.</p><p align=\"justify\">KDE is an international technology team that creates free and open source software for desktop and portable computing. Among KDE’s products are a modern desktop system for Linux and UNIX platforms, comprehensive office productivity and groupware suites and hundreds of software titles in many categories including Internet and web applications, multimedia, entertainment, educational, graphics and software development. KDE software is translated into more than 60 languages and is built with ease of use and modern accessibility principles in mind. KDE’s full-featured applications run natively on Linux, BSD, Windows, Haiku, and macOS.</p>","contentLength":1271,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/linux/comments/1j9hn5a/kde_plasma_633_bugfix_release_for_march/"},{"title":"I'm frustrated, but positive about the future - my experience with Linux","url":"https://www.reddit.com/r/linux/comments/1j99ybp/im_frustrated_but_positive_about_the_future_my/","date":1741750093,"author":"/u/Helios5584","guid":343,"unread":true,"content":"<p>I recently decided to take a deep dive into Linux and its many distro's. Due to the rapid degrading of the Windows experience; I wanted something clean, free of bloat, and most importantly, able to run my video games without hassle.</p><p>I spent many minutes researching and deciding which distro to go with and landed on Nobara. It was love a first site. The interface was kinda like Windows, the default package manager was simple, and the system felt quick and snappy. </p><p>I had previously tried Linux 5-8 years ago, and my experience back then was pretty negative. Some of my devices were not properly working (due to Pulse Audio) and I could not get them to work. Believe me, I really tried to get into it and fix the issues. With Nobara, everything worked right out of the gate and worked well.</p><p>I was super hyped with this and was loving Linux. Then came the games.</p><p>I had recently been playing Kingdom Come Deliverance 2 on Windows and that was the first game I tried installing. I grabbed the latest GE version of proton from Proton Plus, enabled the settings in Steam, and went about downloading the game. It launched great and framerates were smooth. However, upon loading into my save, I started getting firefly artifacting (tiny white boxes randomly appearing and disappearing in the game. I scoured forums, downgraded Mesa drivers, change cpupower governor's, and even went as far as flashing my BIO's. Nothing worked. According to forums, this is likely due to my AMD GPU (7900xtx) interacting with Linux (My card is not bad as it worked great in Windows).</p><p>Fed up with all the troubleshooting, I decided to try other distro's thinking it might have been Nobara causing the issues. I went to Bazzite: same issue. I went to Ubuntu: same issue. I even built my own Arch install: same issue (this step took a while to build and figure out).</p><p>I came to the conclusion that it must be something with the drivers. At this point, it felt like Windows was calling out to me, asking me to come back to it. The main reason for my computers existence is to play video games and play them well. If it cannot do that in Linux currently, then I feel like I am almost being forced back to Windows. This is post is not throwing shade at the driver developers for Linux or at the amount of work people put into making Linux better, massive kudo's to all of you. However, it just does not feel like an out of the box experience yet where my games just \"work\".</p><p>I plan on trying Linux again in the future. I really enjoyed by time with both Nobara and Bazzite, and I wish to use them full time in the future if the drivers (or whatever was causing the issues) allow. I love open source and everything it stands for. Linux developers: I hope you will keep on putting the effort into making Linux a great place to be, I truly look forward to the Linux future.</p><p>Thanks for coming to my Ted Talk.</p>","contentLength":2866,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"New ARandR alternative for X11 display settings","url":"https://github.com/bossadapt/Display-Settings-Plus","date":1741740732,"author":"/u/bossadapt","guid":344,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/linux/comments/1j96s11/new_arandr_alternative_for_x11_display_settings/"},{"title":"6 Years ago I went all in on Linux, Now I'm just basically an AMD fanboy","url":"https://www.reddit.com/r/linux/comments/1j91f84/6_years_ago_i_went_all_in_on_linux_now_im_just/","date":1741726618,"author":"/u/Chaos_Blades","guid":348,"unread":true,"content":"<p>Lets go all the way back to my first PC. Intel P4 with an ATI X1300 (AGP Slot) Played so much Half Life 1/2 on this baby. Also Command and Conquer Generals. After this It was all Intel/Nvidia up to the GTX 1080. This is when I switched to linux because finally Proton. Quickly did I realize Nvidia GPUs on Linux were a problem. Especially once I wanted an HTPC with Holo ISO. This is when I went to the 5950X and 6900XT. Fantastic experience, has aged like fine wine. Just being part on the Linux community and looking at the Nvidia situation... Worse performance compared to Windows, tons of game specific bugs, Wayland issues, taking months to get driver issues fix, driver updates seem to break as much as they fix. So other than the HDMI 2.1 situation with AMD it has been smooth sailing. HDMI situation is more problems with HDMI Forum and TV makers not putting DisplayPort on TVs so I don't blame AMD for this at all. New GPUs just came out and I am not even considering or looking at what Nvidia is doing. Now lets talk about what is making me realize I am basically just an AMD fanboy at this point. I also have a TrueNAS server I have been running for over a decade (FreeNAS 9.2). Which other than a short period of time I was using an AMD Opteron CPU has also traditionally been Intel/Nvidia. That leads us to today. I am about to go out and upgrade a perfectly working Nvidia Quadro M2000 with an AMD Radeon Pro W6400 only because Nvidia driver (reoccurring theme) has issues with locking up SPICE remote desktop instance. Now while I was trying to find a fix for this problem I decided to do a little research for a motherboard/CPU upgrade and low and behold The best price to performance and power savings is a used 2nd gen AMD EPYC to replace my dual socket E5-2680 v3s (I need a lot of PCI-E). At this point the only Intel/Nvidia parts I have is a Quadro P4000 for Plex transcoding and an Intel Atom C3758R in my pfSense box. I also have a Framework 16 and guess what, all AMD.</p><p>So TLDR, Nvidia sucks on Linux by pretty much every metric other than video encoding and decoding. Intel GPUs are not as fast as AMD for gaming and maybe one day Intel Arc Pro (A60?) will replace my Quadro P4000 but that day is not today. Intel CPUs just are not as good as AMD right now as far as I am concerned or maybe I am truly a fanboy at this point.</p><p>Also if anybody is wondering by current distros of choice are... TrueNAS SCALE<p> Bazzite (KDE, until COSMIC is stable) (Desktop, Laptop, HTPC) BIG Pop!_OS fan, just not a good distro right now. Also I have kind of fallen in love with immutable fedora.</p></p>","contentLength":2597,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"CLI latin/Catholic bible reader with an interactive mode.","url":"https://gitlab.com/gee.8ruhs/writteninc/-/raw/main/latinbible.c","date":1741722031,"author":"/u/Beautiful_Crab6670","guid":345,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/linux/comments/1j8zkg6/cli_latincatholic_bible_reader_with_an/"}],"tags":["dev","reddit"]}