{"id":"AXJnNj1p7gNGHeShbM5NH2qrEU51AXyHm","title":"Julia Evans","displayTitle":"Dev - Julia Evans","url":"https://jvns.ca/atom.xml","feedLink":"https://jvns.ca/atom.xml","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":1,"items":[{"title":"Some notes on starting to use Django","url":"https://jvns.ca/blog/2026/01/27/some-notes-on-starting-to-use-django/","date":1769472000,"author":"Julia Evans","guid":1,"unread":true,"content":"<p>Hello! One of my favourite things is starting to learn an\nOld Boring Technology that I’ve never tried before but that has been around for\n20+ years. It feels really good when every problem I’m ever going to have has\nbeen solved already 1000 times and I can just get stuff done easily.</p><p>I’ve thought it would be cool to learn a popular web framework like\nRails or Django or Laravel for a long time, but I’d never really managed to\nmake it happen. But I started learning Django to make a website a few months\nback, I’ve been liking it so far, and here are a few quick notes!</p><p>I spent some time <a href=\"https://jvns.ca/blog/2020/11/09/day-1--a-little-rails-/\">trying to learn Rails</a> in 2020,\nand while it was cool and I really wanted to like Rails (the Ruby community is great!),\nI found that if I left my Rails project alone for months, when I came\nback to it it was hard for me to remember how to get anything done because\n(for example) if it says  in your , on its own\nthat doesn’t tell you where the  routes are configured, you need to\nremember or look up the convention.</p><p>Being able to abandon a project for months or years and then come back to it is\nreally important to me (that’s how all my projects work!), and Django feels easier\nto me because things are more explicit.</p><p>In my small Django project it feels like I just have 5 main files (other\nthan the settings files): , , , , and\n, and if I want to know where something else is (like an HTML template)\nis then it’s usually explicitly referenced from one of those files.</p><p>For this project I wanted to have an admin interface to manually edit or view\nsome of the data in the database. Django has a really nice built-in admin\ninterface, and I can customize it with just a little bit of code.</p><p>For example, here’s part of one of my admin classes, which sets up which fields\nto display in the “list” view,  which field to search on, and how to order them\nby default.</p><pre><code>@admin.register(Zine)\nclass ZineAdmin(admin.ModelAdmin):\n    list_display = [\"name\", \"publication_date\", \"free\", \"slug\", \"image_preview\"]\n    search_fields = [\"name\", \"slug\"]\n    readonly_fields = [\"image_preview\"]\n    ordering = [\"-publication_date\"]\n</code></pre><p>In the past my attitude has been “ORMs? Who needs them? I can just write my own SQL queries!”.\nI’ve been enjoying Django’s ORM so far though, and I think it’s cool how Django\nuses  to represent a , like this:</p><pre><code>Zine.objects\n    .exclude(product__order__email_hash=email_hash)\n</code></pre><p>This query involves 5 tables: , , , , and .\nTo make this work I just had to tell Django that there’s a \nrelating “orders” and “products”, and another  relating\n“zines”, and “products”, so that it knows how to connect , , .</p><p>I definitely  write that query, but writing <code>product__order__email_hash</code> is\na lot less typing, it feels a lot easier to read, and honestly I think it would\ntake me a little while to figure out how to construct the query\n(which needs to do a few other things than just those joins).</p><p>I have zero concern about the performance of my ORM-generated queries so I’m\npretty excited about ORMs for now, though I’m sure I’ll find things to be\nfrustrated with eventually.</p><p>The other great thing about the ORM is migrations!</p><p>If I add, delete, or change a field in , Django will automatically\ngenerate a migration script like <code>migrations/0006_delete_imageblob.py</code>.</p><p>I assume that I could edit those scripts if I wanted, but so far I’ve just\nbeen running the generated scripts with no change and it’s been going great. It\nreally feels like magic.</p><p>I’m realizing that being able to do migrations easily is important for me right\nnow because I’m changing my data model fairly often as I figure out how I want\nit to work.</p><p>For example the <a href=\"https://docs.djangoproject.com/en/6.0/topics/db/models/\">intro to models</a>\nlists the most important common fields you might want to set when using the ORM.</p><p>After having a bad experience trying to operate Postgres and not being able to\nunderstand what was going on, I decided to run all of my small websites with\nSQLite instead. It’s been going way better, and I love being able to backup by\njust doing a  and then copying the resulting single file.</p><p>I think it should be fine because I’m expecting the site to have a few hundred\nwrites per day at most, much less than <a href=\"https://messwithdns.net/\">Mess with DNS</a>\nwhich has a lot more of writes and has been working well (though the writes are\nsplit across 3 different SQLite databases).</p><h3>built in email (and more)</h3><p>Django seems to be very “batteries-included”, which I love – if I want CSRF\nprotection, or a , or I want to send email, it’s all\nin there!</p><p>For example, I wanted to save the emails Django sends to a file in dev mode (so\nthat it didn’t send real email to real people), which was just a little bit\nof configuration.</p><p>I just put this :</p><pre><code>EMAIL_BACKEND = \"django.core.mail.backends.filebased.EmailBackend\"\nEMAIL_FILE_PATH = BASE_DIR / \"emails\"\n</code></pre><p>and then set up the production email like this in </p><pre><code>EMAIL_BACKEND = \"django.core.mail.backends.smtp.EmailBackend\"\nEMAIL_HOST = \"smtp.whatever.com\"\nEMAIL_PORT = 587\nEMAIL_USE_TLS = True\nEMAIL_HOST_USER = \"xxxx\"\nEMAIL_HOST_PASSWORD = os.getenv('EMAIL_API_KEY')\n</code></pre><p>That made me feel like if I want some other basic website feature, there’s\nlikely to be an easy way to do it built into Django already.</p><h3>the settings file still feels like a lot</h3><p>I’m still a bit intimidated by the  file: Django’s settings system\nworks by setting a bunch of global variables in a file, and I feel a bit\nstressed about… what if I make a typo in the name of one of those variables?\nHow will I know? What if I type <code>WSGI_APPLICATOIN = \"config.wsgi.application\"</code>\ninstead of ?</p><p>I guess I’ve gotten used to having a Python language server tell me when I’ve\nmade a typo and so now it feels a bit disorienting when I can’t rely on the\nlanguage server support.</p><p>I haven’t really successfully used an actual web framework for a project before\n(right now almost all of my websites are either a single Go binary or static\nsites), so I’m interested in seeing how it goes!</p><p>There’s still lots for me to learn about, I still haven’t really gotten into\nDjango’s form validation tooling or authentication systems.</p><p>Thanks to Marco Rogers for convincing me to give ORMs a chance.</p>","contentLength":6120,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}],"tags":["dev"]}