{"id":"BRWJ2YmdUFoz1jUcCg5P21RYgb4CmSRDHkju2uMS7GB1447d","title":"Mouse Vs Python","displayTitle":"Dev - Python Blog","url":"https://blog.pythonlibrary.org/feed","feedLink":"https://www.blog.pythonlibrary.org/","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":2,"items":[{"title":"Python Typing Book Kickstarter","url":"https://www.blog.pythonlibrary.org/2026/02/03/python-typing-book-kickstarter/","date":1770142620,"author":"Mike","guid":393,"unread":true,"content":"<p>Python has had type hinting support since Python 3.5, over TEN years ago! However, Python’s type annotations have changed repeatedly over the years. In&nbsp;<strong>Python Typing: Type Checking for Python Programmers</strong>, you will learn all you need to know to add type hints to your Python applications effectively.</p><p>You will also learn how to use Python type checkers, configure them, and set them up in pre-commit or GitHub Actions. This knowledge will give you the power to check your code and your team’s code automatically before merging, hopefully catching defects before they make it into your products.</p><p>You will learn all about Python’s support for type hinting (annotations). Specifically, you will learn about the following topics:</p><ul><li>Annotating Decorators and Generators</li><li>Using Mypy for type checking</li><li>Using ty for type checking</li></ul><p>There are several different rewards you can get in this Kickstarter:</p><ul><li>A signed paperback copy of the book (See Stretch Goals)</li><li>An eBook copy of the book in PDF and ePub</li><li>A t-shirt with the cover art from the book (See Stretch Goals)</li></ul>","contentLength":1045,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"New Book: Vibe Coding Video Games with Python","url":"https://www.blog.pythonlibrary.org/2026/01/19/new-book-vibe-coding-video-games-with-python/","date":1768832739,"author":"Mike","guid":392,"unread":true,"content":"<p>My latest book,&nbsp;<strong>Vibe Coding Video Games with Python,</strong>&nbsp;is now available as an eBook. The paperback will be coming soon, hopefully by mid-February at the latest. The book is around 183 pages in length and is 6×9” in size.</p><p>In this book, you will learn how to use artificial intelligence to create mini-games. You will attempt to recreate the look and feel of various classic video games. The intention is not to violate copyright or anything of the sort, but instead to learn the limitations and the power of AI.</p><p>Instead, you will simply be learning about whether or not you can use AI to help you know how to create video games. Can you do it with no previous knowledge, as the AI proponents say? Is it really possible to create something just by writing out questions to the ether?</p><p>You will use various large language models (LLMs), such as Google Gemini, Grok, Mistral, and CoPilot, to create these games. You will discover the differences and similarities between these tools. You may be surprised to find that some tools give much more context than others.</p><p>AI is certainly not a cure-all and is far from perfect. You will quickly discover AI’s limitations and learn some strategies for solving those kinds of issues.</p><p>You’ll be creating “clones” of some popular games. However, these games will only be the first level and may or may not be fully functional.</p><ul><li>Chapter 1 – The Snake Game</li><li>Chapter 3 – Frogger Clone</li><li>Chapter 4 – Space Invaders Clone</li><li>Chapter 5 – Minesweeper Clone</li><li>Chapter 6 – Luna Lander Clone</li><li>Chapter 7 – Asteroids Clone</li><li>Chapter 9 – Pole Position Clone</li><li>Chapter 10 – Connect Four</li><li>Chapter 11 – Adding Sprites</li></ul>","contentLength":1635,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}],"tags":["dev","python"]}