{"id":"CQdwDV8xyajeX5DKoSYfBQhN4kkXBaTmXPYgJyANUWHyjCo5BpHUjy5gJhgngST","title":"Slashdot: Linux","displayTitle":"Dev - Slashdot - Linux","url":"http://rss.slashdot.org/Slashdot/slashdotLinux","feedLink":"https://linux.slashdot.org/","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":11,"items":[{"title":"Oldest Active Linux Distro Slackware Finally Releases Version 15.0","url":"https://linux.slashdot.org/story/26/02/15/0249259/oldest-active-linux-distro-slackware-finally-releases-version-150?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1771176840,"author":"EditorDavid","guid":301,"unread":true,"content":"Created in 1993, Slackware is considered the oldest Linux distro that's still actively maintained. And more than three decades later... there's a new release! (And there's also a Slackware Live Edition that can run from a DVD or USB stick...)\n.\n \n\nSlackware's latest version was released way back in 2016, notes the blog It's FOSS:\n\n\nThe major highlight of Slackware 15 is the addition of the latest Linux Kernel 5.15 LTS. This is a big jump from Linux Kernel 5.10 LTS that we noticed in the beta release. Interestingly, the Slackware team tested hundreds of Linux Kernel versions before settling on Linux Kernel 5.15.19. The release note mentions... \"We finally ended up on kernel version 5.15.19 after Greg Kroah-Hartman confirmed that it would get long-term support until at least October 2023 (and quite probably for longer than that).\" \n\nIn case you are curious, Linux Kernel 5.15 brings in updates like enhanced NTFS driver support and improvements for Intel/AMD processors and Apple's M1 chip. It also adds initial support for Intel 12th gen processors. Overall, with Linux Kernel 5.15 LTS, you should get a good hardware compatibility result for the oldest active Linux distro. \n\n\nSlackware's announcement says \"The challenge this time around was to adopt as much of the good stuff out there as we could without changing the character of the operating system. Keep it familiar, but make it modern.\"\n\n\nAnd boy did we have our work cut out for us. We adopted privileged access management (PAM) finally, as projects we needed dropped support for pure shadow passwords. We switched from ConsoleKit2 to elogind, making it much easier to support software that targets that Other Init System and bringing us up-to-date with the XDG standards. We added support for PipeWire as an alternate to PulseAudio, and for Wayland sessions in addition to X11. Dropped Qt4 and moved entirely to Qt5. Brought in Rust and Python 3. Added many, many new libraries to the system to help support all the various additions. \n\nWe've upgraded to two of the finest desktop environments available today: Xfce 4.16, a fast and lightweight but visually appealing and easy to use desktop environment, and the KDE Plasma 5 graphical workspaces environment, version 5.23.5 (the Plasma 25th Anniversary Edition). This also supports running under Wayland or X11. We still love Sendmail, but have moved it into the /extra directory and made Postfix the default mail handler. The old imapd and ipop3d have been retired and replaced by the much more featureful Dovecot IMAP and POP3 server.\n \n\n\"As usual, the kernel is provided in two flavors, generic and huge,\" according to the release notes. \"The huge kernel contains enough built-in drivers that in most cases an initrd is not needed to boot the system.\" \n\nIf you'd like to support Slackware, there's an official Patreon account.\nAnd the release announcement ends with this personal note:\n\n\nSadly, we lost a couple of good friends during this development cycle and this release is dedicated to them. Erik \"alphageek\" Jan Tromp passed away in 2020 after a long illness... My old friend Brett Person also passed away in 2020. Without Brett, it's possible that there wouldn't be any Slackware as we know it — he's the one who encouraged me to upload it to FTP back in 1993 and served as Slackware's original beta-tester. He was long considered a co-founder of this project. I knew Brett since the days of the Beggar's Banquet BBS in Fargo back in the 1980's... Gonna miss you too, pal. \n\nThanks to long-time Slashdot reader rastos1 for sharing thre news.","contentLength":3576,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Is Linux Mint Burning Out? Developers Consider Longer Release Cycle","url":"https://linux.slashdot.org/story/26/02/11/1821222/is-linux-mint-burning-out-developers-consider-longer-release-cycle?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1770849900,"author":"msmash","guid":316,"unread":true,"content":"BrianFagioli writes: The Linux Mint developers say they are considering adopting a longer development cycle, arguing that the project's current six month cadence plus LMDE releases leaves too little room for deeper work. In a recent update, the team reflected on its incremental philosophy, independence from upstream decisions like Snap, and heavy investment in Cinnamon and XApp. While the release process \"works very well\" and delivers steady improvements, they admit it consumes significant time in testing, fixing, and shipping, potentially capping ambition. \n\nMint's next release will be based on a new Ubuntu LTS, and the team says it is seriously interested in stretching the development window. The stated goal is to free up resources for more substantial development rather than constant release management. Whether this signals bigger technical changes or simply acknowledges bandwidth limits for a small team remains unclear, but it marks a notable rethink of one of desktop Linux's most consistent release rhythms.","contentLength":1027,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Linux 7.0 Kernel Confirmed By Linus Torvalds, Expected In Mid-April 2026","url":"https://linux.slashdot.org/story/26/02/09/2034222/linux-70-kernel-confirmed-by-linus-torvalds-expected-in-mid-april-2026?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1770677100,"author":"msmash","guid":315,"unread":true,"content":"An anonymous reader writes: Linus Torvalds has confirmed the next major kernel series as Linux 7.0, reports Linux news website 9to5Linux.com: \"So there you have it, the Linux 6.x era has ended with today's Linux 6.19 kernel release, and a new one will begin with Linux 7.0, which is expected in mid-April 2026. The merge window for Linux 7.0 will open tomorrow, February 9th, and the first Release Candidate (RC) milestone is expected on February 22nd, 2026.\"","contentLength":459,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Linux Kernel Developer Chris Mason's New Initiative: AI Prompts for Code Reviews","url":"https://linux.slashdot.org/story/26/02/02/0718228/linux-kernel-developer-chris-masons-new-initiative-ai-prompts-for-code-reviews?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1770024840,"author":"EditorDavid","guid":314,"unread":true,"content":"Phoronix reports:\n\n\nChris Mason, the longtime Linux kernel developer most known for being the creator of Btrfs, has been working on a Git repository with AI review prompts he has been working on for LLM-assisted code review of Linux kernel patches. This initiative has been happening for some weeks now while the latest work was posted today for comments... The Meta engineer has been investing a lot of effort into making this AI/LLM-assisted code review accurate and useful to upstream Linux kernel stakeholders. It's already shown positive results and with the current pace it looks like it could play a helpful part in Linux kernel code review moving forward. \n\n\"I'm hoping to get some feedback on changes I pushed today that break the review up into individual tasks...\" Mason wrote on the Linux kernel mailing list. \"Using tasks allows us to break up large diffs into smaller chunks, and review each chunk individually. This ends up using fewer tokens a lot of the time, because we're not sending context back and forth for the entire diff with every turn. It also catches more bugs all around.\"","contentLength":1101,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Author of Systemd Quits Microsoft To Prove Linux Can Be Trusted","url":"https://linux.slashdot.org/story/26/01/30/235231/author-of-systemd-quits-microsoft-to-prove-linux-can-be-trusted?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1769853600,"author":"BeauHD","guid":313,"unread":true,"content":"Lennart Poettering has left Microsoft to co-found Amutable, a new Berlin-based company aiming to bring cryptographically verifiable integrity and deterministic trust guarantees to Linux systems. He said in a post on Mastodon that his \"role in upstream maintenance for the Linux kernel will continue as it always has.\" Poettering will also continue to remain deeply involved in the systemd ecosystem. The Register reports: Linux celeb Lennart Poettering has left Microsoft and co-founded a new company, Amutable, with Chris Kuhl and Christian Brauner. Poettering is best known for systemd. After a lengthy stint at Red Hat, he joined Microsoft in 2022. Kuhl was a Microsoft employee until last year, and Brauner, who also joined Microsoft in 2022, left this month. [...]\n \nIt is unclear why Poettering decided to leave Microsoft. We asked the company to comment but have not received a response. Other than the announcement of systemd 259 in December, Poettering's blog has been silent on the matter, aside from the announcement of Amutable this week. In its first post, the Amutable team wrote: \"Over the coming months, we'll be pouring foundations for verification and building robust capabilities on top.\"\n \nIt will be interesting to see what form this takes. In addition to Poettering, the lead developer of systemd, Amutable's team includes contributors and maintainers for projects such as Linux, Kubernetes, and containerd. Its members are also very familiar with the likes of Debian, Fedora, SUSE, and Ubuntu.","contentLength":1516,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Linux Gaming Developers Join Forces To Form the Open Gaming Collective","url":"https://games.slashdot.org/story/26/01/29/2252203/linux-gaming-developers-join-forces-to-form-the-open-gaming-collective?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1769733900,"author":"BeauHD","guid":312,"unread":true,"content":"A group of Linux gaming-focused distros and developers have formed the Open Gaming Collective to pool work on shared components like kernels, input systems, and Valve tooling. The Verge reports: Universal Blue, developer of the gaming-focused Linux distribution Bazzite, announced on Wednesday that its helping to form the OGC with several other groups, which will collaborate on improvements to the Linux gaming ecosystem and âoecentralize efforts around critical components like kernel patches, input tooling, and essential gaming packages such as gamescope.\" The other founding members of the OGC include Nobara, ChimeraOS, Playtron, Fyra Labs, PikaOS, ShadowBlip, and Asus Linux.\n \n[...] It's worth noting that this will mean some changes to Bazzite, which is switching to the OGC kernel, replacing HHD with InputPlumber as its input framework, and integrating features like RGB and fan control into the Steam UI. Bazzite also added that, \"We'll be sharing patches we've made to various Valve packages with the OGC and attempting to upstream everything we can.\"","contentLength":1066,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Nvidia GeForce NOW Is Now Available Natively On Linux","url":"https://games.slashdot.org/story/26/01/29/2152239/nvidia-geforce-now-is-now-available-natively-on-linux?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1769726400,"author":"BeauHD","guid":311,"unread":true,"content":"NVIDIA has officially launched a native GeForce NOW client for Linux as a Flatpak, giving Linux gamers access to cloud-rendered RTX gaming. Phoronix reports: While confined to a Flatpak, for now NVIDIA is just \"officially\" supporting it on Ubuntu 24.04 LTS and later. Granted, thanks to Flatpak it should run on other non-Ubuntu distributions too but in terms of the official support and where they are qualifying their builds they are limiting it just to Ubuntu 24.04 LTS and later. [...] At launch the Flatpak build is also just for x86_64 Linux with no AArch64 Linux builds or similar at this time.\n \nRunning GeForce NOW on Linux while games are rendered in NVIDIA's cloud with Blackwell GPUs, you still need to be using a modern GPU with H.264 or H.265 Vulkan Video support NVIDIA isn't yet supporting Vulkan Video AV1 with GeForce NOW on Linux but just H.264/H.265. If you are using NVIDIA graphics the NVIDIA R580 series or newer is recommended while using the X.Org session. If you are using Intel or AMD Radeon graphics, Mesa 24.2+ is recommended and using the Wayland session.\n \nWhen you are up and running with GeForce NOW on Linux, you have access to over 4,500 games. The free tier of GeForce NOW provides standard access to the gaming servers and limited session caps for an introductory-level experience. It's with the performance tier where you can enjoy RTX ray-tracing and 1440p @ 60 FPS performance and up to six hour sessions. With GeForce NOW's Ultimate tier is where you are running on GeForce RTX 5080 GPU servers with support for up to 5K @ 120 FPS gaming or 1080p @ 360 FPS with up to eight hour gaming sessions in length.","contentLength":1646,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Kernel Community Drafts a Plan For Replacing Linus Torvalds","url":"https://linux.slashdot.org/story/26/01/28/2253239/kernel-community-drafts-a-plan-for-replacing-linus-torvalds?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1769649900,"author":"BeauHD","guid":310,"unread":true,"content":"The Linux kernel community has formalized a continuity plan for the day Linus Torvalds eventually steps aside, defining how the process would work to replace him as the top-level maintainer. ZDNet's Steven Vaughan-Nichols reports: The new \"plan for a plan,\" drafted by longtime kernel contributor Dan Williams, was discussed at the latest Linux Kernel Maintainer Summit in Tokyo, where he introduced it as \"an uplifting subject tied to our eventual march toward death.\" Torvalds added, in our conversation, that \"part of the reason it came up this time around was that my previous contract with Linux Foundation ended Q3 last year, and people on the Linux Foundation Technical Advisory Board had been aware of that. Of course, they were also aware that we'd renewed the contract, but it meant that it had been discussed.\"\n \nThe plan stops short of naming a single heir. Instead, it creates an explicit process for selecting one or more maintainers to take over the top-level Linux repository in a worst-case or orderly-transition scenario, including convening a conclave to weigh options and maximize long-term project health. One maintainer in Tokyo jokingly suggested that the group, like the conclave that selects a new pope, be locked in a room and that a puff of white smoke be sent out when a decision was reached.\n \nThe document frames this as a way to protect against the classic \"bus factor\" problem. That is, what happens to a project if its leader is hit by a bus? Torvalds' central role today means the project currently assumes a bus-factor of one, where a single person's exit could, in theory, destabilize merges and final releases. In practice, as Torvalds and other top maintainers have discussed, the job of top penguin would almost certainly currently go to Greg Kroah-Hartman, the stable-branch Linux kernel maintainer. Responding to the suggestion that the backup replacement would be Greg KH, Torvalds said: \"But the thing is, Greg hasn't always been Greg. Before Greg, there was Andrew Morton and Alan Cox. After Greg, there will be Shannon and Steve. The real issue is you have to have a person or a group of people that the development community can trust, and part of trust is fundamentally about having been around for long enough that people know how you work, but long enough does not mean to be 30 years.\"","contentLength":2335,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"The Android 'NexPhone': Linux on Demand, Dual-Boots Into Windows 11 - and Transforms Into a Workstation","url":"https://mobile.slashdot.org/story/26/01/25/060240/the-android-nexphone-linux-on-demand-dual-boots-into-windows-11---and-transforms-into-a-workstation?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1769358840,"author":"EditorDavid","guid":309,"unread":true,"content":"The \"NexDock\" (from Nex Computer) already turns your phone into a laptop workstation. Purism chose it as the docking station for their Librem 5 phones. \n\nBut now Nex is offering its own smartphone \"that runs Android 16, launches Debian, and dual-boots into Windows 11,\" according to the blog It's FOSS:\n\n\nFourteen years after the first concept video was teased, the NexPhone is here, powered by a Qualcomm QCM6490, which, the keen-eyed among you will remember from the now-discontinued Fairphone 5. \n\nBy 2026 standards, it's dated hardware, but Nex Computer doesn't seem to be overselling it, as they expect the NexPhone to be a secondary or backup phone, not a flagship contender. The phone includes an Adreno 643 GPU, 12GB of RAM, and 256GB of internal storage that can be expanded up to 512GB via a microSD card. \n\nIn terms of software, the NexPhone boots into NexOS, a bloatware-free and minimal Android 16 system, with Debian running as an app with GPU acceleration, and Windows 11 being the dual-boot option that requires a restart to access. [\"And because the default Windows interface isn't designed for a handheld screen, we built our own Mobile UI from the ground up to make Windows far easier to navigate on a phone,\" notes a blog post from Nex founder/CEO Emre Kosmaz]. \n\nAnd, before I forget, you can plug the NexPhone into a USB-C or HDMI display, add a keyboard and mouse to transform it into a desktop workstation. \nThere's a camera plus \"a comprehensive suite of sensors,\" according to the article, \"that includes a fingerprint scanner, accelerometer, magnetometer, gyroscope, ambient light sensor, and proximity sensor.... \n\n\"NexPhone is slated for a Q3 2026 release (July-September)...\" \n\nBack in 2012, explains Nex founder/CEO Emre Kosmaz, \"most investors weren't excited about funding new hardware. One VC even told us, 'I don't understand why anyone buys anything other than Apple'...\"\n\n\nOver the last decade, we kept building and shipping — six generations of NexDock — helping customers turn phones into laptop-like setups (display + keyboard + trackpad). And now the industry is catching up faster than ever. With Android 16, desktop-style experiences are becoming more native and more mainstream. That momentum is exactly why NexPhone makes sense today... \n\nThank you for being part of this journey. With your support, I hope NexPhone can help move us toward a world where phones truly replace laptops and PCs — more often, more naturally, and for more people.","contentLength":2492,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Former Canonical Developer Advocate Warns Snap Store Isn't Safe After Slow Responses to Malware Reports","url":"https://linux.slashdot.org/story/26/01/24/2332205/former-canonical-developer-advocate-warns-snap-store-isnt-safe-after-slow-responses-to-malware-reports?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1769330640,"author":"EditorDavid","guid":308,"unread":true,"content":"An anonymous reader shared this article from the blog Linuxiac\nIn a blog post, Alan Pope, a longtime Ubuntu community figure and former Canonical employee who remains an active Snap publisher... [warns of] a persistent campaign of malicious snaps impersonating cryptocurrency wallet applications. These fake apps typically mimic well-known projects such as Exodus, Ledger Live, or Trust Wallet, prompting users to enter wallet recovery phrases, which are then transmitted to attackers, resulting in drained funds. \nThe perpetrators had originally used similar-looking characters from other alphabets to mimic other app listings, then began uploading \"revisions\" to other innocuous-seeming (approved) apps that would transform their original listing into that of a fake crypto wallet app. \n\nBut now they're re-registering expired domains to take over existing Snap Store accounts, which Pope calls \"a significant escalation...\"\n\nI worked for Canonical between 2011 and 2021 as an Engineering Manager, Community Manager, and Developer Advocate. I was a strong advocate for snap packages and the Snap Store. While I left the company nearly five years ago, I still maintain nearly 50 packages in the Snap Store, with thousands of users... Personally, I want the Snap Store to be successful, and for users to be confident that the packages they install are trustworthy and safe. \n\n\nCurrently, that confidence isn't warranted, which is a problem for desktop Linux users who install snap packages. I report every bad snap I encounter, and I know other security professionals do the same — even though doing so results in no action for days sometimes... To be clear: none of this should be seen as an attack on the Snap Store, Canonical, or the engineers working on these problems. I'm raising awareness of an issue that exists, because I want it fixed... But pretending there isn't a problem helps nobody.","contentLength":1900,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"T2/Linux Brings a Flagship KDE Plasma Linux Desktop to RISC-V and ARM64","url":"https://linux.slashdot.org/story/26/01/17/0610216/t2linux-brings-a-flagship-kde-plasma-linux-desktop-to-risc-v-and-arm64?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1768667640,"author":"EditorDavid","guid":307,"unread":true,"content":"T2 SDE \"is not just a regular Linux distribution,\" explains its repository on GitHub. \"It is a flexible Open Source System Development Environment or Distribution Build Kit. Others might even name it Meta Distribution. T2 allows the creation of custom distributions with state of the art technology, up-to-date packages and integrated support for cross compilation.\" \n\n\nAnd now after \"a decade of deep focus on embedded and server systems,\" T2 SDE Linux \"is back to the Desktop,\" according to its web site, calling the new \"T2 Desktop\" flavour \"ready for everyday home and office use!\"\n\nBuilt on the latest KDE Plasma, systemd, and Wayland, the new T2 Desktop flavour delivers a modern, clean, and performant experience while retaining the project's trademark portability and reproducible cross-compilation across architectures. \n\nT2 Desktop targets x86_64, arm64, and riscv64, delivering \"a fully polished, streamlined out-of-the-box experience,\" according to project lead René Rebe (also long-time Slashdot reader ReneR):\n\nI&gt;[T2 Desktop] delivered a full KDE Plasma desktop on RISC-V, reproducibly cross-compiled from source using T2 SDE Linux. The desktop spans more than 600 packages — from toolchain to Qt and KDE and targets a next-generation RVA23 RISC-V flagship desktop, including full multimedia support and AMD RDNA GPU acceleration under Wayland. \n\nAs a parallel milestone, the same fully reproducible desktop stack is now also landing on Qualcomm X1 ARM64 platforms, highlighting T2 SDE's architecture-independent approach and positioning both RISC-V and ARM64 as serious, first-class Linux desktop contenders.","contentLength":1626,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}],"tags":["dev","slashdot"]}