{"id":"USgKoryE83j5SszZjyr68sh7DjLn4j6MWUagcNjQES7kQ1n2HXebXN4bJpBn8stf6LqSMrbny1unc4R1hi6qmf","title":"top scoring links : golang","displayTitle":"Reddit - Go","url":"https://www.reddit.com/r/golang/top/.rss?sort=top&t=day&limit=6","feedLink":"https://www.reddit.com/r/golang/top/?sort=top&t=day&limit=6","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":6,"items":[{"title":"I’ve made a tool to keep dotfiles and system configs in sync with a Git repo","url":"https://github.com/senotrusov/etcdotica","date":1771196079,"author":"/u/senotru","guid":288,"unread":true,"content":"<p>I built a small tool called etcdotica for keeping dotfiles and small system configs in sync with a Git or other VCS repository that mirrors your machine's filesystem layout.</p><p>I used Go because it fits the job perfectly: it’s fast, pleasant to work with the filesystem API, and its explicit error handling lets me handle every error precisely and clearly.</p><p>I was not happy with many existing tools in that space.</p><p>The idea is simple: your repo looks like your system. A file at home/.bashrc maps to ~/.bashrc, while root/etc/... maps under /etc. Running the tool applies changes from the repo to the machine, and optionally collects newer edits made directly on the machine back into the repo. Deleting a file in the repo prunes it from the destination, so the state converges instead of drifting.</p><ul><li>Syncs files from a source tree to a destination directory</li><li>Collect mode to pull newer destination edits back into the repo</li><li>Prunes removed files using a tracked state file</li><li>Managed \"sections\" that insert named blocks into existing files instead of replacing them</li><li>Watch mode to apply changes continuously, suitable for a user systemd service</li><li>Safe concurrent runs via file locking</li><li>Permission control: subtract bits with umask, add bits with a simple flag to enable world readability</li><li>Automatic executable bits for selected directories like bin/</li><li>Follows source symlinks, follows destination symlinks to folders, but replaces destination symlinked files with real files</li></ul><p>The sections feature is particularly useful for shared files such as fstab or hosts. You can keep portable snippets in the repo, and they get merged into the target file, with the ability to later update or remove them as the source file gets updated or removed.</p><p>I wanted something light with predictable behavior.</p><p>A typical workflow is to clone the repo (for example ~/.dotfiles), run the tool once for user files, once with sudo for system files, and optionally keep a watch service running so edits in the repo materialize on the machine.</p><p>I'd love feedback on the idea.</p>","contentLength":2014,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/golang/comments/1r5sq6q/ive_made_a_tool_to_keep_dotfiles_and_system/"},{"title":"Looked at the official Go client for Max Bot API. Rewrote it over the weekend","url":"https://www.reddit.com/r/golang/comments/1r5skze/looked_at_the_official_go_client_for_max_bot_api/","date":1771195718,"author":"/u/krasava_wtf","guid":287,"unread":true,"content":"<p>Had some free time this weekend, decided to try Max Bot API — a messenger by VK, positioned as a Telegram alternative. Opened the official Go client and... to put it mildly, I was shocked. Spent the first 30 minutes debugging why an inline button under a message disappears on its own. Send a message with an inline button — works fine. Edit just the text — button vanishes. Turns out </p><p>``<code>go type NewMessageBody struct { Text string</code>json:\"text,omitempty\"<code> Attachments []interface{}</code>json:\"attachments\"` // ← no omitempty! }</p><p>func NewMessage() *Message { return &amp;Message{message: &amp;schemes.NewMessageBody{ Attachments: []interface{}{}, // ← always empty slice }} } ``omitempty`, the empty slice is sent as `\"attachments\": []`. The API interprets this as \"delete all attachments\". You just want to change the text — and your buttons silently disappear. </p><p>And that's just the beginning: </p><p>- `GetChatID()` for callbacks returns 0 — the ID is available via `Message.Recipient.ChatId`, but the method ignores it. You send a response to nowhere - 3 different loggers (`log`, `slog`, `zerolog`) in one codebase — the library writes to stdout instead of returning errors. 30+ places where errors are swallowed<p> - `int64` → `int` casts — breaks on 32-bit platforms</p> - No `context.Context` in upload methods </p><p>Rewrote the client from scratch over the weekend: - Zero dependencies — stdlib only<p> - All errors are returned, nothing is logged</p> - `context.Context` everywhere<p> - Type-safe constructors for buttons and attachments</p> - Testable via `httptest.Server` </p><p>Can't understand how an entire team ships this kind of Go code. Feedback welcome. </p>","contentLength":1632,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"New to GO, where do I start?","url":"https://www.reddit.com/r/golang/comments/1r5qvs1/new_to_go_where_do_i_start/","date":1771191534,"author":"/u/Otherwise-Ask4947","guid":289,"unread":true,"content":"<p>Basically what the title says. I went through documentation and tutorial parts from official website.</p><p>For reference I’m sr. Nest and Next developer, so I do have prior experience in programming.</p><p>How do I get at least on JR level? Start by building smth from scratch, or I need grasp of specific concepts?</p>","contentLength":304,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"What's the best way to control Chrome from Go?","url":"http://github.com/pinchtab/pinchtab","date":1771180072,"author":"/u/Fit_Audience_7470","guid":286,"unread":true,"content":"<p>I built a small HTTP server (~1100 LOC) that wraps chromedp to give AI agents browser control. It works, but I'm wondering if I'm using the right tool for the job.</p><p>•  for CDP communication</p><p>• Raw DOM.resolveNode / Runtime.callFunctionOn for element interaction</p><p>• Accessibility.getFullAXTree for the a11y tree (main interface — cheaper than screenshots for AI)</p><p>• Single sync.Mutex per tab context</p><p>• chromedp's context-per-tab model — managing lifecycles gets messy</p><p>• No built-in way to get the accessibility tree (had to use raw CDP calls)</p><p>• Stealth flags keep getting deprecated by Chrome</p><p><strong>Is chromedp still the best option?</strong> I've looked at:</p><p>• Rod (go-rod/rod) — supposedly simpler API?</p><p>• Calling Playwright via subprocess — feels wrong from Go</p><p>• Direct WebSocket to Chrome DevTools — maximum control but maintaining it yourself</p><p>Anyone using something different? Or is chromedp + raw CDP the way to go?</p>","contentLength":917,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/golang/comments/1r5lzmy/whats_the_best_way_to_control_chrome_from_go/"},{"title":"Lunar: a self-hosted Golang+Lua FaaS for personal use.","url":"https://github.com/dimiro1/lunar","date":1771153529,"author":"/u/claudemiro","guid":291,"unread":true,"content":"<p>Last holidays, I wanted to automate a few things and ended up creating Lunar, which is a lightweight faas platform, sqlite backed, and single binary deployment, where functions are written in Lua. </p><p>Let me know what you think, and feel free to contribute to the project; you can find a few ideas listed in the contributions file.</p>","contentLength":327,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/golang/comments/1r5c00m/lunar_a_selfhosted_golanglua_faas_for_personal_use/"},{"title":"You like typing and you are a fan terminal ? You will love this ? The new version of COUIK is out with new UI and new features","url":"https://www.reddit.com/r/golang/comments/1r59r3c/you_like_typing_and_you_are_a_fan_terminal_you/","date":1771145138,"author":"/u/TemporaryStrong6968","guid":290,"unread":true,"content":"<div><p>- You get a little chart at the end to see how you did over time - Logo configuration - Command palette guide (CTRL + P)</p></div>   submitted by   <a href=\"https://www.reddit.com/user/TemporaryStrong6968\"> /u/TemporaryStrong6968 </a>","contentLength":162,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}],"tags":["dev","reddit","go"]}