{"id":"VMK7D8tQvwsLtnxKHzNdF9c4Yhtuqm","title":"Hacker News: Best","displayTitle":"HN","url":"https://hnrss.org/best","feedLink":"https://news.ycombinator.com/best","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":30,"items":[{"title":"I’m joining OpenAI","url":"https://steipete.me/posts/2026/openclaw","date":1771192455,"author":"mfiguiere","guid":263,"unread":true,"content":"<p><strong>tl;dr: I’m joining OpenAI to work on bringing agents to everyone. <a href=\"https://openclaw.ai/\">OpenClaw</a> will move to a foundation and stay open and independent.</strong></p><p>The last month was a whirlwind, never would I have expected that my playground project would create such waves. The internet got weird again, and it’s been incredibly fun to see how my work inspired so many people around the world.</p><p>There’s an endless array of possibilities that opened up for me, countless people trying to push me into various directions, giving me advice, asking how they can invest or what I will do. Saying it’s overwhelming is an understatement.</p><p>When I started exploring AI, my goal was to have fun and inspire people. And here we are, the lobster is taking over the world. My next mission is to build an agent that even my mum can use. That’ll need a much broader change, a lot more thought on how to do it safely, and access to the very latest models and research.</p><p>Yes, I could totally see how OpenClaw could become a huge company. And no, it’s not really exciting for me. I’m a builder at heart. I did the whole creating-a-company game already, poured 13 years of my life into it and learned a lot. What I want is to change the world, not build a large company and teaming up with OpenAI is the fastest way to bring this to everyone.</p><p>I spent last week in San Francisco talking with the major labs, getting access to people and unreleased research, and it’s been inspiring on all fronts. I want to thank all the folks I talked to this week and am thankful for the opportunities.</p><p>It’s always been important to me that OpenClaw stays open source and given the freedom to flourish. Ultimately, I felt OpenAI was the best place to continue pushing on my vision and expand its reach. The more I talked with the people there, the clearer it became that we both share the same vision.</p><p>The community around OpenClaw is something magical and OpenAI has made strong commitments to enable me to dedicate my time to it and already sponsors the project. To get this into a proper structure I’m working on making it a foundation. It will stay a place for thinkers, hackers and people that want a way to own their data, with the goal of supporting even more models and companies.</p><p>Personally I’m super excited to join OpenAI, be part of the frontier of AI research and development, and continue building with all of you.</p>","contentLength":2374,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=47028013"},{"title":"Palantir Gets Millions of Dollars from New York City's Public Hospitals","url":"https://theintercept.com/2026/02/15/palantir-contract-new-york-city-health-hospitals/","date":1771177030,"author":"cdrnsf","guid":285,"unread":true,"content":"<p> public hospital system is paying millions to Palantir, the controversial ICE and military contractor, according to documents obtained by The Intercept.</p><p>Since 2023, the New York City Health and Hospitals Corporation has paid Palantir nearly $4 million to improve its ability to track down payment for the services provided at its hospitals and medical clinics. Palantir, a data analysis firm that’s now a Wall Street giant thanks to its lucrative work with the Pentagon and U.S. intelligence community, deploys its software to make more efficient the billing of Medicaid and other public benefits. That includes automated scanning of patient health notes to “Increase charges captured from missed opportunities,” contract materials reviewed by The Intercept show.</p><p>Palantir’s administrative involvement in the business of healing people stands in contrast to its longtime role helping facilitate warfare, <a href=\"https://theintercept.com/2017/03/02/palantir-provides-the-engine-for-donald-trumps-deportation-machine/\">mass deportations</a>, and dragnet surveillance.</p><p>In 2016, <a href=\"https://theintercept.com/2017/02/22/how-peter-thiels-palantir-helped-the-nsa-spy-on-the-whole-world/\">The Intercept revealed</a> Palantir’s role behind XKEYSCORE, a secret NSA bulk surveillance program revealed by the whistleblower Edward Snowden that allowed the U.S. and its allies to search the unfathomably large volumes of data they collect. The company has also attracted global scrutiny and criticism for its “<a href=\"https://www.palantir.com/assets/xrfr7uokpv1b/3MuEeA8MLbLDAyxixTsiIe/9e4a11a7fb058554a8a1e3cd83e31c09/C134184_finaleprint.pdf\">strategic partnership</a>” with the Israeli military while it was leveling Gaza.</p><p>But it’s Palantir’s work with U.S. Immigration and Customs Enforcement that is drawing the most protest today. The company provides a variety of services to help the federal government find and deport immigrants. ICE’s Palantir-furnished case management software, for example, “plays a critical role in supporting the daily operations of ICE, ensuring critical mission success,” according to federal contracting documents.</p><p>“It’s unacceptable that the same company that is targeting our neighbors for deportation and providing tools to the Israeli military is also providing software for our hospitals,” said Kenny Morris, an organizer with the American Friends Service Committee, which shared the contract documents with The Intercept.</p><p>Established by the state legislature, New York City Health and Hospitals is the nation’s biggest municipal health care system, administering over 70 facilities throughout New York City, including Bellevue Hospital, and providing care for over 1 million New Yorkers annually.</p><p>New York City Health and Hospitals spokesperson Adam Shrier did not respond to multiple requests to discuss the contract’s details. Palantir spokesperson Drew Messing said the company does not use or share hospital data outside the bounds of its contract.</p><p>Palantir’s contract with New York’s public health care system allows the company to work with patients’ protected health information, or PHI. With permission from New York City Health and Hospitals, Palantir can “de-identify PHI and utilize de-identified PHI for purposes other than research,” the contract states. De-identification generally involves the stripping of certain revealing information, such as names, Social Security numbers, and birthdays. Such provisions are common in contracts involving health data.</p><p>Activists who oppose Palantir’s involvement in New York point to a large body of research that indicates re-identifying personal data, including in medial contexts, is <a href=\"https://georgetownlawtechreview.org/re-identification-of-anonymized-data/GLTR-04-2017/\">often</a><a href=\"https://techscience.org/a/2017082801/\">trivial</a>.</p><p>“Any contract that shares any of New Yorkers’ highly personal data from NYC Health &amp; Hospital’s with Palantir, a key player in the Trump administration’s mass deportation effort, is reckless and puts countless lives at risk,” said Beth Haroules of the New York Civil Liberties Union. “Every New Yorker, without exception, has a right to quality healthcare and city services. New Yorkers must be able to seek healthcare without fear that their intimate medical information, or immigration status, will be delivered to the federal government on a silver platter.”</p><p>Palantir has long provided similar services to the U.K. National Health Service, a business relationship that today has an increasing number of detractors. Palantir “has absolutely no place in the NHS, looking after patients’ personal data,” Green Party leader Zack Polanski recently stated in a <a href=\"https://www.theguardian.com/politics/2026/feb/05/calls-to-halt-uk-palantir-contracts-grow-amid-lack-of-transparency-over-deals\">letter to the U.K. health secretary</a>.</p><figure><blockquote><p>“Palantir is targeting the exact patients that NYCHH is looking to serve.” </p></blockquote></figure><p>Some New York-based groups feel similarly out of distrust for what the firm could do with troves of sensitive personal data.</p><p>“Palantir is targeting the exact patients that NYCHH is looking to serve,” said Jonathan Westin of the Brooklyn-based organization Climate Organizing Hub. “They should immediately sever their contract with Palantir and stand with the millions of immigrant New Yorkers that are being targeted by ICE in this moment.”</p><p>“The chaos Palantir is inflicting through its technology is not just limited to the kidnapping of our immigrant neighbors and the murder of heroes like our fellow nurse, Alex Pretti,” said Hannah Drummond, an Asheville, North Carolina-based nurse and organizer with National Nurses United, a nursing union. “As a nurse and patient advocate, I don’t want anything having to do with Palantir in my hospital — and neither should any elected leader who claims to represent nurses.”</p><p>Palantir’s vocally right-wing CEO Alex Karp&nbsp;has been a <a href=\"https://www.axios.com/2025/11/08/alex-karp-palantir-democrats-mamdani\">frequent</a> critic <a href=\"https://www.foxbusiness.com/video/6384521232112\">of New York City’s</a> newly inaugurated democratic socialist Mayor Zohran Mamdani. Health and Hospitals operates as a public benefit corporation, but the mayor can exert considerable influence over the network, for instance through the appointment of its board of directors. Its president, Dr. Mitchell Katz, was <a href=\"https://www.nyc.gov/site/ocme/news/cm1025/mayor-elect-mamdani-renominates-nyc-health-hospitals-president-ceo-dr-mitchell-katz-and\">renominated</a> by Mamdani, then the mayor-elect, late last year.</p><p>The mayor’s office did not respond in time for publication when asked about its stance on the contract.</p>","contentLength":5829,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=47025624"},{"title":"LT6502: A 6502-based homebrew laptop","url":"https://github.com/TechPaula/LT6502","date":1771175555,"author":"classichasclass","guid":260,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=47025399"},{"title":"EU bans the destruction of unsold apparel, clothing, accessories and footwear","url":"https://environment.ec.europa.eu/news/new-eu-rules-stop-destruction-unsold-clothes-and-shoes-2026-02-09_en","date":1771175418,"author":"giuliomagnifico","guid":259,"unread":true,"content":"<p>The European Commission today (Feb 9) adopted new measures under the Ecodesign for Sustainable Products Regulation (ESPR) to prevent the destruction of unsold apparel, clothing, accessories and footwear.</p><p>The rules will help cut waste, reduce environmental damage and create a level playing field for companies embracing sustainable business models, allowing them to reap the benefits of a more circular economy.</p><p>Every year in Europe, an estimated are destroyed before ever being worn. This waste generates around  of CO2 emissions – almost equal to Sweden’s total net emissions in 2021.</p><p>To help reduce this wasteful practice, the ESPR requires companies to disclose information on the unsold consumer products they discard as waste. It also introduces a ban on the destruction of unsold apparel, clothing accessories and footwear.</p><p>The Delegated and Implementing Acts adopted today will support businesses in complying with these requirements by:</p><ul><li>: The Delegated Act outlines specific and justified circumstances under which the destruction will be permitted, for instance, due to safety reasons or product damage. National authorities will oversee compliance.</li><li> The Implementing Act introduces a standardised format for businesses to disclose the volumes of unsold consumer goods they discard. This applies from February 2027, giving businesses sufficient time to adapt.</li></ul><p>Instead of discarding stock, companies are encouraged to manage their stock more effectively, handle returns, and explore alternatives such as resale, remanufacturing, donations, or reuse.</p><p>The ban on destruction of unsold apparel, clothing accessories and footwear and the derogations will apply to large companies from  Medium-sized companies are expected to follow in 2030. The rules on disclosure under the ESPR  and will also apply to medium-sized companies in 2030.</p><blockquote><p>\"The textile sector is leading the way in the transition to sustainability, but there are still challenges. The numbers on waste show the need to act. With these new measures, the textile sector will be empowered to move towards sustainable and circular practices, and we can boost our competitiveness and reduce our dependencies.\"</p><p><strong>Jessika Roswall, Commissioner for Environment, Water Resilience and a Competitive Circular Economy</strong></p></blockquote><p>The destruction of unsold goods is a wasteful practice. In France alone, around €630 million worth of unsold products are destroyed each year. Online shopping also fuels the issue: in Germany, nearly 20 million returned items are discarded annually.&nbsp;&nbsp;</p><p>Textiles are a major part of the problem, and a key focus for action. To cut waste and reduce the sector’s environmental footprint, the European Commission is promoting more sustainable production while helping European companies stay competitive.&nbsp;</p><p>The ESPR is central to this effort. It will make products on the EU market more durable, reusable and recyclable, while boosting efficiency and circularity.</p>","contentLength":2927,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=47025378"},{"title":"Hideki Sato, designer of all Sega's consoles, has died","url":"https://www.videogameschronicle.com/news/hideki-sato-designer-of-segas-consoles-dies-age-75/","date":1771172391,"author":"magoghm","guid":258,"unread":true,"content":"<!DOCTYPE html>","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=47024907"},{"title":"Amazon's Ring and Google's Nest reveal the severity of U.S. surveillance state","url":"https://greenwald.substack.com/p/amazons-ring-and-googles-nest-unwittingly","date":1771159337,"author":"mikece","guid":256,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=47023238"},{"title":"I fixed Windows native development","url":"https://marler8997.github.io/blog/fixed-windows/","date":1771154726,"author":"deevus","guid":255,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=47022891"},{"title":"Oat – Ultra-lightweight, zero dependency, semantic HTML, CSS, JS UI library","url":"https://oat.ink/","date":1771143425,"author":"twapi","guid":253,"unread":true,"content":"<section><h3>Semantic, minimal, zero dependencies. ~8KB CSS and JS.</h3><p>\n    Oat is an ultra-lightweight HTML + CSS, semantic UI component library with zero dependencies.\n    No framework, build, or dev complexity. Just include the tiny CSS and JS files and you are good to go building\n    decent looking web applications with most commonly needed components and elements.\n  </p><p>\n    Semantic tags and attributes are styled contextually out of the box without classes, forcing best practices, and reducing\n    markup class pollution. A few dynamic components are WebComponents and use minimal JavaScript.\n  </p></section><section><article><p> CSS,  JS, minified + gzipped.</p></article><article><p>Fully-standalone with no dependencies on any JS or CSS frameworks or libraries.\n      No Node.js ecosystem garbage or bloat.\n    </p></article><article><p>Native elements like , ,  and\n      semantic attributes like  are styled directly. No classes.</p></article><article><p>Semantic HTML and ARIA roles are used (and forced in many places) throughout.\n      Proper keyboard navigation support for all components and elements.</p></article><article><p>Easily customize the overall theme by overriding a handful of CSS variables.  on body\n      automatically uses the bundled dark theme.</p></article></section><section><p>\n    This was made after the unending frustration with the over-engineered bloat, complexity, and dependency-hell of pretty much every Javascript UI library and framework out there. Done with the continuous PTSD of rug-pulls and lockins of the Node.js ecosystem trash.\n    \n    I've published this, in case other Node.js ecosystem trauma victims find it useful.\n  </p><p>\n    My goal is a simple, minimal, vanilla, standards-based UI library that I can use in my own projects for the long term without having to worry about Javascript ecosystem trash. Long term because it's just simple vanilla CSS and JS.\n    The look and feel are influenced by the shadcn aesthetic.\n  </p></section>","contentLength":1787,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=47021980"},{"title":"Discord distances from age verification firm after ties to Peter Thiel surface","url":"https://kotaku.com/discord-palantir-peter-thiel-persona-age-verification-2000668951","date":1771135242,"author":"thisislife2","guid":284,"unread":true,"content":"<p><a href=\"https://www.pcgamer.com/hardware/someone-has-already-made-a-free-in-browser-3d-model-to-bypass-discord-age-verification-that-works-on-any-potato-computer/\"></a><a href=\"https://www.theguardian.com/media/2025/oct/09/hack-age-verification-firm-discord-users-id-photos\"></a><a href=\"https://kotaku.com/discord-will-force-you-to-scan-your-face-or-id-to-unlock-all-of-its-features-2000666884\"></a></p><p><a href=\"https://www.pcgamer.com/software/platforms/oh-good-discords-age-verification-rollout-has-ties-to-palantir-co-founder-and-panopticon-architect-peter-thiel/\"></a></p><p><a href=\"https://www.bloomberg.com/news/articles/2021-09-15/founders-fund-values-identity-startup-persona-at-1-5-billion\"></a></p><p><a href=\"https://www.404media.co/elite-the-palantir-app-ice-uses-to-find-neighborhoods-to-raid/\"></a><a href=\"https://www.wired.com/story/epstein-files-tech-elites-gates-thiel-musk/\"></a><a href=\"https://aftermath.site/jeffrey-epstein-files-kotick-thiel-xbox-rockstar/\"></a></p><p><a href=\"https://piunikaweb.com/2026/02/12/discord-uk-age-verification-persona-vendor-shift/\"></a><a href=\"https://www.pcgamer.com/hardware/discord-clarifies-it-is-not-requiring-everyone-to-complete-a-face-scan-or-upload-an-id-and-will-confirm-your-age-group-using-information-we-already-have/\"></a></p><p><a href=\"https://support.discord.com/hc/en-us/articles/30326565624343-How-to-Complete-Age-Assurance-on-Discord\"></a></p>","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=47021421"},{"title":"Flashpoint Archive – Over 200k web games and animations preserved","url":"https://flashpointarchive.org/","date":1771134239,"author":"helloplanets","guid":283,"unread":true,"content":"<!DOCTYPE html>","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=47021354"},{"title":"NewPipe: YouTube client without vertical videos and algorithmic feed","url":"https://newpipe.net/","date":1771118656,"author":"nvader","guid":282,"unread":true,"content":"<p>Hash sum: </p><p>\n                                    Signing key (SHA256 fingerprint):\n                                        <code>CB:84:06:9B:D6:81:16:BA:FA:E5:EE:4E:E5:B0:8A:56:7A:A6:D8:98:40:4E:7C:B1:2F:9E:75:6D:F5:CF:5C:AB</code></p>","contentLength":216,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=47020218"},{"title":"I love the work of the ArchWiki maintainers","url":"https://k7r.eu/i-love-the-work-of-the-archwiki-maintainers/","date":1771118458,"author":"panic","guid":281,"unread":true,"content":"<p>For this year's <a href=\"https://ilovefs.org\">\"I love Free Software Day\"</a> I\nwould like to thank the maintainers of Free Software documentation, and\nhere especially the maintainers of the\n<a href=\"https://wiki.archlinux.org/\">ArchWiki</a>. Maintainers in general, and\nmaintainers of documentation most of the time get way too little\nrecognition for their contributions to software freedom.</p><p><em>Myself, Arch Project Leader Levente, ArchWiki maintainer Ferdinand\n(Alad), and FSFE's vice president Heiki at FOSDEM 2026 after I handed\nthem over some hacker chocolate.</em></p><p>The ArchWiki is a resource, I myself and many people around me regularly\nconsult - no matter if it is actually about Arch or another Free Software\ndistribution. There are countless times, when I read articles there to\nget a better understanding of the tools I daily use, like e-mail\nprograms, editors, or all kinds of window managers I used over time. It\nhelped me to discover some handy features or configuration tips that\nwere difficult for me to find in the documentation of the software\nitself.</p><p>Whenever I run into issues setting up a GNU/Linux distribution for\nmyself or family and friends, the ArchWiki had my back!</p><p>Whenever I want to better understand a software, the ArchWiki is most\noften the first page I end up consulting.</p><p><em>You are one of the pearls of the internet!</em> Or in Edward Snowden's\nwords:</p><p>Thank you, to all the ArchWiki contributors for gathering all the\nknowledge to help others in society to better understand technology and for\nthe ArchWiki maintainers to ensure the long term availability and\nreliability of this crucial resource.</p><p>If you also appreciated the work of the ArchWiki maintainers for our\nsociety, tell them as well, and I encourage you to make a <a href=\"https://archlinux.org/donate/\">donation to\nArch</a>.</p><p>PS: Thanks also to Morton for connecting me with Ferdinand and Levente\nat FOSDEM.</p>","contentLength":1757,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=47020191"},{"title":"You can't trust the internet anymore","url":"https://nicole.express/2026/not-my-casual-hobby.html","date":1771098685,"author":"panic","guid":280,"unread":true,"content":"<p>I like things that are strange and a bit obscure. It’s a habit of mine, and a lot of this blog is to document things I haven’t heard of before, because I wanted to learn about them. I mean, jeez, I’m certainly not writing blog posts about <a href=\"https://nicole.express/2026/put-your-clothes-back-on.html\">strip </a><a href=\"https://nicole.express/2026/spooky-ghost-stories.html\">mahjong</a> because the people demand it. But I can’t stop seeing misinformation everywhere, and I have to say something. This post is just a rant.</p><p>This is , a Japanese Sega Genesis game released in 1994 to commemorate the release of  by re-releasing the original. It has an interesting component: it is the Master System game, just packaged into a Genesis cart. The PCB wires the Genesis lines the same way your Power Base Converter would. My guess is the reason for this is because the Master System wasn’t very popular in Japan, and  tied together the whole series with a lot of tiebacks to the first one in particular.</p><p>As a Master System game disguised as a Genesis one, this game is technically interesting. Some Genesis consoles can’t play Master System games, and those ones can’t play this game either. Also, I love the  series; even if 2 is my favorite. This makes this cartridge a perfect subject for my interest, so I’ve talked about it before and will talk about it again. In fact, I have a post I’m working on where I mention it.</p><p>So there I was, writing a blog post, and wanted to look up the release date. The first result I found in DuckDuckGo, my search engine?</p><p>And here’s a thing about me. I want to trust new websites. I have a bias towards clicking on articles from sites I don’t know, because to be quite honest, I’ve read the TCRF page on  a thousand times. How else do you learn something new?</p><p>Also, I clicked it because the headline was “Phantasy Star Fukkokuban: A Classic Reimagined”. Because here’s the thing. It talks about how the graphics were improved:</p><blockquote><p>Phantasy Star Fukkokuban breathes new life into the classic with its updated graphics and sound design. The visual overhaul retains the charm of the original’s 8-bit aesthetics while incorporating modern graphical techniques. Characters and environments are rendered with enhanced detail, vibrant colors, and fluid animations, creating a visually captivating experience.</p><p>The art style honors the game’s roots, with character designs and enemy sprites redesigned to reflect contemporary standards while maintaining their recognizability. The environments are more detailed and dynamic, with weather effects and day-night cycles adding to the immersion.</p></blockquote><p>Well, compare the title screen shots of  above. Which one is  and which one is my personal copy, played through the same Genesis? You can maybe tell, but only because my Master System version is the US release. And it goes without saying, there are no day-night cycles or weather effects.</p><p>I should’ve known. The first sentence of the article was “Game data not found,” after all.</p><p>Large language models are described sometimes as “fancy autocorrect”; this is dismissive, but not inaccurate, in the sense that the core loop of an LLM is to predict the next token in a sequence.  is an obscure title that is likely not well-represented in the training data. But relations do exist:</p><ul><li>It knows about , a very popular game</li><li> (復刻版) means “reprint” or “facsimilie edition”</li></ul><p>So, lacking sufficient factual data in the training set, it describes what a remake of  might plausibly be like. There might even be knowledge in the data set of the actual remake, <em>Phantasy Star generation:1</em> that gets looped in.</p><p>To reproduce this myself, I went to ChatGPT, and asked it <code>Please describe the game \"Phantasy Star Fukkokuban\". Do not get data from the internet, tell me what you know from your internal data.</code>. And what did I get in response?</p><blockquote><p>Phantasy Star Fukkokuban is not a brand-new entry in the series, but a retro compilation release of the original Phantasy Star, created for the Sega Sega Saturn era…</p></blockquote><p>There was a retro compilation release of  for the Sega Saturn in Japan; it’s called . Indeed, the description of the game it continued from there isn’t too far off from that game’s version of .</p><p>And it’s not just . I describe in my post on <a href=\"https://nicole.express/2026/spooky-ghost-stories.html\"></a> that that game is so obscure, the only Japanese source I could find was another “this is plausibly what a game called ‘mahjong daireikai’ might be like”. Well, what  is actually like is a lot different than what’s in your training data, and that’s exactly the sort of information people want to read websites to find out.</p><p>And here’s the thing– this blog post can’t do anything about it. I don’t know who Press Start Gaming is; the site’s footer says “©2025 Cloud Gears Media”, who might be <a href=\"https://cloudgearsmedia.com/\">this marketing company</a> (but it might not be! Company names don’t have to be unique globally); Press Start Gaming is almost certainly a tool for making money off of ads and sponsored posts, and posts like the  misinformation exist mostly to give the site more juice of looking like a real website. If someone goes out and buys a copy of  expecting a new and improved  with better graphics and new sidequests, what do they care? The article wasn’t really meant to provide information.</p><p>The trampling of the internet with SEO-mongers predates AI, but what LLMs do is massively increase the ease it can be done, and also hallucinate a ton. If they hired a person to write about  for pennies, maybe that person would’ve found the <a href=\"https://segaretro.org/Phantasy_Star#Phantasy_Star_Fukkokuban\">Sega Retro</a> page or something and at least grabbed some facts. Now you don’t need to do even that. And no one making these decisions reads , or even cares about actually providing information with their sites. That’s not what they’re for.</p><p>Anyways, eventually models will do a better job integrating , and will know more information about . And is this the worst thing the AI boom is doing? <a href=\"https://www.aol.com/news/naacp-threatens-sue-musk-xai-233138040.html\">No,</a><a href=\"https://www.yahoo.com/news/articles/groups-threaten-suit-over-xai-223759493.html\">not</a><a href=\"https://www.cnn.com/2025/08/26/tech/openai-chatgpt-teen-suicide-lawsuit\">even</a><a href=\"https://www.reuters.com/world/us/americans-fear-ai-permanently-displacing-workers-reutersipsos-poll-finds-2025-08-19/\">close.</a> Even the <a href=\"https://theshamblog.com/an-ai-agent-published-a-hit-piece-on-me/\">fully automated hit piece</a> against an open-source developer is probably worse than this.</p><p>But it’s a real shame. The commons of the internet are probably already lost, and while I might want to learn new things from new sites, I’ll just have to stick to those with pre-LLM reptuations that I trust. Well, until those sites burn their reputations to make a few extra pennies with AI, like <a href=\"https://mastodon.gamedev.place/@xot/116065688012051690\"></a> seems to just have. (link goes to a Mastodon thread in lieu of a better source for now)</p><p><a href=\"https://arstechnica.com/staff/2026/02/editors-note-retraction-of-article-containing-fabricated-quotations/\">Ars Technica</a> has admitted the article had fabricated quotations and has retracted it.</p><p>This post is just a rant. Thanks for listening, at least.</p>","contentLength":6435,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=47017727"},{"title":"Descent, ported to the web","url":"https://mrdoob.github.io/three-descent/","date":1771097604,"author":"memalign","guid":279,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=47017545"},{"title":"News publishers limit Internet Archive access due to AI scraping concerns","url":"https://www.niemanlab.org/2026/01/news-publishers-limit-internet-archive-access-due-to-ai-scraping-concerns/","date":1771094792,"author":"ninjagoo","guid":278,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=47017138"},{"title":"uBlock filter list to hide all YouTube Shorts","url":"https://github.com/i5heu/ublock-hide-yt-shorts/","date":1771090605,"author":"i5heu","guid":277,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=47016443"},{"title":"Platforms bend over backward to help DHS censor ICE critics, advocates say","url":"https://arstechnica.com/tech-policy/2026/02/platforms-bend-over-backward-to-help-dhs-censor-ice-critics-advocates-say/","date":1771084196,"author":"pjmlp","guid":276,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=47015406"},{"title":"Vim 9.2","url":"https://www.vim.org/vim-9.2-released.php","date":1771083583,"author":"tapanjk","guid":275,"unread":true,"content":"<p>The Vim project is happy to announce that Vim 9.2 has been released.</p><p>Vim 9.2 brings significant enhancements to the Vim9 scripting language, improved diff mode, comprehensive completion features, and platform-specific improvements including experimental Wayland support.</p><ul><li><strong>Comprehensive Completion:</strong> Added support for  during insert-mode completion and the ability to complete words directly from  (). New  flags like  and  offer finer control over how matches are displayed and ordered.</li><li> Full support for the  UI and clipboard has been added. On Linux and Unix-like systems, Vim now adheres to the <strong>XDG Base Directory Specification</strong>, using  for user configuration.</li><li> A new  provides an alternative to the horizontal tabline. The  GUI now supports native dark mode for the menu and title bars, along with improved fullscreen support and higher-quality toolbar icons.</li><li> A new built-in  (started via ) provides a modernized learning experience beyond the traditional vimtutor.</li></ul><p>Significant language enhancements including native support for , , and the  data type. Built-in functions are now integrated as , and classes now support protected  methods and  for full method compilation.</p><div><h2>Vim9 Script Ecosystem &amp; AI Integration</h2><p>The maturity of Vim9 script's modern constructs is now being leveraged by advanced AI development tools. Contributor Yegappan Lakshmanan recently demonstrated the efficacy of these new features through two projects generated using GitHub Copilot:</p><ul><li> A complete implementation of the classic game, showcasing classes and type aliases. [<a href=\"https://github.com/yegappan/battleship.git\">GitHub</a>]</li><li> A logic game demonstrating the efficiency of modern Vim9 for interactive plugins. [<a href=\"https://github.com/yegappan/number-puzzle\">GitHub</a>]</li></ul></div><p>Vim 9.2 introduces significant enhancements to how changes are visualized and aligned in diff mode:</p><ul><li> Includes the \"linematch\" algorithm for the  setting. This aligns changes between buffers on similar lines, greatly improving diff highlighting accuracy.</li><li> The new  option allows you to specify anchor points (comma-separated addresses) to split and independently diff buffer sections, ensuring better alignment in complex files.</li><li> Improves highlighting for changes within a line. This is configurable via the  sub-option for . Note that  has been added to the default  value.</li></ul>\n    Here are some examples for the improved inline highlighting:\n    <p>Several long-standing defaults have been updated to better suit modern hardware and workflows. These values have been removed from  as they are now the internal defaults.</p><table><thead><tr></tr></thead><tbody><tr><td> (More undo/command history saved)</td></tr><tr><td> (Normal backspace behavior)</td></tr><tr><td><strong>\"internal,filler,closeoff,indent-heuristic,inline:char\"</strong></td></tr><tr><td> (Optimized for High-DPI monitors)</td></tr><tr><td> (Always visible in non-compatible mode)</td></tr><tr><td> (Shows cursor position by default)</td></tr></tbody></table><h2>Completion Feature Examples</h2><p>These examples demonstrate how to use the powerful new completion and introspection tools available in Vim 9.2.</p><div><p>Vim's standard completion frequently checks for user input while searching for new matches. It is responsive irrespective of file size. This makes it well-suited for smooth auto-completion.</p><pre><code>vim9script\ndef InsComplete()\n    if getcharstr(1) == '' &amp;&amp; getline('.')-&gt;strpart(0, col('.') - 1) =~ '\\k$'\n        SkipTextChangedIEvent()\n        feedkeys(\"\\&lt;c-n&gt;\", \"n\")\n    endif\nenddef\n\ndef SkipTextChangedIEvent(): string\n    # Suppress next event caused by &lt;c-e&gt; (or &lt;c-n&gt; when no matches found)\n    set eventignore+=TextChangedI\n    timer_start(1, (_) =&gt; {\n        set eventignore-=TextChangedI\n    })\n    return ''\nenddef\n\nset cot=menuone,popup,noselect inf\n\nautocmd TextChangedI * InsComplete()\n\ninoremap &lt;silent&gt; &lt;c-e&gt; &lt;c-r&gt;=&lt;SID&gt;SkipTextChangedIEvent()&lt;cr&gt;&lt;c-e&gt;\n</code></pre><h3>2. Live grep, fuzzy find file, fuzzy find buffer</h3><pre><code>vim9script\n\nvar selected_match = null_string\nvar allfiles: list&lt;string&gt;\n\ndef GrepComplete(arglead: string, cmdline: string, cursorpos: number): list&lt;any&gt;\n    return arglead-&gt;len() &gt; 1 ? systemlist($'grep -REIHns \"{arglead}\"' ..\n       ' --exclude-dir=.git --exclude=\".*\" --exclude=\"tags\" --exclude=\"*.swp\"') : []\nenddef\n\ndef VisitFile()\n    if (selected_match != null_string)\n        var qfitem = getqflist({lines: [selected_match]}).items[0]\n        if qfitem-&gt;has_key('bufnr') &amp;&amp; qfitem.lnum &gt; 0\n            var pos = qfitem.vcol &gt; 0 ? 'setcharpos' : 'setpos'\n            exec $':b +call\\ {pos}(\".\",\\ [0,\\ {qfitem.lnum},\\ {qfitem.col},\\ 0]) {qfitem.bufnr}'\n            setbufvar(qfitem.bufnr, '&amp;buflisted', 1)\n        endif\n    endif\nenddef\n\ndef FuzzyFind(arglead: string, _: string, _: number): list&lt;string&gt;\n    if allfiles == null_list\n        allfiles = systemlist($'find {get(g:, \"fzfind_root\", \".\")} \\!\n                   \\( -path \"*/.git\" -prune -o -name \"*.swp\" \\) -type f -follow')\n    endif\n    return arglead == '' ? allfiles : allfiles-&gt;matchfuzzy(arglead)\nenddef\n\ndef FuzzyBuffer(arglead: string, _: string, _: number): list&lt;string&gt;\n    var bufs = execute('buffers', 'silent!')-&gt;split(\"\\n\")\n    var altbuf = bufs-&gt;indexof((_, v) =&gt; v =~ '^\\s*\\d\\+\\s\\+#')\n    if altbuf != -1\n        [bufs[0], bufs[altbuf]] = [bufs[altbuf], bufs[0]]\n    endif\n    return arglead == '' ? bufs : bufs-&gt;matchfuzzy(arglead)\nenddef\n\ndef SelectItem()\n    selected_match = ''\n    if getcmdline() =~ '^\\s*\\%(Grep\\|Find\\|Buffer\\)\\s'\n        var info = cmdcomplete_info()\n        if info != {} &amp;&amp; info.pum_visible &amp;&amp; !info.matches-&gt;empty()\n            selected_match = info.selected != -1 ? info.matches[info.selected] : info.matches[0]\n            setcmdline(info.cmdline_orig) # Preserve search pattern in history\n        endif\n    endif\nenddef\n\ncommand! -nargs=+ -complete=customlist,GrepComplete Grep VisitFile()\ncommand! -nargs=* -complete=customlist,FuzzyBuffer Buffer exe 'b ' .. selected_match-&gt;matchstr('\\d\\+')\ncommand! -nargs=* -complete=customlist,FuzzyFind Find exe !empty(selected_match) ? $'e {selected_match}' : ''\n\nnnoremap &lt;leader&gt;g :Grep&lt;space&gt;\nnnoremap &lt;leader&gt;G :Grep &lt;c-r&gt;=expand(\"&lt;cword&gt;\")&lt;cr&gt;\n\nnnoremap &lt;leader&gt;&lt;space&gt; :&lt;c-r&gt;=execute('let fzfind_root=\".\"')\\|''&lt;cr&gt;Find&lt;space&gt;&lt;c-@&gt;\nnnoremap &lt;leader&gt;fv :&lt;c-r&gt;=execute('let fzfind_root=\"$HOME/.vim\"')\\|''&lt;cr&gt;Find&lt;space&gt;&lt;c-@&gt;\nnnoremap &lt;leader&gt;fV :&lt;c-r&gt;=execute('let fzfind_root=\"$VIMRUNTIME\"')\\|''&lt;cr&gt;Find&lt;space&gt;&lt;c-@&gt;\nnnoremap &lt;leader&gt;&lt;bs&gt; :Buffer &lt;c-@&gt;\n\nautocmd CmdlineEnter : allfiles = null_list\nautocmd CmdlineLeavePre : SelectItem()</code></pre><pre><code>vim9script\n\ndef CmdComplete()\n    var [cmdline, curpos] = [getcmdline(), getcmdpos()]\n    if getchar(1, {number: true}) == 0  # Typehead is empty\n            &amp;&amp; !pumvisible() &amp;&amp; curpos == cmdline-&gt;len() + 1\n            &amp;&amp; cmdline =~ '\\%(\\w\\|[*/:.-]\\)$' &amp;&amp; cmdline !~ '^\\d\\+$'\n        feedkeys(\"\\&lt;C-@&gt;\", \"ti\")\n        SkipCmdlineChanged()\n        timer_start(0, (_) =&gt; getcmdline()-&gt;substitute('\\%x00', '', 'g')-&gt;setcmdline())\n    endif\nenddef\n\ndef SkipCmdlineChanged(key = ''): string\n    set ei+=CmdlineChanged\n    timer_start(0, (_) =&gt; execute('set ei-=CmdlineChanged'))\n    return key != '' ? ((pumvisible() ? \"\\&lt;c-e&gt;\" : '') .. key) : ''\nenddef\n\nset wim=noselect:lastused,full wop=pum wcm=&lt;C-@&gt; wmnu\n\nautocmd CmdlineChanged : CmdComplete()\nautocmd CmdlineEnter : set bo+=error\nautocmd CmdlineLeave : set bo-=error\n\ncnoremap &lt;expr&gt; &lt;up&gt; SkipCmdlineChanged(\"\\&lt;up&gt;\")\ncnoremap &lt;expr&gt; &lt;down&gt; SkipCmdlineChanged(\"\\&lt;down&gt;\")\n</code></pre><h3>Optional: Autocompletion (Popup Menu)</h3><p>For automatic popup menu completion as you type in search or  commands, include this in your :</p><pre><code>vim9script\ndef CmdComplete()\n  var [cmdline, curpos, cmdmode] = [getcmdline(), getcmdpos(), expand('&lt;afile&gt;') == ':']\n  var trigger_char = '\\%(\\w\\|[*/:.-]\\)$'\n  var not_trigger_char = '^\\%(\\d\\|,\\|+\\|-\\)\\+$'\n  if getchar(1, {number: true}) == 0\n      &amp;&amp; !wildmenumode() &amp;&amp; curpos == cmdline-&gt;len() + 1\n      &amp;&amp; (!cmdmode || (cmdline =~ trigger_char &amp;&amp; cmdline !~ not_trigger_char))\n    SkipCmdlineChanged()\n    feedkeys(\"\\&lt;C-@&gt;\", \"t\")\n    timer_start(0, (_) =&gt; getcmdline()-&gt;substitute('\\%x00', '', 'ge')-&gt;setcmdline())\n  endif\nenddef\n\ndef SkipCmdlineChanged(key = ''): string\n  set ei+=CmdlineChanged\n  timer_start(0, (_) =&gt; execute('set ei-=CmdlineChanged'))\n  return key == '' ? '' : ((wildmenumode() ? \"\\&lt;C-E&gt;\" : '') .. key)\nenddef\n\nset wim=noselect:lastused,full wop=pum wcm=&lt;C-@&gt; wmnu\n\nautocmd CmdlineChanged :,/,? CmdComplete()\n\n# Optional: Preserve history recall behavior\ncnoremap &lt;expr&gt; &lt;Up&gt; SkipCmdlineChanged(\"\\&lt;Up&gt;\")\ncnoremap &lt;expr&gt; &lt;Down&gt; SkipCmdlineChanged(\"\\&lt;Down&gt;\")\n\n# Optional: Customize popup height\nautocmd CmdlineEnter : set bo+=error | exec $'set ph={max([10, winheight(0) - 4])}'\nautocmd CmdlineEnter /,? set bo+=error ph=8\nautocmd CmdlineLeave :,/,? set bo-=error ph&amp;</code></pre></div><h2>Other Improvements and Changes</h2><p>Many bugs have been fixed since the release of Vim 9.1, including security vulnerabilities, memory leaks and potential crashes.</p><h2>Charity: Transition to Kuwasha</h2><p>For over 30 years, Vim has been \"Charityware,\" supporting children in Kibaale, Uganda. Following the passing of Bram Moolenaar, the ICCF Holland foundation was dissolved, and its mission has been carried forward by a new partner.</p><ul><li><strong>ICCF Holland Dissolution:</strong> Because the charity could not be sustained in its original form without Bram, ICCF Holland was dissolved and its remaining funds were transferred to ensure continued support for the Kibaale project.</li><li><strong>Partnership with Kuwasha:</strong> To ensure that aid remained uninterrupted, all sponsorship activities were moved to <a href=\"https://www.kuwasha.net/ways-to-give/\">Kuwasha</a>, a long-term partner based in Canada that now manages the projects in Uganda.</li><li> Vim remains Charityware. We encourage users to continue supporting the needy children in Uganda through this new transition.</li></ul><p>For information on how to support this cause, please visit the <a href=\"https://www.vim.org/sponsor/index.php\">Sponsor page</a>.</p><p>We would like to thank everybody who contributed to the project through patches, translations, and bug reports. We are very grateful for any support.</p>","contentLength":9636,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=47015330"},{"title":"My smart sleep mask broadcasts users' brainwaves to an open MQTT broker","url":"https://aimilios.bearblog.dev/reverse-engineering-sleep-mask/","date":1771083347,"author":"minimalthinker","guid":274,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=47015294"},{"title":"Show HN: Sameshi – a ~1200 Elo chess engine that fits within 2KB","url":"https://github.com/datavorous/sameshi","date":1771076864,"author":"datavorous_","guid":215,"unread":true,"content":"<p>I made a chess engine today, and made it fit within 2KB.\nI used a variant of MinMax called Negamax, with alpha beta pruning. For the board representation I have used a 120-cell \"mailbox\". I managed to squeeze in checkmate/stalemate in there, after trimming out some edge cases.</p><p>I am a great fan of demoscene (computer art subculture) since middle school, and hence it was a ritual i had to perform.</p><p>For estimating the Elo, I measured 240 automated games against Stockfish Elo levels (1320 to 1600) under fixed depth-5 and some constrained rules, using equal color distribution.</p><p>Then converted pooled win/draw/loss scores to Elo through some standard logistic formula with binomial 95% confidence interval.</p>","contentLength":702,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=47014500"},{"title":"Ooh.directory: a place to find good blogs that interest you","url":"https://ooh.directory/","date":1771076420,"author":"hisamafahri","guid":273,"unread":true,"content":"<li><p><a href=\"https://onestarrynight.com\">One Starry Night</a><q>A cozy constellation of stories, stardust, nostalgia, and chronic illness adventures. Still sparkling since 2001.</q>\n\n        \n\n  By Sarah DiLullo.\n\n\n        </p></li><li><p><a href=\"https://blog.miljko.org\">Infinite Regress</a><q>Clinical trials, cancer research, book reviews, coffee making, photography, and the like.</q>\n\n        \n\n  By Miloš Miljković.\n\n\n        </p></li>","contentLength":322,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=47014449"},{"title":"Ars Technica makes up quotes from Matplotlib maintainer; pulls story","url":"https://infosec.exchange/@mttaggart/116065340523529645","date":1771061325,"author":"robin_reala","guid":272,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=47013059"},{"title":"YouTube as Storage","url":"https://github.com/PulseBeat02/yt-media-storage","date":1771060215,"author":"saswatms","guid":271,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=47012964"},{"title":"Zig – io_uring and Grand Central Dispatch std.Io implementations landed","url":"https://ziglang.org/devlog/2026/#2026-02-13","date":1771057331,"author":"Retro_Dev","guid":270,"unread":true,"content":"<div><p>As we approach the end of the 0.16.0 release cycle, Jacob has been hard at work, bringing  up to speed with all the latest API changes:</p><p>Both of these are based on userspace stack switching, sometimes called “fibers”, “stackful coroutines”, or “green threads”.</p><p>They are now , by constructing one’s application using . They should be considered  because there is important followup work to be done before they can be used reliably and robustly:</p><p>With those caveats in mind, it seems we are indeed reaching the Promised Land, where Zig code can have Io implementations effortlessly swapped out:</p><pre><code></code></pre><pre><code>$ strace ./hello_threaded\nexecve(\"./hello_threaded\", [\"./hello_threaded\"], 0x7ffc1da88b20 /* 98 vars */) = 0\nmmap(NULL, 262207, PROT_READ|PROT_WRITE, MAP_PRIVATE|MAP_ANONYMOUS, -1, 0) = 0x7f583f338000\narch_prctl(ARCH_SET_FS, 0x7f583f378018) = 0\nprlimit64(0, RLIMIT_STACK, NULL, {rlim_cur=8192*1024, rlim_max=RLIM64_INFINITY}) = 0\nprlimit64(0, RLIMIT_STACK, {rlim_cur=16384*1024, rlim_max=RLIM64_INFINITY}, NULL) = 0\nsigaltstack({ss_sp=0x7f583f338000, ss_flags=0, ss_size=262144}, NULL) = 0\nsched_getaffinity(0, 128, [0 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31]) = 8\nrt_sigaction(SIGIO, {sa_handler=0x1019d90, sa_mask=[], sa_flags=SA_RESTORER, sa_restorer=0x10328c0}, {sa_handler=SIG_DFL, sa_mask=[], sa_flags=0}, 8) = 0\nrt_sigaction(SIGPIPE, {sa_handler=0x1019d90, sa_mask=[], sa_flags=SA_RESTORER, sa_restorer=0x10328c0}, {sa_handler=SIG_DFL, sa_mask=[], sa_flags=0}, 8) = 0\nwritev(1, [{iov_base=\"Hello, World!\\n\", iov_len=14}], 1Hello, World!\n) = 14\nrt_sigaction(SIGIO, {sa_handler=SIG_DFL, sa_mask=[], sa_flags=SA_RESTORER, sa_restorer=0x10328c0}, NULL, 8) = 0\nrt_sigaction(SIGPIPE, {sa_handler=SIG_DFL, sa_mask=[], sa_flags=SA_RESTORER, sa_restorer=0x10328c0}, NULL, 8) = 0\nexit_group(0)                           = ?\n+++ exited with 0 +++\n</code></pre><p>Swapping out only the I/O implementation:</p><pre><code></code></pre><pre><code>execve(\"./hello_evented\", [\"./hello_evented\"], 0x7fff368894f0 /* 98 vars */) = 0\nmmap(NULL, 262215, PROT_READ|PROT_WRITE, MAP_PRIVATE|MAP_ANONYMOUS, -1, 0) = 0x7f70a4c28000\narch_prctl(ARCH_SET_FS, 0x7f70a4c68020) = 0\nprlimit64(0, RLIMIT_STACK, NULL, {rlim_cur=8192*1024, rlim_max=RLIM64_INFINITY}) = 0\nprlimit64(0, RLIMIT_STACK, {rlim_cur=16384*1024, rlim_max=RLIM64_INFINITY}, NULL) = 0\nsigaltstack({ss_sp=0x7f70a4c28008, ss_flags=0, ss_size=262144}, NULL) = 0\nsched_getaffinity(0, 128, [0 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31]) = 8\nmmap(NULL, 4096, PROT_READ|PROT_WRITE, MAP_PRIVATE|MAP_ANONYMOUS, -1, 0) = 0x7f70a4c27000\nmmap(0x7f70a4c28000, 548864, PROT_READ|PROT_WRITE, MAP_PRIVATE|MAP_ANONYMOUS, -1, 0) = 0x7f70a4ba1000\nio_uring_setup(64, {flags=IORING_SETUP_COOP_TASKRUN|IORING_SETUP_SINGLE_ISSUER, sq_thread_cpu=0, sq_thread_idle=1000, sq_entries=64, cq_entries=128, features=IORING_FEAT_SINGLE_MMAP|IORING_FEAT_NODROP|IORING_FEAT_SUBMIT_STABLE|IORING_FEAT_RW_CUR_POS|IORING_FEAT_CUR_PERSONALITY|IORING_FEAT_FAST_POLL|IORING_FEAT_POLL_32BITS|IORING_FEAT_SQPOLL_NONFIXED|IORING_FEAT_EXT_ARG|IORING_FEAT_NATIVE_WORKERS|IORING_FEAT_RSRC_TAGS|IORING_FEAT_CQE_SKIP|IORING_FEAT_LINKED_FILE|IORING_FEAT_REG_REG_RING|IORING_FEAT_RECVSEND_BUNDLE|IORING_FEAT_MIN_TIMEOUT|IORING_FEAT_RW_ATTR|IORING_FEAT_NO_IOWAIT, sq_off={head=0, tail=4, ring_mask=16, ring_entries=24, flags=36, dropped=32, array=2112, user_addr=0}, cq_off={head=8, tail=12, ring_mask=20, ring_entries=28, overflow=44, cqes=64, flags=40, user_addr=0}}) = 3\nmmap(NULL, 2368, PROT_READ|PROT_WRITE, MAP_SHARED|MAP_POPULATE, 3, 0) = 0x7f70a4ba0000\nmmap(NULL, 4096, PROT_READ|PROT_WRITE, MAP_SHARED|MAP_POPULATE, 3, 0x10000000) = 0x7f70a4b9f000\nio_uring_enter(3, 1, 1, IORING_ENTER_GETEVENTS, NULL, 8Hello, World!\n) = 1\nio_uring_enter(3, 1, 1, IORING_ENTER_GETEVENTS, NULL, 8) = 1\nmunmap(0x7f70a4b9f000, 4096)            = 0\nmunmap(0x7f70a4ba0000, 2368)            = 0\nclose(3)                                = 0\nmunmap(0x7f70a4ba1000, 548864)          = 0\nexit_group(0)                           = ?\n+++ exited with 0 +++\n</code></pre><p>Key point here being that the  function is identical between those two snippets.</p><p>Moving beyond Hello World, the Zig compiler itself works fine using , both with io_uring and with GCD, but as mentioned above, there is a not-yet-diagnosed performance degradation when doing so.</p></div><div><p>If you have a Zig project with dependencies, two big changes just landed which I think you will be interested to learn about.</p><p>Fetched packages are now stored  in the  directory of the project root (next to your  file).</p><p>For example here are a few results from <a href=\"https://codeberg.org/awebo-chat/awebo\" target=\"_blank\">awebo</a> after running :</p><pre><code>$ du -sh zig-pkg/*\n13M    freetype-2.14.1-alzUkTyBqgBwke4Jsot997WYSpl207Ij9oO-2QOvGrOi\n20K    opus-0.0.2-vuF-cMAkAADVsm707MYCtPmqmRs0gzg84Sz0qGbb5E3w\n4.3M   pulseaudio-16.1.1-9-mk_62MZkNwBaFwiZ7ZVrYRIf_3dTqqJR5PbMRCJzSuLw\n5.2M   uucode-0.1.0-ZZjBPvtWUACf5dqD_f9I37VGFsN24436CuceC5pTJ25n\n728K   vaxis-0.5.1-BWNV_AxECQCj3p4Hcv4U3Yo1WMUJ7Z2FUj0UkpuJGxQQ\n</code></pre><p>It is highly recommended to add this directory to the project-local source control ignore file (e.g. ). However, by being outside of , it provides the possibility of distributing self-contained source tarballs, which contain all dependencies and therefore can be used to build offline, or for archival purposes.</p><p>Meanwhile, an  copy of the dependency is cached globally. After filtering out all the unused files based on the  filter, the contents are recompressed:</p><pre><code>$ du -sh ~/.cache/zig/p/*\n2.4M    freetype-2.14.1-alzUkTyBqgBwke4Jsot997WYSpl207Ij9oO-2QOvGrOi.tar.gz\n4.0K    opus-0.0.2-vuF-cMAkAADVsm707MYCtPmqmRs0gzg84Sz0qGbb5E3w.tar.gz\n636K    pulseaudio-16.1.1-9-mk_62MZkNwBaFwiZ7ZVrYRIf_3dTqqJR5PbMRCJzSuLw.tar.gz\n880K    uucode-0.1.0-ZZjBPvtWUACf5dqD_f9I37VGFsN24436CuceC5pTJ25n.tar.gz\n120K    vaxis-0.5.1-BWNV_BFECQBbXeTeFd48uTJRjD5a-KD6kPuKanzzVB01.tar.gz\n</code></pre><p>The motivation for this change is to make it easier to tinker. Go ahead and edit those files, see what happens. Swap out your package directory with a git clone. Grep your dependencies all together. Configure your IDE to auto-complete based on the  directory. <a href=\"https://codeberg.org/awebo-chat/awebo/issues/61\" target=\"_blank\">Run baobab on your dependency tree</a>. Furthermore, by having the global cache have compressed files instead makes it easier to share that cached data between computers. In the future, <a href=\"https://github.com/ziglang/zig/issues/23236\" target=\"_blank\">it is planned to support peer-to-peer torrenting of dependency trees</a>. By recompressing packages into a canonical form, this will allow peers to share Zig packages with minimal bandwidth. I love this idea because it simultaneously provides resilience to network outages, as well as a popularity contest. Find out which open source packages are popular based on number of seeders!</p><p>The second change here is the addition of the  flag to .</p><p>In retrospect, it seems so obvious, I don’t know why I didn’t think of it since the beginning. It looks like this:</p><p>This is a  option. Given a path to a source checkout of a project, all packages matching that project across the entire dependency tree will be overridden.</p><p>Thanks to the fact that package content hashes include name and fingerprint, <strong>this resolves before the package is potentially fetched</strong>.</p><p>This is an easy way to temporarily use one or more forks which are in entirely separate directories. You can iterate on your entire dependency tree until everything is working, while using comfortably the development environment and source control of the dependency projects.</p><p>The fact that it is a CLI flag makes it appropriately ephemeral. The moment you drop the flags, you’re back to using your pristine, fetched dependency tree.</p><p>If the project does not match, an error occurs, preventing confusion:</p><pre><code>$ zig build --fork=/home/andy/dev/mime\nerror: fork /home/andy/dev/mime matched no mime packages\n$\n</code></pre><p>If the project does match, you get a reminder that you are using a fork, preventing confusion:</p><pre><code>$ zig build --fork=/home/andy/dev/dvui\ninfo: fork /home/andy/dev/dvui matched 1 (dvui) packages\n...\n</code></pre><p>This functionality is intended to enhance the workflow of dealing with ecosystem breakage. I already tried it a bit and found it to be quite pleasant to work with. The new workflow goes like this:</p><ol><li>Fail to build from source due to ecosystem breakage.</li><li>Tinker with  until your project works again. During this time you can use the actual upstream source control, test suite, <code>zig build test --watch -fincremental</code>, etc.</li><li>Now you have a new option: be selfish and just keep working on your own stuff, or you can proceed to submit your patches upstream.</li></ol><p>…and you can probably skip the step where you switch your  to your fork unless you expect upstream to take a long time to merge your fixes.</p></div><div><p>The Windows operating system provides a large ABI surface area for doing things in the kernel. However, not all ABIs are created equally. As Casey Muratori points out in his lecture, <a href=\"https://www.youtube.com/watch?v=5IUj1EZwpJY\" target=\"_blank\">The Only Unbreakable Law</a>, the organizational structure of software development teams has a direct impact on the structure of the software they produce.</p><p>The DLLs on Windows are organized into a heirarchy, with some of the APIs being high-level wrappers around lower-level ones. For example, whenever you call functions of , ultimately, the actual work is done by . You can observe this directly by using ProcMon.exe and examining stack traces.</p><p>What we’ve learned empirically is that the ntdll APIs are generally well-engineered, reasonable, and powerful, but the kernel32 wrappers introduce unnecessary heap allocations, additional failure modes, unintentional CPU usage, and bloat.</p><p>This is why the Zig standard library policy is to <a href=\"https://codeberg.org/ziglang/zig/issues/31131\" target=\"_blank\">Prefer the Native API over Win32</a>. We’re not quite there yet - we have plenty of calls into kernel32 remaining - but we’ve taken great strides recently. I’ll give you two examples.</p><p>According to the official documentation, Windows does not have a straightforward way to get random bytes.</p><p>Unfortunately, starting with Windows 8, the first time you call this function, it dynamically loads  and calls <a href=\"https://learn.microsoft.com/en-us/windows/win32/seccng/processprng\" target=\"_blank\">ProcessPrng</a>. If loading the DLL fails (for example due to an overloaded system, which we have observed on Zig CI several times), it returns error 38 (from a function that has  return type and is documented to never fail).</p><p>The first thing  does is heap allocate a small, constant number of bytes. If this fails it returns  in a  (documented behavior is to never fail, and always return ).</p><p> apparently also runs a test suite every time you load it.</p><p>All that  is  doing is  on  and reading 48 bytes with  to get a seed, and then initializing a per-CPU AES-based CSPRNG.</p><p>So the dependency on  and  can both be avoided, and the nondeterministic failure and latencies on first RNG read can also be avoided.</p><h2>Example 2: NtReadFile and NtWriteFile</h2><pre><code></code></pre><p> looks like this:</p><pre><code></code></pre><p>As a reminder, <em>the above function is implemented by calling the below function</em>.</p><p>Already we can see some nice things about using the lower level API. For instance, the  API simply gives us the error code as the return value, while the kernel32 wrapper hides the status code somewhere, returns a  and then requires you to call  to find out what went wrong. Imagine! Returning a value from a function 🌈</p><p>Furthermore,  is a fake type. The Windows kernel doesn’t actually know or care about it at all! The actual primitives here are events, APCs, and .</p><p>If you have a synchronous file handle, then  and  must be . You get the answer in the  immediately. If you pass an APC routine here then some old bitrotted 32-bit code runs and you get garbage results.</p><p>On the other hand if you have an asynchronous file handle, then you need to either use an  or an .  uses events, which means that it’s doing extra, unnecessary resource allocation and management just to read from a file. Instead, Zig now passes an APC routine and then calls . This integrates seamlessly with cancelation, making it possible to cancel tasks while they perform file I/O, regardless of whether the file was opened in synchronous mode or asynchronous mode.</p><p>For a deeper dive into this topic, please refer to this issue:</p></div><div><p>Over the past month or so, several enterprising contributors have taken an interest in the <a href=\"https://codeberg.org/ziglang/zig/issues/30978\" target=\"_blank\">zig libc subproject</a>. The idea here is to incrementally delete redundant code, by providing libc functions as Zig standard library wrappers rather than as vendored C source files. In many cases, these functions are one-to-one mappings, such as  or , or trivially wrap a generic function, like :</p><pre><code></code></pre><p>So far, roughly 250 C source files have been deleted from the Zig repository, with 2032 remaining.</p><p>With each function that makes the transition, Zig gains independence from third party projects and from the C programming language, compilation speed improves, Zig’s installation size is simplified and reduced, and user applications which statically link libc enjoy reduced binary size.</p><p>Additionally, a <a href=\"https://codeberg.org/ziglang/zig/pulls/31037\" target=\"_blank\">recent enhancement</a> now makes zig libc share the Zig Compilation Unit with other Zig code rather than being a separate static archive, linked together later. This is one of the advantages of Zig having an integrated compiler and linker. When the exported libc functions share the ZCU, redundant code is eliminated because functions can be optimized together. It’s kind of like enabling LTO (Link-Time Optimization) across the libc boundary, except it’s done properly in the frontend instead of too late, in the linker.</p><p>Furthermore, when this work is combined with the recent <a href=\"https://codeberg.org/ziglang/zig/issues/30150\" target=\"_blank\">std.Io changes</a>, there is potential for users to seamlessly control how libc performs I/O - for example forcing all calls to  and  to participate in an io_uring event loop, even though that code was not written with such use case in mind. Or, <a href=\"https://codeberg.org/ziglang/zig/pulls/30788\" target=\"_blank\">resource leak detection</a> could be enabled for third-party C code. For now this is only a vaporware idea which has not been experimented with, but the idea intrigues me.</p><p>Big thanks to Szabolcs Nagy for <a href=\"https://wiki.musl-libc.org/libc-test.html\" target=\"_blank\">libc-test</a>. This project has been a huge help in making sure that we don’t regress any math functions.</p><p>As a reminder to our users, now that Zig is transitioning to being the static libc provider, if you encounter issues with the musl, mingw-w64, or wasi-libc libc functionality provided by Zig, <strong>please file bug reports in Zig first</strong> so we don’t annoy maintainers for bugs that are in Zig, and no longer vendored by independent libc implementation projects.</p></div>","contentLength":14190,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=47012717"},{"title":"OpenAI should build Slack","url":"https://www.latent.space/p/ainews-why-openai-should-build-slack","date":1771055413,"author":"swyx","guid":269,"unread":true,"content":"<p><strong>well okay, Sam: You Should Build Slack. </strong><a href=\"https://www.bigtechnology.com/p/enterprise-will-be-a-top-openai-priority\" rel=\"\">Enterprise</a></p><p><strong>Everything could be better</strong><a href=\"https://youtu.be/CnaegIpkenA?si=dizG0NIKTYXG0Lwz&amp;t=832\" rel=\"\">complained on the latest All In podcast</a></p><p>Slack Connect is great though, definitely just clone that.</p><p>In the desktop wars, Anthropic has pursued a far more cohesive strategy than OpenAI: one app for Chat, Cowork, and Claude Code, with optional control of the browser via Claude in Chrome. </p><p><a href=\"https://betterthanrandom.substack.com/p/shipping-the-org-chart\" rel=\"\">shipped the org chart</a><a href=\"https://chatgpt.com/download\" rel=\"\">chat app here</a><a href=\"https://openai.com/index/introducing-chatgpt-atlas/\" rel=\"\">browser app</a><a href=\"https://openai.com/index/introducing-the-codex-app/\" rel=\"\">coding app</a></p><p><a href=\"https://latent.space/p/noam-brown\" rel=\"\">you care about the multiagent</a><a href=\"https://www.cnbc.com/2025/12/09/openai-slack-ceo-denise-dresser-chief-revenue-officer.html\" rel=\"\">Slack CEO Denise Dresser in Dec</a></p><p><a href=\"https://calv.info/openai-reflections\" rel=\"\">you guys use this thing more than email</a></p><p><a href=\"https://x.com/swyx/status/2021498862012334274\" rel=\"\">given your designer access to your coding agent</a><strong>God’s given orchestration interface: chat</strong></p><p><strong>reinvent the future of work</strong></p><ul><li><p><strong>Is it a big deal if you get it right?</strong></p></li><li><p><strong><a href=\"https://www.latent.space/p/ainews-context-graphs-hype-or-actually\" rel=\"\">context graph</a><a href=\"https://www.latent.space/p/ainews-ai-vs-saas-the-unreasonable\" rel=\"\">Frontier</a></strong></p></li></ul><blockquote><p><em><a href=\"https://x.com/swyx/status/2022580899737673810\" rel=\"\">Twitter</a></em></p></blockquote><p><a href=\"https://www.dwarkesh.com/p/dario-amodei-2\" rel=\"\">new Dwarkesh-Dario pod </a><a href=\"https://news.ycombinator.com/item?id=47006594\" rel=\"\">OpenAI claimed a big result</a></p><p><strong>MiniMax M2.5 open-sourcing: agent-native RL, speed/cost, and rapid ecosystem uptake</strong></p><ul><li><p><strong>MiniMax-M2.5 is now open source</strong><strong>RL across hundreds of thousands of real-world environments</strong><a href=\"https://twitter.com/MiniMax_AI/status/2022310932693897628\" rel=\"\">MiniMax announcement</a><a href=\"https://twitter.com/vllm_project/status/2022311342225678757\" rel=\"\">vLLM</a><a href=\"https://twitter.com/lmsysorg/status/2022319102560555401\" rel=\"\">lmsys</a></p></li><li><p><strong>The practical headline is economics + throughput, not just score</strong><a href=\"https://twitter.com/MiniMax_AI/status/2022379949336957254\" rel=\"\">MiniMax</a><a href=\"https://twitter.com/omarsar0/status/2022384166034190528\" rel=\"\">omarsar0</a><a href=\"https://twitter.com/pcuenq/status/2022336556326060341\" rel=\"\">pcuenq</a><a href=\"https://twitter.com/ivanfioravanti/status/2022338870172684655\" rel=\"\">ivanfioravanti</a></p></li><li><p><strong>Forge RL training system details leak into the narrative</strong><strong>process reward + completion-time reward</strong><strong>millions of trajectories/day</strong><a href=\"https://twitter.com/YouJiacheng/status/2022339475049947576\" rel=\"\">YouJiacheng</a><a href=\"https://twitter.com/MiniMax_AI/status/2022370086397624476\" rel=\"\">MiniMax reply</a></p></li><li><p><strong>Independent reviews: “viable for multi-turn work” but token-hungry</strong><a href=\"https://twitter.com/ZhihuFrontier/status/2022214461415993817\" rel=\"\">ZhihuFrontier</a><a href=\"https://twitter.com/teortaxesTex/status/2022223441005621556\" rel=\"\">teortaxesTex</a></p></li><li><p><strong>Ecosystem uptake is immediate</strong><a href=\"https://twitter.com/HaihaoShen/status/2022293472796180676\" rel=\"\">HaihaoShen</a></p></li></ul><p><strong>GLM‑5 and the “near-frontier” open model wave: performance, infra constraints, and eval chatter</strong></p><ul><li><p><a href=\"https://twitter.com/togethercompute/status/2022354579858289052\" rel=\"\">Together</a><a href=\"https://twitter.com/wandb/status/2022389206572765697\" rel=\"\">W&amp;B</a><a href=\"https://twitter.com/jon_durbin/status/2022291772617945546\" rel=\"\">jon_durbin</a></p></li><li><p><strong>GLM‑5 qualitative review highlights</strong><a href=\"https://twitter.com/ZhihuFrontier/status/2022161058321047681\" rel=\"\">ZhihuFrontier on GLM‑5</a></p></li><li><p><strong>Benchmarks as a moving target</strong><a href=\"https://twitter.com/jyangballin/status/2022367240293949772\" rel=\"\">jyangballin</a><a href=\"https://twitter.com/teortaxesTex/status/2022255213394948360\" rel=\"\">teortaxesTex</a></p></li><li><p><strong>Cross-checking with alternative evals</strong><a href=\"https://twitter.com/maximelabonne/status/2022401174549512576\" rel=\"\">maximelabonne</a></p></li></ul><p><strong>Agent engineering in practice: file-based coordination, terminal-first workflows, and “agent OS” framing</strong></p><ul><li><p><strong>Claude Code “Agent Teams” internals are surprisingly simple</strong><code>~/.claude/teams/inboxes/{agent}.json</code><a href=\"https://twitter.com/peter6759/status/2022156692985983266\" rel=\"\">peter6759</a></p></li><li><p><strong>Terminal agents are becoming the default UX</strong><a href=\"https://twitter.com/cline/status/2022341254965772367\" rel=\"\">cline</a><a href=\"https://twitter.com/cline/status/2022341258979717196\" rel=\"\">cline details</a><a href=\"https://twitter.com/testingcatalog/status/2022348951459172604\" rel=\"\">testingcatalog</a><a href=\"https://twitter.com/dr_cintas/status/2022387444189139367\" rel=\"\">dr_cintas</a><a href=\"https://twitter.com/arafatkatze/status/2022415192932651302\" rel=\"\">arafatkatze</a></p></li><li><p><strong>Agent scaffolds may matter less than expected (for some horizons)</strong><a href=\"https://twitter.com/nikolaj2030/status/2022398669337825737\" rel=\"\">nikolaj2030</a><a href=\"https://twitter.com/ajeya_cotra/status/2022419978495127828\" rel=\"\">ajeya_cotra</a><a href=\"https://twitter.com/gneubig/status/2022451119310655909\" rel=\"\">gneubig</a></p></li><li><p><strong>“Agents as OS / filesystem as substrate”</strong><a href=\"https://twitter.com/levie/status/2022375298097111160\" rel=\"\">levie</a><a href=\"https://twitter.com/skirano/status/2022387763421810989\" rel=\"\">skirano</a></p></li><li><p><strong>Key operational lesson: make codebases “agent-ready”</strong><a href=\"https://twitter.com/dok2001/status/2022339274767520246\" rel=\"\">dok2001</a></p></li></ul><p><strong>RL/post-training research themes: process rewards, exploration, and rubric-based evaluation</strong></p><ul><li><p><strong>Length-Incentivized Exploration (LIE) for reasoning</strong><a href=\"https://twitter.com/dair_ai/status/2022360649817526275\" rel=\"\">dair_ai</a></p></li><li><p><strong>DPPO vs PPO and “trust region” framing</strong><a href=\"https://twitter.com/TheTuringPost/status/2022326245745377562\" rel=\"\">TheTuringPost</a></p></li><li><p><strong>Rubrics-as-rewards and evolving rubrics</strong><a href=\"https://twitter.com/cwolferesearch/status/2022384365049892974\" rel=\"\">cwolferesearch</a><a href=\"https://twitter.com/davidad/status/2022361016995319850\" rel=\"\">davidad</a></p></li><li><p><strong>∆Belief‑RL / information-seeking agents</strong><a href=\"https://twitter.com/ShashwatGoel7/status/2022341054939185345\" rel=\"\">ShashwatGoel7</a></p></li><li><p><strong>Human simulation as an RL target</strong><a href=\"https://twitter.com/ShirleyYXWu/status/2022374624676421676\" rel=\"\">ShirleyYXWu</a></p></li></ul><p><strong>Systems/infra and tooling: FP4 MoE kernels, faster ZeRO loads, model “skills,” and observability</strong></p><ul><li><p><strong>vLLM on GB300 + FP4 MoE acceleration</strong><strong>FlashInfer FP4 MoE kernel</strong><code>VLLM_USE_FLASHINFER_MOE_FP4=1</code><a href=\"https://twitter.com/vllm_project/status/2022308974150975792\" rel=\"\">vllm_project</a></p></li><li><p><strong>DeepSpeed ZeRO load-time fix</strong><a href=\"https://twitter.com/StasBekman/status/2022354880049082658\" rel=\"\">StasBekman</a></p></li><li><p><strong>Gemini “Skills” and multimodal tool calling</strong><a href=\"https://twitter.com/osanseviero/status/2022259577232785866\" rel=\"\">osanseviero</a><strong>multimodal function calling</strong><a href=\"https://twitter.com/_philschmid/status/2022349886318928158\" rel=\"\">philschmid</a><a href=\"https://twitter.com/OfficialLoganK/status/2022409335465480346\" rel=\"\">OfficialLoganK</a><a href=\"https://twitter.com/GoogleAIStudio/status/2022409735287537999\" rel=\"\">GoogleAIStudio</a></p></li><li><p><strong>Agent harness instrumentation</strong><a href=\"https://twitter.com/ArtificialAnlys/status/2022358995739254800\" rel=\"\">ArtificialAnlys</a></p></li><li><p><strong>Local fine-tuning &amp; Apple Silicon workflows</strong><a href=\"https://twitter.com/awnihannun/status/2022322714548338962\" rel=\"\">awnihannun</a><a href=\"https://twitter.com/awnihannun/status/2022327214218657948\" rel=\"\">awnihannun</a><a href=\"https://twitter.com/ActuallyIsaak/status/2022414004623479014\" rel=\"\">ActuallyIsaak</a></p></li></ul><p><strong>“AI accelerates science” moment: GPT‑5.2 + QFT result and the scaffolding narrative</strong></p><ul><li><p><strong>OpenAI claims a novel theoretical physics result with GPT‑5.2</strong><a href=\"https://twitter.com/OpenAI/status/2022390096625078389\" rel=\"\">OpenAI</a><a href=\"https://twitter.com/OpenAI/status/2022390104237707667\" rel=\"\">arXiv pointer</a><strong>proved it after ~12 hours</strong><a href=\"https://twitter.com/kevinweil/status/2022388305434939693\" rel=\"\">kevinweil</a></p></li><li><p><strong>Community reactions range from “significant journal-paper tier” to skepticism about interpretation</strong><a href=\"https://twitter.com/polynoamial/status/2022413904757035167\" rel=\"\">polynoamial</a><a href=\"https://twitter.com/teortaxesTex/status/2022401945429000685\" rel=\"\">teortaxesTex</a><a href=\"https://twitter.com/scaling01/status/2022401147110318586\" rel=\"\">scaling01</a></p></li></ul><ul><li><p><strong><a href=\"https://huggingface.co/models?sort=modified&amp;search=minimax+m2.5\" rel=\"\">Hugging Face</a></strong><strong> parameters, contrary to expectations of an increase to </strong><strong> like the GLM5 model. It offers a cost-effective operation at </strong><strong>, and is enhanced by the Forge reinforcement learning framework, which improves training efficiency and task generalization.</strong></p><ul><li><p>A user expressed surprise at the model’s size, noting that while they expected an increase to 800 billion parameters to compete with models like GLM5, the MiniMax-M2.5 remains at 220 billion parameters. This is considered impressive given its ‘frontier strength’, suggesting high performance despite the parameter count.</p></li><li><p>Another user mentioned the model’s Q4_K_XL size, which is approximately 130GB. This size is significant as it places the model just beyond the capabilities of some hardware, indicating a need for more robust systems to fully utilize the model’s potential.</p></li><li><p>There is anticipation for the release of FP4/AWQ, indicating that users are looking forward to further advancements or optimizations in the model’s performance or efficiency. This suggests a community eager for improvements that could enhance usability or reduce resource requirements.</p></li></ul></li><li><p><strong>OpenHands has announced the release of the MiniMaxAI MiniMax-M2.5 model, which features </strong><strong> active parameters. This model is noted for its performance, ranking 4th in the OpenHands Index, and is </strong><strong><a href=\"https://huggingface.co/cerebras\" rel=\"\">Source</a></strong></p><ul><li><p>The MiniMax-M2.5 model by Moonshot is notable for its architecture, which utilizes 230 billion parameters but only activates 10 billion at a time. This design choice is likely aimed at optimizing computational efficiency, allowing the model to perform well on less powerful hardware, such as GPUs that are not top-of-the-line. This approach could potentially offer a balance between performance and resource usage, making it accessible for more users.</p></li><li><p>A comparison is drawn between MiniMax-M2.5 and other large models like GLM and Kimi. GLM has had to double its parameters to maintain performance, while Kimi has reached 1 trillion parameters. The implication is that MiniMax-M2.5 achieves competitive performance with fewer active parameters, which could be a significant advancement in model efficiency and scalability.</p></li><li><p>The potential for further optimization through quantization is highlighted, suggesting that MiniMax-M2.5 could be made even more efficient. Quantization could reduce the model’s size and increase its speed, making it feasible to run on machines with 128GB of RAM while still leaving room for additional tasks such as deep-context tool use. This could make the model particularly attractive for users with limited computational resources.</p></li></ul></li><li><p><strong>Minimax M2.5 has been officially released, showcasing impressive benchmark results: </strong><strong>. The model is noted for its cost efficiency, with operational costs significantly lower than competitors like Opus, Gemini 3 Pro, and GPT-5. Specifically, running M2.5 at </strong><strong><a href=\"https://www.minimax.io/news/minimax-m25\" rel=\"\">official Minimax page</a></strong></p><ul><li><p>The Minimax M2.5 model is highlighted for its cost-effectiveness, with operational costs significantly lower than competitors like Opus, Gemini 3 Pro, and GPT-5. Specifically, running M2.5 at 100 tokens per second costs $1 per hour, and at 50 tokens per second, it costs $0.3 per hour. This translates to an annual cost of $10,000 for four instances running continuously, making it a potentially disruptive option in terms of affordability.</p></li><li><p>There is anticipation for the release of open weights on Hugging Face, which would allow for broader experimentation and integration into various applications. This suggests a community interest in transparency and accessibility for further development and benchmarking.</p></li><li><p>The potential impact of Minimax M2.5 on existing models like GLM 5.0 and Kimi 2.5 is discussed, with some users suggesting that if the reported benchmarks are accurate, M2.5 could surpass these models in popularity due to its ease of use and cost advantages. This indicates a shift in preference towards models that offer better performance-to-cost ratios.</p></li></ul></li></ul>","contentLength":7248,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=47012553"},{"title":"Show HN: SQL-tap – Real-time SQL traffic viewer for PostgreSQL and MySQL","url":"https://github.com/mickamy/sql-tap","date":1771043255,"author":"mickamy","guid":214,"unread":true,"content":"<p>sql-tap is a transparent proxy that captures SQL queries by parsing the PostgreSQL/MySQL wire protocol and displays them in a terminal UI. You can run EXPLAIN on any captured query. No application code changes needed — just change the port.</p>","contentLength":242,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=47011567"},{"title":"Oh, good: Discord's age verification rollout has ties to Palantir co-founder","url":"https://www.pcgamer.com/software/platforms/oh-good-discords-age-verification-rollout-has-ties-to-palantir-co-founder-and-panopticon-architect-peter-thiel/","date":1771040958,"author":"absqueued","guid":268,"unread":true,"content":"<p>Last week, Discord invited the contempt of its users by announcing it will be <a data-analytics-id=\"inline-link\" href=\"https://www.pcgamer.com/games/discord-is-rolling-out-facial-scanning-and-id-checks-in-march-for-everyone-who-doesnt-want-to-be-locked-into-a-teen-appropriate-experience/\" target=\"_blank\" data-url=\"https://www.pcgamer.com/games/discord-is-rolling-out-facial-scanning-and-id-checks-in-march-for-everyone-who-doesnt-want-to-be-locked-into-a-teen-appropriate-experience/\" data-hl-processed=\"none\" data-mrf-recirculation=\"inline-link\" data-before-rewrite-localise=\"https://www.pcgamer.com/games/discord-is-rolling-out-facial-scanning-and-id-checks-in-march-for-everyone-who-doesnt-want-to-be-locked-into-a-teen-appropriate-experience/\">rolling out global age verification</a> restrictions in March, which will restrict viewable content and communities for users who don't scan either their faces or government IDs and haven't already been determined to be an adult by unspecified prediction algorithms. <a data-analytics-id=\"inline-link\" href=\"https://www.windowscentral.com/software-apps/discord-alternative-search-10000-percent-stoat\" target=\"_blank\" data-url=\"https://www.windowscentral.com/software-apps/discord-alternative-search-10000-percent-stoat\" referrerpolicy=\"no-referrer-when-downgrade\" data-hl-processed=\"none\" data-mrf-recirculation=\"inline-link\">Approximately nobody</a> thought this was cool.</p><p>Impossibly, despite its attempts to pacify the ensuing outcry by issuing a clarification that merely users will be required to submit to its child detection matrix, Discord has managed to make the rollout of its global age assurance policy seem even grimier. The company has informed some users in the UK they may be part of \"an experiment\" with Persona, an age verification vendor whose investors include Peter Thiel, co-founder of ICE's premier surveillance provider, Palantir.</p><figure data-bordeaux-image-check=\"\"><figcaption itemprop=\"caption description\"></figcaption></figure><p>In the days since Discord's age assurance policy announcement, reports began <a data-analytics-id=\"inline-link\" href=\"https://x.com/GiveMeBanHammer/status/2021851054519001133?s=20\" target=\"_blank\" data-url=\"https://x.com/GiveMeBanHammer/status/2021851054519001133?s=20\" referrerpolicy=\"no-referrer-when-downgrade\" data-hl-processed=\"none\" data-mrf-recirculation=\"inline-link\">bubbling up on social media</a> from users in the UK—where Discord already requires age verification as a result of <a data-analytics-id=\"inline-link\" href=\"https://www.pcgamer.com/hardware/brits-can-get-around-discords-age-verification-thanks-to-death-strandings-photo-mode-bypassing-the-measure-introduced-with-the-uks-online-safety-act-we-tried-it-and-it-works-thanks-kojima/\" target=\"_blank\" data-url=\"https://www.pcgamer.com/hardware/brits-can-get-around-discords-age-verification-thanks-to-death-strandings-photo-mode-bypassing-the-measure-introduced-with-the-uks-online-safety-act-we-tried-it-and-it-works-thanks-kojima/\" data-hl-processed=\"none\" data-mrf-recirculation=\"inline-link\" data-before-rewrite-localise=\"https://www.pcgamer.com/hardware/brits-can-get-around-discords-age-verification-thanks-to-death-strandings-photo-mode-bypassing-the-measure-introduced-with-the-uks-online-safety-act-we-tried-it-and-it-works-thanks-kojima/\">its 2025 Online Safety Act</a>—who were presented with prompts to consent to age verification processed by the company Persona.</p><p>Sure enough, <a data-analytics-id=\"inline-link\" href=\"https://support.discord.com/hc/en-us/articles/30326565624343-How-to-Complete-Age-Assurance-on-Discord\" target=\"_blank\" data-url=\"https://support.discord.com/hc/en-us/articles/30326565624343-How-to-Complete-Age-Assurance-on-Discord\" referrerpolicy=\"no-referrer-when-downgrade\" data-hl-processed=\"none\" data-mrf-recirculation=\"inline-link\">Discord's support article</a> describing its age verification process now features a disclaimer informing UK users that they \"may be part of an experiment where your information will be processed by an age-assurance vendor, Persona.\" And while Discord had previously insisted that facial age verification recordings would only be stored and processed locally, the notice about Persona says that \"the information you submit will be temporarily stored for up to 7 days, then deleted.\"</p><p>While some users have speculated that Discord is testing alternate age verification providers because k-ID—its primary age authentication partner—has proven <a data-analytics-id=\"inline-link\" href=\"https://www.404media.co/free-tool-says-it-can-bypass-discords-age-verification-check-with-a-3d-model/\" target=\"_blank\" data-url=\"https://www.404media.co/free-tool-says-it-can-bypass-discords-age-verification-check-with-a-3d-model/\" referrerpolicy=\"no-referrer-when-downgrade\" data-hl-processed=\"none\" data-mrf-recirculation=\"inline-link\">susceptible to creative workarounds</a>, Discord doesn't specify why some users will be processed by Persona instead.</p><figure data-bordeaux-image-check=\"\"><figcaption itemprop=\"caption description\"></figcaption></figure><p>Regardless of the reasoning, the partnership with Persona has compounded concerns about privacy due to the company's investors. In its two <a data-analytics-id=\"inline-link\" href=\"https://www.forbes.com/sites/rashishrivastava/2025/04/30/ai-is-making-the-internets-bot-problem-worse-this-2-billion-startup-is-on-the-front-lines/\" target=\"_blank\" data-url=\"https://www.forbes.com/sites/rashishrivastava/2025/04/30/ai-is-making-the-internets-bot-problem-worse-this-2-billion-startup-is-on-the-front-lines/\" referrerpolicy=\"no-referrer-when-downgrade\" data-hl-processed=\"none\" data-mrf-recirculation=\"inline-link\">most recent</a> rounds of <a data-analytics-id=\"inline-link\" href=\"https://www.bloomberg.com/news/articles/2021-09-15/founders-fund-values-identity-startup-persona-at-1-5-billion\" target=\"_blank\" data-url=\"https://www.bloomberg.com/news/articles/2021-09-15/founders-fund-values-identity-startup-persona-at-1-5-billion\" referrerpolicy=\"no-referrer-when-downgrade\" data-hl-processed=\"none\" data-mrf-recirculation=\"inline-link\">venture capital funding</a>, its lead investor has been Founders Fund—the venture fund co-founded and directed by Peter Thiel.</p><p>And listen, I know people harp on this a lot, but it's a company <em>literally named after an orb that lets the most evil force in the world spy on your thoughts.</em></p><p>If that's not enough for you to be unsettled by Thiel's money being involved in Discord's age verification rollout, the billionaire—who <a data-analytics-id=\"inline-link\" href=\"https://www.cato-unbound.org/2009/04/13/peter-thiel/education-libertarian/\" target=\"_blank\" data-url=\"https://www.cato-unbound.org/2009/04/13/peter-thiel/education-libertarian/\" referrerpolicy=\"no-referrer-when-downgrade\" data-hl-processed=\"none\" data-mrf-recirculation=\"inline-link\">infamously wrote</a> \"I no longer believe that freedom and democracy are compatible\" in 2009—appeared <a data-analytics-id=\"inline-link\" href=\"https://www.wired.com/story/epstein-files-tech-elites-gates-thiel-musk/\" target=\"_blank\" data-url=\"https://www.wired.com/story/epstein-files-tech-elites-gates-thiel-musk/\" referrerpolicy=\"no-referrer-when-downgrade\" data-hl-processed=\"none\" data-mrf-recirculation=\"inline-link\">more than 2,200 times</a> in the latest release of the Epstein files, where he coordinated years of meetings with the convicted child predator and sex trafficker.</p>","contentLength":2783,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=47011346"},{"title":"An AI agent published a hit piece on me – more things have happened","url":"https://theshamblog.com/an-ai-agent-published-a-hit-piece-on-me-part-2/","date":1771029473,"author":"scottshambaugh","guid":267,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=47009949"},{"title":"Homeland Security Wants Social Media Sites to Expose Anti-ICE Accounts","url":"https://www.nytimes.com/2026/02/13/technology/dhs-anti-ice-social-media.html","date":1771027258,"author":"jjwiseman","guid":266,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=47009582"},{"title":"IBM tripling entry-level jobs after finding the limits of AI adoption","url":"https://fortune.com/2026/02/13/tech-giant-ibm-tripling-gen-z-entry-level-hiring-according-to-chro-rewriting-jobs-ai-era/","date":1771025649,"author":"WhatsTheBigIdea","guid":265,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=47009327"}],"tags":["dev","hn"]}